
IGIHE
  


Minisitiri Uwimana yasabye abana kudapfusha ubusa amahirwe igihugu kibaha
 3-09-2024 - saa 07:54,  Theodomire Munyengabe
Minisitiri w’Uburinganire n’Iterambere ry’Umuryango (MIGEPROF), Uwimana Consolée, yasabye abana kudapfusha ubusa amahirwe igihugu kibaha, baharanira kuzagira ejo heza kandi bakazirikana uruhare rwabo mu buzima bw’ahazaza h’igihugu.

Ibi yabigarutseho ku wa 02 Nzeri 2024, ubwo hasozwaga Inama Nkuru y’Igihugu ya 17 y’Abana y’iminsi itatu, yabereye mu Karere ka Huye, ku nsanganyamatsiko igira iti ‘Ejo ni Njye’.

Minisitiri Uwimana yavuze ko kuba igihugu gitekereza inama nk’iyi bishimangira ko kizirikana iterambere rishingiye ku mwana.

Agaruka ku nsanganyamatsiko y’uyu mwaka, Minisitiri Uwimana yavuze ko u Rwanda rwifuza abana bafite ejo hazaza heza kandi bafata inshingano zo kumva ko ejo bakenewe.

Ati “Tuzi ko 44,5% by’abaturage b’u Rwanda ari abana. Ndifuza ko abana bose bumva ko ejo h’u Rwanda ari bo hareba, buri wese yibaze, yifuze icyo yumva azaba, maze yisubize. Ejo ni Perezida, ni njye Minisitiri, ejo ni njye muganga mukuru mu bitaro, ejo ni njye mupilote muri RwandAir, ejo nzaba ndi guverineri cyangwa Jenerari mu ngabo z’u Rwanda.’’

Yakomeje avuga ko yifuriza abana bose kuzakabya inzozi zabo, ariko anabibutsa ko n’ubwo hari ibyo basaba nk’abana, nabo hari ibyo basabwa.

Ati “Kugira ngo muzagere ku byo mwifuza, mwirinde inzoga n’ibiyobyabwenge, mwirinde ubuzererezi n’ubusambanyi, imikino y’amahirwe imwe bita ‘betting’ n’indi mico mibi, munirinde kandi ibigare, mwumvire abarezi n’abayobozi banyu, mwige cyane munasubire mu masomo, kandi munagire ikinyabupfura.’’

Kalimpinya Queen wigeze guhatana mu marushanwa ya Nyampinga w’u Rwanda, akaba anakina umukino wo gutwara imodoka, yaganirije abana ibyiza byo kugira intego no guharanira kugira inshuti nziza zikuyobora mu byiza kuko ari byo bifasha umuntu kugira icyo ageraho mu buzima.

Ashingiye ku buzima bwe, yabwiye abana uko inshuti biganaga ari yo yatumye afata intego yo kuzatsinda neza ibizamini bya Leta mu mushuri yisumbuye, kubera uburyo yamuteraga imbaraga, asaba aba bana nabo kujya bisunga abantu babaganisha aheza.

Kalimpinya, yanakomoje ku buryo yagiye mu irushanwa rya nyampinga w’u Rwanda, asa n’utabyumva, ariko bagenzi be bakamusaba kujya kugerageza, bikarangira bimugiriye akamaro mu bundi buzima.

Ati “Nakuyemo isomo namwe nshaka kubasangiza, burya nta gihombo kiri mu kugerageza ikintu kidafite icyo kiguhombya, kuko iyo cyanze ntuba ubombye kurusha kutagerageza.’’

Mu bindi biganiro byatanzwe, abana cyane cyane abakobwa baganarijwe ku buryo bwo kwirinda ababashuka babashora mu busambanyi n’ibindi bishuko byose byabicira ejo hazaza habo.

Guverinoma y’u Rwanda ibinyujije mu Kigo cy’Igihugu Gishinzwe Imikurire no Kurengera Umwana (NCDA) n’abafatanyabikorwa, ni bo bategura Inama Nkuru y’Igihugu y’Abana, ikaba yitabirwa n’abana bahagarariye abandi ku rwego rw’umurenge n’akarere. Igamije guha urubuga abana bagatanga ibitekerezo kuri gahunda z’Igihugu no kugira uruhare mu bibakorerwa.

Mu nama iheruka yabereye mu kigo cy’Ubutore cya Nkumba mu Karere ka Burera, abana bahagarariye abandi batanze ibitekerezo byitaweho mu gutegura gahunda ya Guverinoma yo kwihutisha Iterambere (NST2), indi mpamvu ishimangira agaciro kabo.

Inama Nkuru y’Igihugu y’Abana yatangiye mu mwaka wa 2004, ikaba yitabirwa n’abana bahagararira abandi batorwa binyuze mu mahuriro ya komite z’abana kuva ku rwego rw’umudugudu kugeza ku rwego rw’akarere, batorerwa manda y’imyaka ine.

Ubusanzwe, komite y’ihuriro ry’abana kuri buri rwego iba igizwe na Perezida, Visi Perezida, Umunyamabanga, Abajyanama 2 n’uhagarariye abafite ubumuga.


Kuri iyi nshuro ya 17, abana basaga 2000 bahagarariye abandi mu baturutse mu gihugu hose, ni bo bitabiriye iyi nama

Iyi nama itegurwa na NCDA ifatanyije n'abafatanyabikorwa bayo batandukanye

Muri iyi nama kandi abana basabana n'abayobozi

Minisitiri Uwimana yasabye abana kudapfusha ubusa amahirwe igihugu kibaha
Kwamamaza

Kwamamaza

Izindi nkuru wasoma
Abatega imodoka rusange bose muri Kigali, bazinjira mu 2025 bishyura gusa ahwanye n’urugendo bagenze
 0  4-12-2024
Ikiganiro n’Umuyobozi Mukuru wa RSSB: Yavuye imuzi ibyo kongera umusanzu wa pansiyo ( Video)
 0  4-12-2024
Ibihugu 19 bikoresha Igifaransa biri kwigira hamwe uburyo bwo guhashya Malariya
 0  4-12-2024
Hafashwe batatu biyandikishagaho ubutaka butari ubwabo bakabugurisha ba nyirabwo batabizi
 0  4-12-2024
Kwamamaza

TANGA IGITEKEREZO

AMATEGEKO AGENGA IYANDIKA RY'IGITEKEREZO CYAWE
Kwamamaza

 Twandikire
 Duhamagare kuri 4546

 Kwamamaza
 Abo turi bo




Image

AMATORA Y'ABAGIZE KOMITE Y'IHURIRO RY'ABANA KU RWEGO RW'AKARERE KA MUSANZE YITABIRIWE KU KIGERO CY'IJANA KU IJANA


Nkuko byari biteganyijwe, kuri uyu wa gatanu tariki ya 09/09/2022, ku rwego rw'Akarere ka Musanze habaye amatora y'Abagize komite y'Ihuriro ry'abana. Abagize Inteko itora bari abagize Komite z'Ihuriro ry'abana zatowe mu Mirenge 15 igize Akarere ka Musanze. Ubwitabire bwabaye 100% .

Ni amatora yanitabiriwe n'Umuyobozi w'Akarere Bwana RAMULI Janvier wari kumwe n'Umuyobozi w'Ingabo zikorera mu Turere twa Burera, Musanze na Gakenke Col Nelson RWIGEMA, intumwa ya NCDA Mme NIRAGIRE Betty n'abafite abana mu nshingano ku rwego rw'Akarere n'Imirenge. Igishimishije kandi hari na bamwe mu babyeyi baje baherekeje abana babo. Amatora yayobowe n'umukorerabushake wa Komisiyo y'Igihugu y'Amatora Bwana NSANZABAGANWA Alexis.

Umuyobozi w'Akarere yakurikiranye uko iki gikorwa cyagenze. Mu butumwa bwe, Umuyobozi w'Akarere yashimiye cyane abana batowe, aboneraho no kubasaba gukomeza gukunda ishuri cyane ko mu myaka iri imbere aribo bazavamo abayobozi mu nzego zitandukanye za Leta, inzego z'umutekano, inzego z'abikorera,... Amatora yakozwe mu mucyo no mu bwisanzure.

Abatowe bagize Komite y'Ihuriro ry'abana ku rwego rw'Akarere ni aba bakurikira:

Perezida: MIZERO Jean Aimé Fidèle - Busogo

Visi Perezida: MUKAPASIKA Angelique - Nkotsi

Umunyamabanga: IZERE Fréderic - Shingiro

Umujyanama 1: TETA Oliane - Musanze

Umujyanama 2: ABAYISENGA Bless - Shingiro

Uhagarariye abafite ubumuga: HASHIMWIMANA Joseph Gisa - Musanze.

Twifurije abatowe bose ku rwego rw'Akarere, Imirenge n'Utugari kuzasohoza neza inshingano batorewe.

Kamanzi Jean Bosco

Ag PRMCO

Dukurikirane

4042

info@musanze.gov.rw





© 2024 Repubulika y' u Rwanda


↑
Back top




Welcome to x.com!
We are letting you know that we are changing our URL, but your privacy and data protection settings remain the same.
For more details, see our Privacy Policy: https://x.com/en/privacy

See new posts
Conversation
Jean Marie Vianney Munyaneza reposted
National Child Development Agency | Rwanda
@Rwanda_Child
Tunejejwe no kubagezaho gahunda y'amatora y'Ihuriro ry'Abana mu gihugu hose:
📌5/9/2022: Ku kagari hazabera amatora yo ku rwego rw’umudugudu n’akagari.
📌7/9/2022: Ku murenge habere amatora yo ku rwego rw’umurenge. 
📌9/9/2022: Ku karere, habere amatora yo ku rwego rw'akarere.
9:01 AM · Aug 31, 2022


 gahunda mbonezamikurire y’Abana bat

