ly the Universal Declaration of Human Rights published?/En quelle année la Déclaration universelle desdroits de I'homme a-t-elle été publiée ?

1945
1946
1948
None of the mentioned/Aucun des mentionnés
Correct answer: C.1948

Explanation: The Declaration was adopted by the UN General Assembly in Paris on 10 December 1948 during its 183rd plenary meeting.

Q17.The Sector Executive Secretary has the responsibility from the preparation of Imihigo, monitoring its implementation, evaluation and reporting of imihigo to the district. So, how many are the major ambitious aims of performance contract(imihigo)?/Le secrétaire exécutif de secteur a la responsabilité de la préparation d'imihigo, du suivi de sa mise en ceuvre, de I'évaluation et de faire lerapport d'imihigo au district. Alors, combien sont les grands objectifs ambitieux du contrat de performance (imihigo)?

eight/huit
Six/Six
Seven/ Sept
None of the mentioned/Aucun des mentionnés
Correct answer: A. Eight/Huit

Explanation: Imihigo has the following 8 objectives:

To speed up implementation of the local and national development agenda
To ensure stakeholder ownership of the development agenda
To promote accountability and transparency
To promote results-oriented performance
To instill innovation and encourage competitiveness
To engage stakeholders (citizens, civil society, donors, private sector, etc.) in policy formulation and evaluation
To promote zeal and determination to achieve set goals
To instill a culture of regular performance evaluation
Q18.The planning cycle involves .... key actions. /Le cycle de planification implique .... actions clés.

Five/Cinq
four/quatre
six/six
None of the mentioned/Aucun des mentionnés
Correct answer: C. Six

Explanation: The planning cycle is a set of stages that describe how you can successfully carry out any activity in your business to achieve the goals. The different 6 stages of the planning cycle include defining goals, setting premises, evaluating alternatives, identifying resources, formulating and implementing the plan, and monitoring the plan.

 

Q19. Which organ has the responsibility to collects reports of the implementation of performance contracts from all State organs?Quel est I'organe qui la responsabilité de collecter les rapports d'exécution des contrats de performance en provenance de tous lesorganes de I'Etat?

Ministry of local Government) Ministére de I'administration locale
The Province/La Province
The prime minister office/L'Cffice du premier minister
None of the mentioned/Aucun des mentionnés
Correct answer: D. None of the mentioned

Explanation: The Ministry in charge of planning collects reports of the implementation of performance contracts from all State organs and submits them to the Office of the Prime Minister.

ITEGEKO No 18/2017 RYO KU WA 28/04/2017 RIGENGA IMICUNGIRE Y’IMIHIGO IGAMIJE UMUSARURO MU NZEGO Z’UBUTEGETSI BWA LETA: LAW No 18/2017 OF 28/04/2017 GOVERNING RESULTS-BASED PERFORMANCE MANAGEMENT IN BRANCHES OF GOVERNMENT

Report on the monitoring of the implementation of performance contracts: The State organ concerned with this Law prepares a quarterly and annual report indicating, with figures, the results achieved in relation to the expected results in the performance contracts. The supervising organ of national commissions, specialized organs, national councils and public institutions collects quarterly and annual reports and submits them to the Ministry in charge of planning. The Ministry in charge of planning collects reports of the implementation of performance contracts from all State organs and submits them to the Office of the Prime Minister.

Raporo ku gukurikirana ishyirwa mu bikorwa ry’imihigo : Urwego rwa Leta rurebwa n’iri tegeko rukora raporo ya buri gihembwe na buri mwaka igaragaza mu mibare umusaruro wagezweho ugereranyije n’ibyari byateganyijwe mu mihigo. Urwego rureberera Komisiyo z’Igihugu, Inzego Zihariye, Inama z’Igihugu n’Ibigo bya Leta, rukusanya raporo za buri gihembwe na raporo z’umwaka rukazishyikiriza Minisiteri ifite igenamigambi mu nshingano zayo. Minisiteri ifite igenamigambi mu nshingano zayo ikusanya raporo z’ishyirwa mu bikorwa ry’imihigo zavuye mu nzego zose za Leta ikazishyikiriza Serivisi za Minisiteri w’Intebe.

 

Q20.Community Works Supervising Committeesof the Cell shall meet...... and whenever it is deemednecessary.Les Comités de supervision des travaux communautaires au niveau de la cellule se réunissent ...... et chaque foisque de besoin.

 

once (1) a month/Une fois le mois
Once two weeks/Une fois par deux semaines
Every week/chaque semaine
All answers are incorrect/ toutes les réponses sont incorectes
Corect answer: A. once (1) a month

 

 

Q21./ 21. The National Planning, Monitoring and Evaluation Framework and Actions are guided by....guiding principles./Le cadre

1 mark national de planification, de suivi et d'évaluation et les actions sont guidés par .... principes directeurs.

Answer

three/trois

5 | five cing

Cc seven/sept
---------------------------------------------
wHAT IS ISLAM
---------------------------------------------
Send
View
---------------------------------------------
Send
View