2.3. Umwandiko: Inkingo n’akamaro kazo

Iyo tuganiriye n’abasaza n’abakecuru bo mu miryango yacu, batubwira ko ubuzima bwa muntu bwagiye bwugarizwa n’indwara nyinshi zirimo n’iz’ibyorezo. Ngizo za mugiga, iseru, akaniga, imbasa, n’izindi. Ngo kera indwara z’ibyorezo zarabibasiraga zikabica umusubizo. Ariko muri ibyo byose impuguke n’abashakashatsi mu by’ubuzima ntibahwemye kubungabunga amagara y’abantu ngo barebe ko ibyo bisumizi byagenda nka nyomberi. Ni muri urwo rwego havumbuwe inkingo zinyuranye.

Izo nkingo zihabwa abana mu byiciro bitandukanye by’ubuzima bwabo hari n’izihabwa abakuze mu bihe bimwe na bimwe. Abagore batwite, abantu bagiye mu ngendo zitandukanye aho bashobora guhuriramo n’indwara z’ibikatu. Urugero nk’abasirikari cyangwa n’abaporisi bagiye mu butumwa bwo kubungabunga amahoro ku isi. Abana b’abakobwa bujuje imyaka cumi n’ibiri na bo bahabwa urukingo rwa kanseri y’inkondo y’umura.

Abantu bakuru muri rusange bajya bahabwa inkingo igihe hateye indwara z’ibikatu nka mugiga, indwara y’umwijima wo mu bwoko bwa epatite B n’izindi. Izo nkingo zose rero zifite akamaro gakomeye ko kurinda no gukumira indwara zitarinjira mu mubiri w’umuntu. Gusa mu gihe abantu babikangurirwa hariho bamwe usanga bavunira ibiti mu matwi, kubibwirwa bikaba nko kugosorera mu rucaca cyangwa gucurangira abahetsi

Ibyo ari byo byose buri mubyeyi w’Umunyarwanda agomba kwitabira guhesha abana be inkingo zose nk’uko ziteganywa na Minisiteri y’Ubuzima muri gahunda yayo yo kurwanya indwara z’ibyorezo mu bana bato. Izo nkingo ni izo kurwanya indwara zikurikira: igituntu, imbasa, kokorishi, agakwega (tetanosi), akaniga, impiswi, iseru n’izindi.

Gukingira abana bikorwa kuri gahunda. Iyo umwana akivuka ahabwa urukingo rw’igituntu n’urw’imbasa. Yamara ukwezi n’igice agahabwa urw’imbasa, kokorishi, agakwega bamwe bita tetanosi, akaniga, umwijima wo mu bwoko bwa epatite B, pinemokoke hamwe n’urw’impiswi. Ku mezi abiri n’igice akingirwa nanone imbasa, kokorishi, agakwega, akaniga, umwijima, umusonga n’impiswi. Iyo umwana yujuje amezi atatu n’igice ahabwa urukingo rw’imbasa, kokorishi, agakwega, akaniga, umwijima, umusonga n’impiswi. Yongera gukingirwa agize amezi ikenda aho ahabwa urukingo rw’iseru na rubeyore. Iyo agejeje ku mezi cumi n’atanu, ni ukuvuga umwaka n’amezi atatu ahabwa urukingo rw’iseru ari na rwo ruheruka izindi muri uru ruhererekane rwazo. Iyi gahunda y’inkingo ikwiye gufatwa nk’amata y’abashyitsi, ikitabirwa, abantu bakareba ko bakubita inshuro izi ndwara ziba zishaka kubibasira ngo zibamire bunguri. Abashinzwe kubika no gutanga inkigo na bo bagomba kubikorana ubwitonzi n’ubushishozi kugira ngo zitangwe mu buryo bwujuje ubuziranenge.

Abavumbuye izi nkingo tutibagiwe na Leta y’u Rwanda izidutegurira, ikazitwishyurira ndetse ikanazidukangurira, dukwiriye kubakurira ubwatsi. Aha kandi ntawakwibagirwa ko zose zitangirwa ubuntu binyujijwe muri gahunda za Minisiteri y’Ubuzima. Mu rwego mpuzamahanga haracyashakishwa n’izindi nkingo z’indwara z’ibyorezo nka SIDA, ebora, kanseri, diyabete n’izindi. Reka tubitege amaso kuko “Ntawuvuma iritararenga”.

Twibuke kandi ko kwirengagiza gufata inkingo byakururira umuntu akaga gakomeye kuko bishobora kumuzanira ubumuga bukomeye cyangwa se n’urupfu. Urukingo ni ingabo y’ubuzima, kandi “kwirinda biruta kwivuza.” Byateguwe hifashishijwe imfashanyigisho ya Minisiteri y’Ubuzima, Gahunda yo gukingiza umwana.

