Ikigo cy’Igihugu Gishinzwe Imikurire no Kurengera Umwana (NCDA) kiratangaza ko bumwe mu burenganzira bw’umwana harimo no kugira uruhare mu bimukorerwa.

Umuyobozi Mukuru wa NCDA Ingabire Assumpta, abigarutseho mu gihe kuri uyu wa Mbere tariki 02 Nzeri 2024 mu Karere ka Huye muri Kaminuza y’u Rwanda, ishami rya Huye mu Ntara y’Amajyepfo, hateraniye Inama Nkuru y’Igihugu y’Abana ku nshuro ya 17.

Insanganyamatsiko y’uyu mwaka igira iti: “Ejo Ni njye”.

Ingabire, Umuyobozi Mukuru wa NCDA, avuga ko ari umwanya mwiza ku bana wo kuganira hagati yabo bakagaragaza ibitekerezo byabo ndetse n’uruhare rwabo mu bibakorerwa.

Yagize ati: “Ni uburenganzira bw’umwana kugira uruhare mu bimukorerwa, ni n’inshingano za Leta, abafatanyabikorwa, ababyeyi n’umuryango mugari kubahiriza ubwo burenganzira.

Niyo mpamvu iyi nama tuyiha agaciro gakomeye kuko abana babasha kutugaragariza ibyo kwitaho kugira ngo bakure neza, banezerewe, bakunzwe, bafite ubuzima bwiza, bafite indangagaciro, biga neza bagatsinda, bakunze igihugu, badahohoterwa, nta bibazo by’imirire mibi ndetse n’uburenganzira bwabo bwose bwubahirizwa mu miryango.”

NCDA igaragaza ko iyi nama igamije guha urubuga abana bagatanga ibitekerezo kuri gahunda z’igihugu no kugira uruhare mu bibakorerwa.

Inama Nkuru y’Igihugu y’Abana yagize uruhare runini mu gusubiza ibibazo bibangamiye abana; ihohoterwa rishingiye ku gitsina, guterwa inda, gukoreshwa imirimo ivunanye n’ibindi.

Binyuze muri komite z’abana zitorwa kuva ku rwego rw’Umudugudu kugeza ku rwego rw’Akarere, abana bose mu gihugu babasha gutanga ibitekerezo, bigashyikirizwa ababahagarariye kandi bikagezwa mu igenamigambi ry’igihugu.

Yakomoje ku gushyira imbaraga mu ishyirwamubikorwa ry’imyanzuro y’iyi nama.

Ati: “Ndibutsa ababyeyi, abafatanyabikorwa n’abagize umuryango muri rusange ko tudakwiye kugarukira ku nama gusa, ahubwo igikomeye ni ugushyira mu bikorwa imyanzuro iba yavuye muri iyi nama kuko ni bwo buryo bwiza bwo gusubiza ibibazo abana batugejejeho.”

Mu nama iheruka yabereye mu kigo cy’Ubutore cya Nkumba giherereye mu Karere ka Burera, abana bahagarariye abandi batanze ibitekerezo byitaweho mu gutegura gahunda ya Guverinoma yo kwihutisha Iterambere (NST2).

Inama Nkuru y’Igihugu y’Abana yatangiye mu mwaka wa 2004. Abana bahagararira abandi batorwa binyuze mu mahuriro ya komite z’abana kuva ku rwego rw’Umudugudu kugeza ku rwego rw’Akarere, bagatorerwa manda y’imyaka 4.

Komite y’ihuriro ry’abana kuri buri rwego iba igizwe na Perezida, Visi Perezida, Umunyamabanga, Abajyanama Babiri n’uhagarariye abana bafite ubumuga


-------------++---
Urwego 
rw’akar-
ere 
Komite 
nkomatanyanze-
go yo kurwanya 
imirire mibi mu 
karere
- Umuyobozi w’Akarere 
wungirije ushinzwe imib-
ereho myiza y’abaturage: 
Umuyobozi;
- Umuyobozi ushinzwe ubuz-
ima rusange: Umunyam-
abanga
- Umukozi ushinzwe imbo-
nezamikurire y’abana bato 
mu karere
- Umuyobozi mukuru w’ibita-
ro by’akarere;
- Umukozi ushinzwe imirire 
ku bitaro;
- Umukozi ushinzwe 
gukurikirana ibikorwa 
by’abajyanama b’ubuzima 
ku bitaro;
- Ushinzwe uburinganire;
- Uhagarariye inama y’igihu-
gu y’abagore;
- Uhagarariye inama y’igihu-
gu y’urubyiruko;
- Umukozi ushinzwe 
ubuhinzi;
- Veterineri w’akarere;
- Uhagarariye ihuriro ry’aba-
fatanyabikorwa (JADF);
- Uhagarariye abanyam-
abanga nshingwabikorwa 
b’imirenge
- Uhagarariye ingabo na 
polisi y’igihugu;
- Uhagarariye sosiyete sivile
- Uhagarariye abikorera ku 
giti cyabo
- Guhuza ibikorwa bya gahunda 
y’imirire mu mudugudu ku rwego 
rw’Akarere
- Kwinjiza ibikorwa byo kurwanya 
imirire mibi mu kare mu igenami-
gambi ry’itembere ry’akarere
- Gusesengura raporo ziturutse mu 
mirenge no kugaragaza ibikorwa by-
ihutirwa kurusha ibindi mu kurwanya 
imirire mibi mu karere
- Gukora ubuvugizi no gushaka 
ubushobozi
- Gutumiza no kuyobora inama za buri 
gihembwe zihuza abahagarariye 
komite nkomatanyanzego ishinzwe 
kurwanya imirire mibi mu murenge.
- Gufasha gushyiraho uburyo bwo-
rohereza ishyirwamubikorwa rya 
gahunda y’imirire mu mudugudu ku 
rwego rw’umurenge
- Guhuza ibikorwa mbonezamirire mu 
mudugudu
- Gufasha no gutanga raporo y’imiko-
rere ya komite ishinzwe gahunda 
y’imirire mu mudugudu ku rwego 
rw’umurenge


----Komite mpuzabikora mu kurwanya imirire mibi no kwita kumiurire y'umwana ku karere iterana buri ihembwe, komite mozabikowa ishinzwe krwanya imirire mibi no kwita ku iterambere ry'umwana ku murenge, akagari , umudugudu, buri gihembwe, buri kwezi, buri kwezi--
