{
    "list of rwanda laws": ["LAW Nº 71/2024 OF 26/06/2024 GOVERNING PERSONS AND FAMILY",
"LAW N° 055/2024 OF 20/06/2024 ON THE PROTECTION OF INTELLECTUAL PROPERTY",
"LAW Nº 10/2003 OF 18/04/2003 GOVERNING THE ORGANISATION OF THE REFERENDUM ON THE CONSTITUTION",
"ITEKA  RYA PEREZIDA Nº 37/01 RYO KU WA 23/12/1998 RIGENA AMASEGITERI, AMASELIRE RIKANAGENA IMIKORERE Y’IZO NZEGO",
"LAW Nº 18/2001 OF 01/03/2001 AMENDING AND COMPLEMENTING THE LAW OF 15/ APRIL 1963 CONCERNING THE ORGANISATION AND ADMINISTRATION OF THE REPUBLIC OF RWANDA",
"LAW Nº 11/2003 OF 20/05/2003 MODIFYING AND COMPLEMENTING THE LAW NO 47/2000 OF 19 DECEMBER 2000 MODIFYING AND COMPLEMENTING THE LAW OF 15 APRIL 1963 CONCERNING THE ADMINISTRATION OF THE REPUBLIC OF RWANDA AS MODIFIED AND COMPLEMENTED TO DATE.",
"LAW Nº 45/2001 OF 08/12/2001 DETERMINING THE NATIONAL ANTHEM OF THE REPUBLIC OF RWANDA",
"AGREEMENT ESTABLISHING THE AFRICAN REINSURANCE CORPORATION (AFRICARE)",
"CONSTITUTION OF THE INTERNATIONAL TELECOMMUNICATION UNION",
"AMABWIRIZA YA KOMISIYO Y’IGIHUGU Y’AMATORA N˚ 004/24 YO KU WA 05/08/2024 AHINDURA AMABWIRIZA YA  KOMISIYO Y’IGIHUGU Y’AMATORA N˚ 003/24 YO KU WA  26/07/2024 AGENGA ITORA RY’ABASENATERI RYO MU MWAKA WA 2024",
"LAW Nº 57/2001 OF 31/12/2001 ON CHARACTERISTICS, CEREMONIAL AND RESPECT OF THE NATIONAL FLAG.",
"LAW Nº 06/99 OF 28/3/1999 MODIFYING LAW NO 35/87 OF 17 TH SEPTEMBER 1987 ON THE SEAL’S CUSTODY.",
"LAW Nº 28/2000 OF 15/10/2000 MODFYING THE LAW OF MARCH 13, 1970 RELATING TO CHANCELLERY FEES.",
"ORGANIC LAW  Nº 13/97 OF 19/9/1997 AMENDING  AND COMPLEMENTING THE ORGANIC LAW  Nº 3 BIS OF APRIL 14, 1997, RESPECTING MEANS OF INFORMATION AND REVIEW AVAILABLE  TO THE TRANSITIONAL NATIONAL ASSEMBLY WITH REGARD TO GOVERNMENT ACTION",
"LAW Nº 09/98 OF 3/8/1998 RESPECTING THE INTERNAL RULES AND PROCEDURES OF THE TRANSITIONAL NATIONAL ASSEMBLY",
"LAW Nº 8/2000 OF 19/04/2000 CONCERNING THE AUTHENTIC INTERPRETATION OF LAWS.",
"LAW Nº 47/2001 OF 18/12/2001 INSTITUTING PUNISHMENT FOR OFFENCES OF DISCRIMINATION AND SECTARIANISM.",
"LAW Nº 09/2000 OF 16/06/2000 ON THE ESTABLISHMENT, GENERAL ORGANIZATION AND JURISDICTION OF THE NATIONAL POLICE",
"LAW Nº 19/2002 OF 17/05/2002 ESTABLISHING THE RWANDA DEFENCE FORCES.",
"LAW Nº 13/2000 OF 14/06/2000 MODIFYING THE DEGREE-LAW NO 12/97 OF MAY, 1979 CONCERNING FIREARMS AND THEIR AMMUNITIONS.",
"ORGANIC LAW Nº 28/2006 OF 27/06/2006 MODIFYING AND COMPLEMENTING ORGANIC LAW Nº 16/2004 OF 19/06/2004 ESTABLISHING THE ORGANISATION, COMPETENCE AND FUNCTIONING OF GACACA COURTS CHARGED WITH PROSECUTING AND TRYING THE PERPETRATORS OF THE CRIME OF GENOCIDE AND OTHER CRIMES AGAINST HUMANITY, COMMITTED BETWEEN OCTOBER 1, 1990 AND DECEMBER 31, 1994",
"LOI ORGANIQUE NO 07/96 DU 6/6/1996 PORTANT ORGANISATION, FONCTIONNEMENT ET COMPETENCE DE LA COUR SUPREME",
"ORGANIC LAW  Nº 5/99 OF 8/01/1999 MODIFYING AND COMPLETING THE ORGANIC LAW  Nº 08/95 OF 06 DECEMBER 1995 MODIFYING THE DECREE-LAW NO 09/80 OF 07 JULY 1980 CONCERNING THE LEGAL COMPETENCE AND THE ORGANIZATION CODE AND ESTABLISHING THE MILITARY PROSECUTOR’S OFFICE.",
"ORGANIC-LAW NO 11/2000 OF 19/04/2000 MODIFYING THE ORGANIC LAW  Nº 08/95 OF DECEMBER 6, 1995 MODIFYING THE DECREE-LAW NO 09/80 OF JULY 7, 1980 CONCERNING THE MILITARY COURTS ORGANIZATION AND COMPETENCE AND ESTABLISHING THE MILITARY PROSECUTOR’S OFFICE AS AMENDED BY ORGANIC-LAW NO 5/99 OF JANUARY 8, 1999.",
"LAW Nº 12/2000 OF 24/05/2000 MODIFYING THE GOVERNMENT DECREE NO 06/82 OF 07 JANUARY 1982 ESTABLISHING LAWS GOVERNING JUDICIAL PERSONNEL",
"ORGANIC LAW  Nº 14/2000 OF 15/06/2000 MODIFYING THE DECREE LAW NO 09/80 OF JULY 1980 ESTABLISHING THE ORGANIZATION AND JURISDICTION OF COURTS AS MODIFIED TO DATE.",
"ORGANIC LAW  Nº 21/2000 OF 11/10/2000 MODIFYING THE ORGANIC LAW  Nº 07/96 OF JUNE 6, 1996 ON THE ORGANIZATION, FUNCTIONING AND COMPETENCE OF THE SUPREME COURT.",
"ORGANIC LAW  Nº 22/2000 OF 11/10/2000 MODIFYING AND COMPLEMENTING THE DECREE-LAW NO 09/80 OF JULY 7, 1980 ON THE ORGANIZATION CODE AND JUDICIAL COMPETENCE.",
"ORGANIC LAW  Nº 33/2001 OF 22/6/2001 MODIFYING AND COMPLEMENTING ORGANIC LAW  Nº 40/2000 OF JANUARY 26, 2001 SETTING UP ‘’GACACA JURISDICTIONS’’ AND ORGANISING PROSECTIONS FOR OFFENCES CONSTITUTING THE CRIME OF GENOCIDE  OR CRIMES AGAINST HUMANITY, COMMITTED BETWEEN OCTOBER 1, 1990 AND DECEMBER 31, 1994.",
"MINISTERIAL ORDER NO 027 OF 24/03/2003 TO EXTEND TIME PERIOD FOR CONFESSION AND GUILT PLEA.",
"ORGANIC LAW  Nº 02/2004 OF 20/03/2004 DETERMINING THE ORGANISATION, POWERS AND FUNTIONNING OF THE SPERIOR COUNCIL OF THE JUDICIARY",
"LAW Nº 06 Bis/2004 of 14/04/2004 ON THE STATUTES FOR JUDGES AND OTHER JUDICIAL PERSONNEL",
"ORGANIC LAW  Nº 17/2004 OF 20/6/2004 ON ORGANIZATION, POWERS AND FUNCTIONING OF THE MEDIA COMMITTE",
"ORGANIC LAW N° 02/2010/OL OF 09/06/2010 ON ORGANISATION, JURISDICTION, COMPETENCE AND FUNCTIONING OF THE MEDIATION COMMITTEE",
"ORGANIC LAW  Nº 03/2004 OF 20/03/2004 DETERMINING THE ORGANIZATION, POWERS AND FUNCTIONNING OF THE PROSECUTION SERVICE",
"ORGANIC LAW  Nº 22/2004 OF 13/08/2004 ON THE STAUTE OF PUBLIC PROSECUTORS AND PERSONNEL OF THE PUBLIC PROSECUTION SERVICE",
"ORGANIC LAW N° 12/2006 OF 21/3/2006 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 22/2004 OF 13/08/2004 ON THE STATUTE OF PUBLIC PROSECUTORS AND PERSONNEL OF THE PUBLIC PROSECUTION SERVICE",
"ORGANIC LAW N° 03/2011/OL OF 17/08/2011 DETERMINING THE ORGANISATION, POWERS AND FUNCTIONING OF THE HIGH COUNCIL OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY",
"ORGANIC LAW N° 04/2011/OL OF 03/10/2011 DETERMINING THE ORGANISATION, FUNCTIONING AND COMPETENCE OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY AND THE MILITARY PROSECUTION DEPARTMENT",
"ORGANIC LAW Nº 11/2012/OL OF 18/01/2013 MODIFYING AND COMPLEMENTING ORGANIC LAW Nº 04/2011/OL OF 03/10/2011 DETERMINING THE ORGANIZATION, FUNCTIONING AND COMPETENCE OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY AND THE MILITARY PROSECUTION DEPARTMENT",
"LAW Nº 9/96 OF 8th SEPTEMBER 1996 RELATING TO PROVISIONAL MODIFICATIONS TO THE CRIMINAL PROCEDURE CODE",
"LAW 26/99 OF 31/12/1999 MODIFYING THE LAW NO 16/97 OF 26/12/1997 MODIFYING THE LAW NO 9/96 OF SEPTEMBER 8, 1996 RELATING TO PROVISIONAL MODIFICATIONS THE CRIMINAL PROCEDURE CODE.",
"LAW Nº 11/2001 OF 8/2/2001 MODIFYING THE LAW OF JULY 15, 1964 ON CIVIL AND COMMERCIAL PROCEDURE CODE.",
"LAW Nº 35/01 OF 7/7/2001 RELATING TO PROVISIONAL MODIFICATION OF THE CRIMINAL PROCEDURE CODE FOR PERSONS BEING PROSECUTED FOR GENOCIDE OR CRIMES AGAINST HUMANITY, COMMITTED BETWEEN 1 OCTOBER 1990 AND 31 DECEMBER 1994.",
"LAW Nº 13/2001 OF 20/02/2001 MODIFYING THE LAW OF 23 FEBRUARY 1963 RELATING TO THE CRIMINAL PROCEDURE CODE.",
"LAW Nº 45/2007 OF 11/09/2007 MODIFYING AND COMPLEMENTING LAW NO 18/2004 OF 20 JUNE 2004 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE PROCEDURE",
"LAW Nº 31/2001 OF 12/06/2001 ESTABLISHING AND INSTITUTING THE ORGANIZATION OF A PROFESSIONAL BAILIFFS ASSOCIATION",
"LAW Nº 29/2000 OF 12/10/2000 MODIFYING LAW NO 11/97 OF 26 JULY 1997 REGARDING STATUTES OF NATIONAL BANK OF RWANDA.",
"LAW Nº 55/2007 OF 30/11/2007 GOVERNING THE CENTRAL  BANK OF RWANDA",
"LAW Nº 15/2001 OF 28/01/2001 AMENDING AND COMPLEMENTING LAW NO 35/91 OF 5th AUGUST 1991 CONCERNING THE ORGANIZATION OF INTERNAL TRADE.",
"ITEGEKO NO 12/99 RYO KU WA 02/07/1999 RYEREKEYE UBUHANGA MU BY’IMITI",
"LAW Nº 14/98 OF 18/12/1998 ESTABLISHING THE RWANDA INVESTMENT PROMOTION AGENCY",
"PRIME MINISTER’S ORDER N° 121/03 OF 08/09/2010 ESTABLISHING THE PROCEDURE  OF PERFORMANCE APPRAISAL AND  PROMOTION OF PUBLIC SERVANTS",
"ORDONNANCE-LOI DU 25 AOUT 1970 PORTANT REGLEMENTATION DE L’AVIATION CIVILE.",
"ORDONNANCE-LOI DU 15 FEVRIER 1970 PORTANT REGLEMENTATION DE L’AVIATION CIVILE.",
"DECLET-LOI NO 21/76 DU 23 AVRIL 1976 MODIFIANT LA LOI DU 23 JANVIER 1971 PORTANT REGLEMENTATION DE L’AVIATION CIVILE.",
"LAW Nº 24/2000 OF 11/10/2000 MODIFYING THE GOVERNMENT DECREE NO 01/81 OF JANUARY 16, 1981 RELATING TO CENSUS, IDENTIFY CARD, DOMICILE AND RESIDENCE FOR RWANDANS.",
"LAW Nº 27/2001 OF 28/04/2001 RELATING TO RIGHTS AND PROTECTION OF THE CHILD AGAINST VIOLANCE.",
"LAW Nº 12/2001 OF 24/01/2001 ESTABLISHING AND IMPOSING RESPECT OF THE GRAVEYARDS.",
"LAW Nº 18/99 OF 30/08/1999 MODIFYING LAW-DECREE NO 18/76 OF 20 APRIL 1976 SETTING UP THE PUBLIC ENTREPRISE FOR PRODUCTION, TRANSPORTATION AND DISTRIBUTION OF ELECTRICITY, WATER AND GAS (ELECTROGAZ)",
"LAW N° 043/2024 OF 06/05/2024 GOVERNING THE NATIONAL ELECTORAL COMMISSION",
"AMABWIRIZA YA MINISITIRI NO 01/96 YO KUWA 23/9/1996 YEREKEYE IMICUNGIRE Y’AGATEGANYO Y’AMASAMBU",
"LOI NO 5 DU 29/5/1996 PORTANT MODIFICATION DE LA LOI DU 28 FEVRIER 1967 PORTANT CODE DU TRAVAIL TELLE QUE MODIFIEE ET COMPLETEE A CE JOUR",
"LAW Nº 15/99 OF 15/08/1999 MODIFYING AND COMPLETING LAW NO 03/97 OF 19th  3.1997 ESTABLISHING A BAR IN RWANDA.",
"LAW Nº 20/2000 OF 26/07/2000 RELATING TO NON-PROFIT MAKING ORGANIZATIONS",
"LOI DU 9 MAI 1964 FIXANT LE MONTANT DE LA CONTRIBUTION PERSONNELLE MINIMUM DUE PAR LES CONTRIBUABLES POUR L’EXERCICE FISCAL 1964.",
"LOI NO 29/91 DU 28 JUIN 1991 RELATIVE A L’IMPOT SUR LE CHIFFRE D’AFFAIRES.",
"LOI NO 004/95 DU 20 JUIN 1995 MODIFIANT ET COMPLETANT LA LOI NO 29/91 DU 28 JUIN 1991 RELATIVE A L’IMPOT SUR LE CHIFFRE D’AFFAIRES",
"COMMISSIONER GENERAL’S RULES NO 01 OF 01/08/2001 GOVERNING VAT.",
"LAW Nº 23/2002 OF 10/07/2002 MODIFYING LAW NO 06/2001 OF 20/01/2001 ON THE CODE OF VALUE ADDED TAX.",
"LAW Nº 03/98 OF 14/02/1998 ON THE DUTY PAYABLE FOR A LICENCE TO CARRY ON A TRADE OR PROFESSION",
"LAW Nº 15/98 OF 31/12/1998 MODIFYING AND COMPLEMENTING LAW NO 8/97 OF 26 JUNE 1997 ON THE CODE OF DIRECT TAXES ON DIFFERENT PROFITS AND PROFESSIONAL INCOMES.",
"LAW Nº 16/98 OF 31/12/1998 MODIFYING AND COMPLEMENTING LAW NO 29/91 OF 28 JUNE 1991 RELATING TO THE SALES TAX",
"LAW Nº 16/2000 OF 14/07/2000 CONERNING THE AUTHENTIC INTERPRETATION OF THE THIRD ARTICLE OF LAW NO 08/97 OF 26/6/1997 ON THE CODE OF DIRECT TAXES ON DIFFERENT PROFITS AND PROFESSIONAL INCOME.",
"LAW Nº 16/2005 OF 18/08/2005 ON DIRECT TAXES INCOME",
"LAW Nº 17/98 OF 31/12/1998 MODIFYING AND COMPLETING LAW 9/79 OF 26/6/1997 ON A CODE FOR FISCAL PROCEDURES.",
"LAW Nº 09/99 OF 12/6/1999 COMPLEMENTING LAW NO 09/97 OF 26 JUNE 1997 ENACTING FISCAL PROCEDURES",
"LAW Nº 25/2005 OF 04/12/2005 ON TAX PROCEDURES",
"LAW Nº 8/89 OF 4/9/1998 GIVING AN AUTHENTIC INTERPRETATION OF ARTICLE 2 OF THE LAW 06/97 OF MAY 10, 1997 CONERNING THE CONSUMPTION TAX TO BE COLLECTED UPON LOCALLY MADE OR IMPORTED CIGARETTES.",
"LAW Nº 12/96 OF 9/12/1996 AMENDING DEGREE-LAW NO 113/01 OF 15 FEBRUARY 1995 FIXING AN ENRTY DUTY ON IMPORTED PRODUCTS, AS CONFIRMED BY LAW NO 06/95 OF 24 AUGUST 1995.",
"LAW Nº 18/98 OF 31/12/1998 MODIFYING THE CONSUMPTION TAX RATES TO BE COLLECTED UPON ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LAW Nº 04/2000 OF 19/04/2000 MODIFYING THE LAW OF JULY 17, 1968 RELATING TO CUSTOMS REGIME.",
"LAW Nº 02/2000 OF 19/04/2000 RELATING TO PUBLIC SALE BY AN AUCTION, OF GOODS SEIZED OR CONFISCATED BY CUSTOMS.",
"LAW Nº 04/2004 OF 23/03/2004 FIXING THE IMPORT DUTY ON IMPORTED CEMENT",
"LAW N° 18/2007 OF 19/04/2007  RELATING TO EXPROPRIATION IN THE PUBLIC INTEREST",
"LAW Nº 13/2004 OF 17/5/2004 RELATING TO THE CODE OF CRIMINAL PROCEDURE",
"LAW Nº 18/2004 OF 20/6/2004 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE PROCEDURE",
"THE ARTICLE 3 OF THE MINISTERIAL ORDER Nº001/07.01/2014 OF 16/01/2014 ON OTHER MATERIAL OF WHICH THE NATIONAL FLAG MAY BE MADE, PUBLISHED IN THE OFFICIAL GAZETTE Nº9 OF 03/03/2014, IS CORRECTED AS FOLLOWS:",
"DÉCLARATION DU PRÉSIDENT DE LA RÉPUBLIQUE, DU 24 JUILLET 1962: RESPECT DES ACCORDS ET TRAITES CONCLUS PAR LA BELGIQUE",
"PRIME MINISTER’S ORDER N° 42/03 OF 30/04/2014 DETERMINING THE MINISTRY IN CHARGE OF THE NATIONAL FLAG",
"PRESIDENTIAL ORDER Nº 70/01 OF 12/03/2014 DETERMINING THE LIST OF PERSONS FOR WHOM THE LARGE NATIONAL FLAG CAN BE USED TO COVER THE COFFIN CONTAINING THEIR BODY",
"LAW N° 42/2018 OF 13/08/2018 MODIFYING LAW N°34/2008 OF 08/08/2008 ON THE CHARACTERISTICS, DESCRIPTION, CEREMONIAL AND RESPECT OF THE NATIONAL FLAG AS AMENDED TO DATE",
"LAW Nº 027/2021 OF 28/05/2021 AMENDING LAW N° 22/2012 OF 15/06/2012 DETERMINING THE PUBLICATION, NOTIFICATION AND COMMENCEMENT OF OFFICIAL ACTS",
"MINISTERIAL ORDER Nº003/07.07 OF 29/04/2010 DETERMINING THE COST OF THE FLAG",
"PRIME MINISTER’S ORDER N° 41/03 OF 30/04/2014 DETERMINING THE MINISTRY IN CHARGE OF THE PROTECTION OF THE NATIONAL ANTHEM",
"MINISTERIAL ORDER Nº 003/07.01/13 OF 27/12/2013 DETERMINING OTHER CIRCUMSTANCES WHEREBY ONLY THE FIRST AND THE LAST VERSE OF THE NATIONAL ANTHEM ARE SUNG",
"MINISTERIAL ORDER Nº001/07.01/2014 OF 16/01/2014 ON OTHER MATERIAL OF WHICH THE NATIONAL FLAG MAY BE MADE",
"PRESIDENTIAL ORDER N° 52/01 OF 13/09/2013 DETERMINING THE ELECTORAL CONSTITUENCIES, THE NUMBER OF WOMEN MEMBERS OF THE CHAMBER OF DEPUTIES ELECTED BY SPECIFIC COUNCILS IN ACCORDANCE WITH THE STATE ADMINISTRATIVE ENTITIES",
"ORGANIC LAW N°04/2010/OL OF 12/08/2010 MODIFYING AND COMPLEMENTING ORGANIC LAW Nº29/2005 OF 31/12/2005 DETERMINING THE ADMINISTRATIVE ENTITIES OF THE REPUBLIC OF RWANDA",
"ORGANIC LAW N°02/2017/OL OF 20/04/2017 ESTABLISHING KISWAHILI AS AN OFFICIAL LANGUAGE",
"LAW N° 19/2008 OF 14/07/2008 ON CHARACTERISTICS AND CEREMONIES OF THE NATIONAL ANTHEM",
"LAW N°43/2018 OF 13/08/2018 MODIFYING LAW N°19/2008 OF 14/07/2008 ON CHARACTERISTICS AND CEREMONIES OF THE NATIONAL ANTHEM AS AMENDED TO DATE",
"LAW N°22/2012 OF 15/06/2012 DETERMINING THE PUBLICATION, NOTIFICATION AND COMMENCEMENT OF OFFICIAL ACTS",
"LAW N° 24/2008 OF 23/07/2008 DETERMINING THE CHARACTERISTICS, SIGNIFICANCE, USAGE AND PROTECTION OF THE SEAL OF THE REPUBLIC",
"UNIVERSAL DECLARATION OF HUMAN RIGHTS",
"MINISTERIAL ORDER Nº 004/07.01/13 OF 19/12/2013 DETERMINING THE DIMENSIONS OF THE NATIONAL FLAG",
"ORGANIC LAW Nº 001/2022.OL OF 26/08/2022 GOVERNING ELECTION OF RWANDA MEMBERS OF THE EAST AFRICAN LEGISLATIVE ASSEMBLY",
"ORGANIC LAW N° 005/2018.OL OF 30/08/2018 MODIFYING THE ORGANIC LAW N° 10/2013/OL OF 11/07/2013 GOVERNING POLITICAL ORGANISATIONS AND POLITICIANS",
"LAW N° 06/2013 OF 27/02/2013 MODIFYING AND COMPLEMENTING LAW N° 34/2008 OF 08/08/2008 ON CHARACTERISTICS, DESCRIPTION, CEREMONIAL AND RESPECT OF THE NATIONAL FLAG",
"LAW N° 34/2008 OF 08/08/2008 ON CHARACTERISTICS, DESCRIPTION, CEREMONIAL AND RESPECT OF THE NATIONAL FLAG",
"MINISTERIAL ORDER N° 006/07.01 OF 16/08/2006 DETERMINING THE BOUNDARIES OF VILLAGE",
"PRIME MINISTER’S ORDER N° 003/03 OF 16/02/2021 DETERMINING ELECTRONIC MEANS FOR PUBLICATION OF OFFICIAL ACTS",
"ORGANIC LAW N° 001/2024.OL OF 15/03/2024 DETERMINING PROCEDURES FOR PARLIAMENTARY OVERSIGHT OVER GOVERNMENT ACTIVITIES",
"ORGANIC LAW Nº 29/2005 OF 31 DECEMBER 2005  DETERMINING THE ADMINISTRATIVE ENTITIES OF THE REPUBLIC OF RWANDA",
"CHARTER OF THE UNITED NATIONS",
"CONSTITUTION OF THE REPUBLIC OF RWANDA",
"LAW N° 07/2013 OF 27/02/2013 MODIFYING AND COMPLEMENTING LAW N° 19/2008 OF 14/07/2008 ON CHARACTERISTICS AND CEREMONIES OF THE NATIONAL ANTHEM",
"LAW Nº 020/2019 OF 22/08/2019 REPEALING ALL LEGAL INSTRUMENTS BROUGHT INTO FORCE BEFORE THE DATE OF INDEPENDENCE",
"ORGANIC LAW N° 007/2018.OL OF 08/09/2018 DETERMINING THE FUNCTIONING OF THE SENATE",
"ORGANIC LAW N° 10/2013/0L OF 11/07/2013 GOVERNING POLITICAL ORGANIZATIONS AND POLITICIANS",
"ORGANIC LAW N° 006/2018.OL OF 08/09/2018  DETERMINING THE FUNCTIONING OF THE CHAMBER OF DEPUTIES",
"LAW Nº 22/2019 OF 29/07/2019 GOVERNING THE CITY OF KIGAL",
"CONSTITUTIVE ACT OF THE AFRICAN UNION",
"LAW N° 61/2018 OF 24/08/2018 MODIFYING LAW Nº 19/2013 OF 25/03/2013 DETERMINING MISSIONS, ORGANISATION AND FUNCTIONING OF THE NATIONAL COMMISSION FOR HUMAN RIGHTS",
"PRESIDENTIAL ORDER Nº 122/01 OF 28/12/2021 GOVERNING THE CANDIDATE SELECTION COMMITTEE TO THE POST OF COMMISSIONER OF THE NATIONAL COMMISSION FOR HUMAN RIGHTS",
"SUPPLEMENTARY CONVENTION ON THE ABOLITION OF SLAVERY, THE SLAVE TRADE, AND INSTITUTIONS AND PRACTICES SIMILAR TO SLAVERY",
"PROTOCOL TO THE AFRICAN CHARTER ON HUMAN AND PEOPLES’ RIGHTS ON THE ESTABLISHMENT OF AN AFRICAN COURT ON HUMAN AND PEOPLES’ RIGHTS",
"UNIVERSAL DECLARATION OF HUMAN RIGHTS",
"CONVENTION FOR THE PREVENTION AND THE PUNISHMENT OF THE GENOCIDE CRIME CONCLUDED IN PARIS ON 9th DECEMBER 1948",
"INTERNATIONAL CONVENTION ON THE ELIMINATION OF ALL FORMS OF RACIAL DISCRIMINATION",
"OPTIONAL PROTOCOL TO THE CONVENTION AGAINST TORTURE AND OTHER CRUEL, INHUMAN OR DEGRADING TREATMENT OR PUNISHMENT",
"CONVENTION AGAINST TORTURE AND OTHER CRUEL, INHUMAN OR DEGRADING TREATMENT OR PUNISHMENT",
"INTERNATIONAL COVENANT ON CIVIL AND POLITICAL RIGHTS",
"AFRICAN CHARTER ON HUMAN AND PEOPLES’ RIGHTS",
"SECOND OPTIONAL PROTOCOL TO THE INTERNATIONAL COVENANT ON CIVIL AND POLITICAL RIGHTS, AIMING AT THE ABOLITION OF THE DEATH PENALTY",
"OPTIONAL PROTOCOL TO THE INTERNATIONAL COVENANT ON ECONOMIC, SOCIAL AND CULTURAL RIGHTS",
"INTERNATIONAL COVENANT ON ECONOMIC, SOCIAL AND CULTURAL RIGHTS",
"LAW N°19/2013 OF 25/03/2013 DETERMINING MISSIONS, ORGANISATION AND FUNCTIONING OF THE NATIONAL COMMISSION FOR HUMAN RIGHTS",
"CONVENTION ON THE NON- APPLICABILITY OF STATUTORY LIMITATIONS TO WAR CRIMES AND CRIMES AGAINST HUMANITY",
"INTERNATIONAL CONVENTION ON THE SUPPRESSION AND PUNISHMENT OF THE CRIME OF APARTHEID",
"ADDITIONAL PROTOCOL TO THE OAU GENERAL CONVENTION ON PRIVILEGES AND IMMUNITIES",
"EAST AFRICAN COMMUNITY PROTOCOL ON FOREIGN POLICY COORDINATION",
"GENERAL CONVENTION ON THE PRIVILEGES AND IMMUNITIES OF THE ORGANIZATION OF AFRICAN UNITY",
"CONVENTION ON DIPLOMATIC PRIVILEGES AND IMMUNITIES OF THE ECONOMIC COMMUNITY OF CENTRAL AFRICAN STATES",
"PROTOCOL ON PRIVILEGES AND IMMUNITIES OF THE EAST AFRICAN COMMUNITY",
"AGREEMENT ON THE PRIVILEGES AND IMMUNITIES OF THE INTERNATIONAL ATOMIC ENERGY AGENCY",
"CONVENTION ON THE PRIVILEGES AND IMMUNITIES OF THE SPECIALIZED AGENCIES",
"CONVENTION ON THE PRIVILEGES AND IMMUNITIES OF THE UNITED NATIONS",
"VIENNA CONVENTION ON CONSULAR RELATIONS (1963)",
"VIENNA CONVENTION ON DIPLOMATIC RELATIONS (1961)",
"VIENNA CONVENTION ON THE LAW OF TREATIES",
"CONVENTION ON THE PRIVILEGES AND IMMUNITIES OF THE ECONOMIC COMMUNITY OF THE GREAT LAKES COUNTRIES AND ITS SPECIALIZED AGENCIES",
"VIENNA CONVENTION ON THE REPRESENTATION OF STATES IN THEIR RELATIONS WITH INTERNATIONAL ORGANIZATIONS OF A UNIVERSAL CHARACTER 1975",
"CONVENTION ON SPECIAL MISSIONS",
"LOI NO.33/91 DU 05 AOUT 1991 RELATIVE AUX MANIFESTATIONS SUR LA VOIE PUBLIQUE ET RÉUNIONS PUBLIQUES",
"MINISTERIAL ORDER N° 1/CAB.M/04 OF 28/05/2004 CREATING A PROHIBITED AREA OVER KIGALI CITY",
"MINISTERIAL ORDER NO 066 OF 13/09/2002 DETERMINING ELIGIBILITY CRITERIA FOR DEMOBILIZATION OF MEMBERS OF EX ARMED GROUPS",
"LOI NO 34/1987 DU 17/09/1987 RELATIVE À LA POLICE DE ROULAGE ET DE LA CIRCULATION ROUTIÈRE",
"PRESIDENTIAL ORDER N° 40/01 OF 16/10/2005 MODIFYING AND COMPLEMENTING PRESIDENTIAL DECREE N° 85/01 OF 02  SEPTEMBER 2002 REGULATING GENERAL TRAFFIC POLICE AND ROAD TRAFFIC",
"MINISTERIAL ORDER NO 068/02/10/FIN OF 06/12/2002 FOR THE IMPLEMENTATION OF PRESIDENTIAL ORDER NO 85/01 OF 02/09/2002 PROVIDING GENERAL ROAD SECURITY AND ROAD TRAFFIC REGULATIONS",
"LAW N°02/2007 OF 20/01/2007 RELATING TO  THE PROTECTION OF DISABLED FORMER  WAR COMBATANTS",
"PRESIDENTIAL ORDER N° 72/01 OF 30/10/2003   MODIFYING AND COMPLETING PRESIDENTIAL DECREE N° 85/01 OF 02  SEPTEMBER 2002 REGULATING GENERAL TRAFFIC POLICE AND ROAD TRAFFIC",
"MINISTERIAL ORDER N°04/MOS/TRANS/015 OF 08/04/2015 DETERMINING THE MODEL OF THE NATIONAL DRIVING LICENSE",
"MINISTERIAL ORDER N° 05/MOS/Trans/018 OF 06/12/2018 AMENDING MINISTERIAL ORDER N°04/MOS/TRANS/015 OF 08/04/2015 DETERMINING THE MODEL OF THE NATIONAL DRIVING LICENSE",
"LAW N°40/2015 OF 29/08/2015 MODIFYING AND COMPLEMENTING LAW N° 10/2011 OF 13/05/2011 DETERMINING MISSIONS, ORGANISATION AND POWERS OF THE RWANDA DEFENCE FORCES",
"MINISTERIAL ORDER Nº 005/10 OF 27/05/2010 REGULATING THE PROFESSIONAL PRACTICE BONUS FOR THE POLICE",
"MINISTERIAL ORDER N° 001/MoH/2020 OF 10/09/2020 RELATING TO THE MEMBERS OF MEDICAL COMMITTEE IN CHARGE OF DETERMINING THE PERMANENT DISABILITY RATES AND CATEGORISATION OF DISABLED WAR COMBATANTS",
"PRESIDENTIAL ORDER N°29/01 OF 09/07/2012 DETERMINING POLICE REGIONS AND DISTRICTS OF RWANDA NATIONAL POLICE",
"PRESIDENTIAL ORDER N°61/01 OF 02/11/2012 DETERMINING FEES FOR SERVICES RELATING TO ARMS",
"LAW N° 10/2017 OF 20/03/2017 MODIFYING AND COMPLEMENTING LAW N° 73/2013 OF 11/9/2013 DETERMINING THE POWERS, MISSION, ORGANISATION AND FUNCTIONING OF THE NATIONAL INTELLIGENCE AND SECURITY SERVICE",
"LAW N°50/2015 OF 14/12/2015 ESTABLISHING RWANDA DEMOBILIZATION AND REINTEGRATION COMMISSION (RDRC) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW Nº38/2015 OF 30/07/2015 ON DOWNSIZING, DISCHARGE, DEMOBILIZATION AND DISMISSAL IN RWANDA DEFENCE FORCES",
"PRESIDENTIAL ORDER Nº 101/01 OF 02/06/2018 ESTABLISHING NYAMAGABE REHABILITATION CENTER",
"PRESIDENTIAL ORDER N° 99/01 OF 02/06/2018 ESTABLISHING IWAWA REHABILITATION CENTER",
"PRIME MINISTER'S ORDER N° 90/03 OF 11/09/2014 DETERMINING MODALITIES FOR THE ENFORCEMENT OF THE LAW REGULATING INTERCEPTION OF COMMUNICATION",
"REGULATIONS Nº 002/FIC/2022 OF 03/10/2022 OF THE FINANCIAL INTELLIGENCE CENTRE DETERMINING FAULTS AND SANCTIONS",
"LAW N° 26/2013 OF 10/05/2013 ESTABLISHING THE DISTRICT ADMINISTRATION SECURITY SUPPORT ORGAN (DASSO) AND DETERMINING ITS RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING",
"MINISTERIAL ORDER n° 006/08/10/MIN OF 14/11/2007 DETERMINING THE SUBSISTENCE ALLOWANCE ENTITLED TO NEEDY DISABLED FORMER WAR COMBATANT",
"MINISTERIAL ORDER Nº01/Minadef/2012 OF 10/09/2012 ESTABLISHING THE DISCIPLINARY CODE IN THE RWANDA DEFENCE FORCES AND DETERMINING THE ORGANIZATION, FUNCTIONING AND POWERS OF THE DISCIPLINARY COMMITTEES",
"CONVENTION ON THE PROHIBITION OF THE DEVELOPMENT, PRODUCTION AND STOCKPILING OF BACTERIOLOGICAL (BIOLOGICAL) AND TOXIN WEAPONS AND ON THEIR DESTRUCTION",
"MINISTERIAL ORDER N°05/MOS/TRANS/015 OF 08/04/2015 DETERMINING THE VALIDITY, AND REQUIREMENTS FOR RENEWAL OF THE NATIONAL DRIVING LICENSE",
"PRESIDENTIAL ORDER N° 037/01 OF 15/06/2023 DETERMINING THE MONTHLY SUBSISTENCE ALLOWANCE FOR A NEEDY DISABLED EX-COMBATANT",
"PRESIDENTIAL DECREE N° 85/01 OF 02/09/2002 REGULATING TO GENERAL TRAFFIC POLICE AND ROAD TRAFFIC",
"TREATY ON THE PROHIBITION OF THE EMPLACEMENT OF NUCLEAR WEAPONS AND OTHER WEAPONS OF MASS DESTRUCTION ON THE SEA-BED AND THE OCEAN FLOOR AND IN THE SUBSOIL THEREOF (SEABED TREATY)",
"LAW N° 045/2021 OF 18/08/2021 GOVERNING THE FINANCIAL INTELLIGENCE CENTRE",
"PRESIDENTIAL ORDER N° 100/01 OF 02/06/2018 ESTABLISHING GITAGATA REHABILITATION CENTER",
"PRESIDENTIAL ORDER N° 25/01 OF 25/02/2015 MODIFYING AND COMPLEMENTING PRESIDENTIAL DECREE N°85/01 OF 02/09/2002 REGULATING GENERAL TRAFFIC POLICE AND ROAD TRAFFIC AS MODIFIED AND COMPLEMENTED TO DATE",
"TREATY BANNING NUCLEAR WEAPON TESTS IN THE ATMOSPHERE, OUTER SPACE AND UNDER WATER",
"MINISTERIAL ORDER N° 01/12/Mininter OF 13/12/2012 DETERMINING BADGES OF RWANDA NATIONAL POLICE RELATING TO THE FLAG, RANKS AND LOGO",
"LAW N°11/2017 OF 06/04/2017 ESTABLISHING RWANDA LAW ENFORCEMENT SPECIALIZED ACADEMY AND DETERMINING ITS MISSION, POWERS, ORGANISATION AND FUNCTIONING",
"LAW N°10/2011 OF 13/05/2011 DETERMINING MISSIONS, ORGANISATION AND POWERS OF THE RWANDA DEFENCE FORCES",
"MINISTERIAL ORDER Nº001/07.01 OF 19/04/2018 DETERMINING MISSION, ORGANIZATION AND FUNCTIONING OF TRANSIT CENTERS",
"PRESIDENTIAL ORDER Nº 33/01 OF 03/09/2012 DETERMINING THE ORGANISATION AND RESPONSIBILITIES OF EACH OF THE MILITARY SERVICES OF RWANDA DEFENCE FORCES",
"LAW N° 73/2013 OF 11/9/2013 DETERMINING THE POWERS, MISSION, ORGANISATION AND FUNCTIONING OF THE NATIONAL INTELLIGENCE AND SECURITY SERVICE",
"LAW N°56/2018 OF 13/8/2018 RELATING TO ARMS",
"AGREEMENT ON THE ESTABLISHMENT OF THE EASTERN AFRICA STANDBY FORCE",
"REGULATIONS N° 001/FIC/2021 OF 26/08/2021 ON TARGETED FINANCIAL SANCTIONS RELATED TO TERRORISM, TERRORIST FINANCING, AND PROLIFERATION OF WEAPONS OF MASS DESTRUCTION AND ITS FINANCING",
"AMENDMENT TO THE CONVENTION ON THE PHYSICAL PROTECTION OF NUCLEAR MATERIAL",
"THE NAIROBI PROTOCOL FOR THE PREVENTION, CONTROL AND REDUCTION OF SMALL ARMS AND LIGHT WEAPONS IN THE GREAT LAKES REGION AND THE HORN OF AFRICA",
"CONVENTION ON THE PROHIBITION OF THE USE, STOCKPILING, PRODUCTION AND TRANSFER OF ANTI- PERSONNEL MINES AND ON THEIR DESTRUCTION",
"CONVENTION ON CLUSTER MUNITIONS",
"MUTUAL DEFENSE PACT",
"TREATY ON THE NON-PROLIFERATION OF NUCLEAR WEAPONS",
"PACT ON SECURITY, STABILITY AND DEVELOPMENT IN THE GREAT LAKES REGION",
"LAW N° 026/2023 OF 17/05/2023 GOVERNING RWANDA NATIONAL POLICE",
"LAW N° 16Bis/2020 OF 07/09/2020 GOVERNING PRIVATE SECURITY SERVICES",
"EAST AFRICAN COMMUNITY PROTOCOL ON CO-OPERATION IN DEFENSE AFFAIRS",
"AFRICAN NUCLEAR WEAPON-FREE ZONE TREATY (PALINDABA TREATY)",
"CONVENTION ON THE PROHIBITION OF THE DEVELOPMENT, PRODUCTION, STOCKPILING AND USE OF CHEMICAL WEAPONS AND ON THEIR DESTRUCTION",
"PROTOCOL AGAINST THE ILLICIT MANUFACTURING OF AND TRAFFICKING IN FIREARMS, THEIR PARTS AND COMPONENTS AND AMMUNITION, SUPPLEMENTING THE UNITED NATIONS CONVENTION AGAINST TRANSNATIONAL ORGANIZED CRIME",
"VIENNA CONVENTION ON CIVIL LIABILITY FOR NUCLEAR DAMAGE",
"STATUTE OF INTERNATIONAL ATOMIC ENERGY AGENCY",
"PRESIDENTIAL ORDER Nº34/01 OF 03/09/2012 DETERMINING THE RESPONSIBILITIES, COMPOSITION AND FUNCTIONING OF THE DECISION MAKING COUNCILS OF THE RWANDA DEFENCE FORCES",
"PROTOCOL RELATING TO THE ESTABLISHMENT OF THE PEACE AND SECURITY COUNCIL OF THE AFRICAN UNION",
"CONVENTION ON THE PHYSICAL PROTECTION OF NUCLEAR MATERIAL",
"AFRICAN UNION ON NON-AGGRESSION AND COMMON DEFENCE PACT",
"COMPREHENSIVE NUCLEAR TEST BAN TREATY",
"LAW Nº 013 BIS /2019 OF 30/06/2019 MODIFYING LAW No 11/2017 OF 06/04/2017 ESTABLISHING RWANDA LAW ENFORCEMENT SPECIALISED ACADEMY AND DETERMINING ITS MISSION, POWERS, ORGANIZATION AND FUNCTIONING",
"PROTOCOL FOR THE PROHIBITION OF THE USE IN WAR OF ASPHYXIATING, POISONOUS, OR OTHER GASES, AND OF BACTERIOLOGICAL METHODS OF WARFARE",
"PRIME MINISTER’S ORDER N° 019/03 OF 29/08/2021 DETERMINING THE ORGAN RESPONSIBLE FOR PROVIDING NECESSARY MEANS FOR REPATRIATION OF THE VICTIM OF CRIME OF TRAFFICKING IN PERSONS",
"ORGANIC LAW Nº05/2009/OL OF 21/12/2009 MODIFYING AND COMPLEMENTING ORGANIC LAW Nº 31/2007 OF 25/07/2007 RELATING TO THE ABOLITION OF THE DEATH PENALTY",
"MINISTERIAL ORDER N°002/MoH/2019 OF 08/04/2019 DETERMINING CONDITIONS TO BE SATISFIED FOR A MEDICAL DOCTOR TO PERFORM AN ABORTION",
"MINISTERIAL ORDER N°005/08.11 OF 11/02/2014 DETERMINING THE MODALITIES FOR THE EXECUTION OF THE PENALTY OF BAN ON ENTRY INTO A PLACE OR RESTRICTION OF MOVEMENT",
"LAW Nº 26/2017 OF 31/05/2017 ESTABLISHING THE NATIONAL CYBER SECURITY AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"AGREEMENT BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE GOVERNMENT OF THE UNITED STATES OF AMERICA REGARDING THE SURRENDER OF PERSONS TO INTERNATIONAL TRIBUNALS",
"MINISTERIAL ORDER N° 013/MOJ/AG/21 OF 29/08/2021 PROVIDING FOR OTHER PARTICULAR MEANS FOR SUPPORTING THE VICTIM OF CRIME OF TRAFFICKING IN PERSONS",
"ORGANIC LAW N° 31/2007 OF  25/07/2007 RELATING TO THE  ABOLITION OF THE DEATH PENALTY",
"LAW N°59/2008 OF 10/09/2008 ON  PREVENTION AND PUNISHMENT OF  GENDER- BASED VIOLENCE",
"LAW N° 54/2018 OF 13/08/2018 ON FIGHTING AGAINST CORRUPTION",
"PRIME MINISTER'S ORDER N°001/03 OF 11/01/2012 DETERMINING MODALITIES IN WHICH GOVERNMENT INSTITUTIONS PREVENT AND RESPOND TO GENDER- BASED VIOLENCE",
"PRACTICE DIRECTIONS OF THE PRESIDENT OF THE SUPREME COURT N° 002 / 2023 OF 05 / 09 /2023 GOVERNING THE P LEA-BARGAINING PROCEDURE",
"OPTIONAL PROTOCOL TO THE CONVENTION ON THE RIGHTS OF THE CHILD ON THE INVOLVEMENT OF CHILDREN IN ARMED CONFLICT",
"CONVENTION OF AFRICAN UNION ORGANIZATION FOR THE ELIMINATION OF MERCENARISM IN AFRICA",
"AMENDED AGREEMENT BETWEEN THE SPECIAL COURT FOR SIERRA LEONE AND THE GOVERNMENT OF THE REPUBLIC OF RWANDA ON THE ENFORCEMENT OF SENTENCES OF THE SPECIAL COURT FOR SIERRA LEONE",
"LAW Nº 59/2018 OF 22/8/2018 ON THE CRIME OF GENOCIDE IDEOLOGY AND RELATED CRIMES",
"PRESIDENTIAL ORDER N° 022/01 OF 31/03/2023 DETERMINING MODALITIES FOR THE EXECUTION OF THE PENALTY OF COMMUNITY SERVICE",
"PRESIDENTIAL ORDER N° 100/01 OF 26/08/2021 GOVERNING THE COORDINATION COUNCIL RESPONSIBLE FOR PREVENTING AND FIGHTING MONEY LAUNDERING, FINANCING OF TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION",
"PROTOCOL FOR THE SUPPRESSION OF UNLAWFUL ACTS OF VIOLENCE AT AIRPORTS SERVING INTERNATIONAL CIVIL AVIATION, SUPPLEMENTARY TO THE CONVENTION FOR THE SUPPRESSION OF UNLAWFUL ACTS AGAINST THE SAFETY OF CIVIL AVIATION, SIGNED AT MONTREAL ON 24 FEBRUARY 1988",
"TREATY ON EXTRADITION BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE GOVERNMENT OF THE REPUBLIC OF MALAWI",
"LAW N° 039/2021 OF 28/07/2021 AMENDING LAW Nº 46/2018 OF 13/08/2018 ON COUNTER- TERRORISM",
"TREATY ON EXTRADITION BETWEEN THE REPUBLIC OF UGANDA AND THE REPUBLIC OF RWANDA",
"TREATY BETWEEN THE REPUBLIC OF RWANDA AND THE UNITED REPUBLIC OF TANZANIA FOR THE EXTRADITION OF FUGITIVE CRIMINALS",
"OPTIONAL PROTOCOL TO THE CONVENTION ON THE RIGHTS OF THE CHILD ON THE SALE OF CHILDREN, CHILD PROSTITUTION AND CHILD PORNOGRAPHY",
"MINISTERIAL ORDER N° 001/MINICOM/2023 OF 31/03/2023 RELATING TO REGULATIONS DETERMINING ADMINISTRATIVE SANCTIONS APPLICABLE TO GAMING OPERATOR",
"PRIME MINISTER’S ORDER No 018/03 OF 26/08/2021 GOVERNING THE NATIONAL COUNTER-TERRORISM COMMITTEE",
"AGREEMENT BETWEEN THE REPUBLIC OF RWANDA AND THE KINGDOM OF MOROCCO ON EXTRADITION",
"AGREEMENT ON EXTRADITION BETWEEN THE REPUBLIC OF RWANDA AND THE REPUBLIC OF MOZAMBIQUE",
"LAW Nº 059/2023 OF 04/12/2023 AMENDING LAW Nº 68/2018 OF 30/08/2018 DETERMINING OFFENCES AND PENALTIES IN GENERAL",
"AGREEMENT BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE UNITED NATIONS ON THE ENFORCEMENT OF SENTENCES OF THE INTERNATIONAL CRIMINAL TRIBUNAL FOR RWANDA",
"CONVENTION FOR THE SUPPRESSION OF THE TRAFFIC IN PERSONS AND OF THE EXPLOITATION OF THE PROSTITUTION OF OTHERS",
"AGREEMENT BETWEEN THE SPECIAL COURT FOR SIERRA LEONE AND THE GOVERNMENT OF THE REPUBLIC OF RWANDA ON THE ENFORCEMENT OF SENTENCES OF THE SPECIAL COURT FOR SIERRA LEONE",
"COMMISSIONER GENERAL REGULATIONS N° 002/2023 OF 27/01/2023 DETERMINING ADMINISTRATIVE SANCTIONS APPLICABLE TO REPORTING PERSON WHO DOES NOT FULFIL HIS, HER OR ITS OBLIGATIONS",
"PROTOCOL FOR THE SUPPRESSION OF UNLAWFUL ACTS AGAINST THE SAFETY OF FIXED PLATFORMS LOCATED ON THE CONTINENTAL SHELF",
"LAW Nº 60/2018 OF 22/8/2018 ON PREVENTION AND PUNISHMENT OF CYBER CRIMES",
"EXTRADITION TREATY AND TRANSFER OF CONVICTED OFFENDERS BETWEEN THE REPUBLIC OF RWANDA AND THE REPUBLIC OF CONGO",
"LAW N° 69/2013 OF 02/09/2013 ON EXTRADITION",
"EXTRADITION TREATY BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE FEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA",
"LAW Nº 46/2018 OF 13/08/2018 ON COUNTER TERRORISM",
"CONVENTION FOR THE SUPPRESSION OF UNLAWFUL SEIZURE OF AIRCRAFT",
"EXTRADITION TREATY BETWEEN THE GOVERNMENT OF THE REPUBLIC OF KENYA AND THE GOVERNMENT OF THE REPUBLIC OF RWANDA",
"INTERNATIONAL CONVENTION AGAINST THE TAKING OF HOSTAGES",
"MEMORANDUM OF UNDERSTANDING AMONG MEMBER GOVERNMENTS OF THE EASTERN AND SOUTHERN AFRICA ANTI- MONEY LAUNDERING GROUP (ESAAMLG)",
"AGREEMENT AMONG THE COUNTRIES OF THE EASTERN AFRICA REGION IN THE FIELD OF COMBATING TERRORISM",
"CONVENTION ON THE PREVENTION AND PUNISHMENT OF CRIMES AGAINST INTERNATIONALLY PROTECTED PERSONS, INCLUDING DIPLOMATIC AGENTS",
"PROTOCOL ADDITIONAL TO THE GENEVA CONVENTIONS OF 12 AUGUST 1949, AND RELATING TO THE PROTECTION OF VICTIMS OF NON-INTERNATIONAL ARMED CONFLICTS (PROTOCOL II), OF 8 JUNE 1977",
"CONVENTION FOR THE SUPPRESSION OF UNLAWFUL ACTS AGAINST THE SAFETY OF CIVIL AVIATION",
"REGULATION No 72/2023 OF 19/06/2023 DETERMINING ADMINISTRATIVE SANCTIONS APPLICABLE TO REGULATED INSTITUTINON-COMPLIANCE WITH THE PREVENTION OF MONEY LAUNDERING, FINANCING TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION REQUIREMENTS",
"AGREEMENT ON MUTUAL LEGAL ASSISTANCE IN CRIMINAL MATTERS BETWEEN THE REPUBLIC OF RWANDA AND THE REPUBLIC OF MOZAMBIQUE",
"REGULATIONS N° 001/CMA/2023 OF 29/03/2023 DETERMINING ADMINISTRATIVE SANCTIONS APPLICABLE TO FINANCIAL INSTITUTION FOR NON-COMPLIANCE WITH THE PREVENTION OF MONEY LAUNDERING, FINANCING TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION REQUIREMENTS",
"CONVENTION ON THE MARKING OF PLASTIC EXPLOSIVES FOR THE PURPOSE OF DETECTION",
"EXTRADITION TREATY BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE GOVERNMENT OF THE REPUBLIC OF ZAMBIA",
"AGREEMENT BETWEEN THE REPUBLIC OF RWANDA AND THE KINGDOM OF MOROCCO ON MUTUAL JUDICIAL ASSISTANCE IN CRIMINAL MATTERS",
"REGULATION No 02/2018 OF 24/01/2018 ON CYBERSECURITY",
"PROTOCOL TO PREVENT, SUPPRESS AND PUNISH TRAFFICKING IN PERSONS, ESPECIALLY WOMEN AND CHILDREN, SUPPLEMENTING THE UNITED NATIONS CONVENTION AGAINST TRANSNATIONAL ORGANIZED CRIME",
"GENEVA CONVENTION (II) FOR THE AMELIORATION OF THE CONDITION OF WOUNDED, SICK AND SHIPWRECKED MEMBERS OF ARMED FORCES AT SEA, GENEVA, 12 AUGUST 1949",
"INTERNATIONAL CONVENTION FOR THE SUPPRESSION OF TERRORIST BOMBING",
"CONVENTION FOR THE SUPPRESSION OF UNLAWFUL ACTS AGAINST THE SAFETY OF MARITIME NAVIGATION",
"ORGANIZATION OF AFRICAN UNION CONVENTION ON THE PREVENTION AND COMBATING OF TERRORISM",
"INTERNATIONAL CONVENTION FOR THE SUPPRESSION OF THE FINANCING OF TERRORISM",
"PROTOCOL SUPPLEMENTARY TO THE CONVENTION FOR THE SUPPRESSION OF UNLAWFUL SEIZURE OF AIRCRAFT",
"LAW Nº 51/2018 OF 13/08/2018 RELATING TO THE PREVENTION, SUPPRESSION AND PUNISHMENT OF TRAFFICKING IN PERSONS AND EXPLOITATION OF OTHERS",
"CONVENTION FOR THE PROTECTION OF CULTURAL PROPERTY IN THE EVENT OF ARMED CONFLICT WITH REGULATIONS FOR THE EXECUTION OF THE CONVENTION 1954",
"PROTOCOL ADDITIONAL TO THE GENEVA CONVENTIONS OF 12 AUGUST 1949, AND RELATING TO THE PROTECTION OF VICTIMS OF INTERNATIONAL ARMED CONFLICTS (PROTOCOL I), OF 8 JUNE 1977",
"AFRICAN UNION CONVENTION ON PREVENTING AND COMBATING CORRUPTION",
"GENEVA CONVENTION RELATIVE TO THE PROTECTION OF CIVILIAN PERSONS IN TIME OF WAR",
"SINGLE CONVENTION ON NARCOTIC DRUGS, 1961, AS AMENDED BY THE 1972 PROTOCOL AMENDING THE SINGLE CONVENTION ON NARCOTIC DRUGS, 1961",
"UNITED NATIONS CONVENTION AGAINST CORRUPTION",
"UNITED NATIONS CONVENTION AGAINST ILLICIT TRAFFIC IN NARCOTIC DRUGS AND PSYCHOTROPIC SUBSTANCES",
"LAW Nº 69/2019 OF 08/11/2019 AMENDING LAW Nº 68/2018 OF 30/08/2018 DETERMINING OFFENCES AND PENALTIES IN GENERAL",
"LAW Nº 058/2021 OF 13/10/2021 RELATING TO THE PROTECTION OF PERSONAL DATA AND PRIVACY",
"CONVENTION ON PSYCHOTROPIC SUBSTANCES",
"GUIDELINES N° 001/CMA_G/2023 OF 29/03/2023 ON PREVENTION OF MONEY LAUNDERING AND TERRORISM FINANCING IN CAPITAL MARKETS",
"LAW Nº68/2018 OF 30/08/2018 DETERMINING OFFENCES AND PENALTIES IN GENERAL",
"GENEVA CONVENTION FOR THE AMELIORATION OF THE CONDITION OF THE WOUNDED AND SICK IN ARMED FORCES IN THE FIELD OF 12 AUGUST 1949",
"LAW Nº44bis/2017 OF 06/09/2017 RELATING TO THE PROTECTION OF WHISTLE BLOWERS",
"LAW Nº 028/2023 OF 19/05/2023 ON THE PREVENTION AND PUNISHMENT OF MONEY LAUNDERING, TERRORIST FINANCING AND THE FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION",
"GENEVA CONVENTION RELATIVE TO THE TREATMENT OF PRISONERS OF WAR",
"MINISTERIAL ORDER N° 06/MOJ/AG/20 OF N° 12/05/2020 DETERMINING THE CONTENT OF THE ENFORCEMENT FORMULA",
"PRIME MINISTER’S ORDER N°060/03 OF 30/04/2017 ON PROCEDURES FOR THE TRANSFER OF JUDICIAL POLICE OFFICERS OF RWANDA NATIONAL POLICE",
"MINISTERIAL ORDER N°003/MOJ/ACT.2015 OF 02/11/2015 DETERMINING THE FORMAT OF THE BADGE OF BAILIFFS",
"MINISTERIAL ORDER N° 17/MOJ/AG/20 OF 30/10/2020 DETERMINING COURT FEES IN CIVIL, COMMERCIAL, LABOUR, ADMINISTRATIVE AND CRIMINAL MATTERS",
"LAW Nº 15/2004 OF 12/06/2004 RELATING TO EVIDENCE AND ITS PRODUCTION",
"PRESIDENTIAL ORDER N° 065/01 OF 16/10/2023 DETERMINING RWANDA CORRECTIONAL SERVICE CLASSIFIED EQUIPMENT",
"LAW Nº 020/2020 OF 19/11/2020 AMENDING LAW N° 37/2016 OF 08/09/2016 DETERMINING ORGANISATION, JURISDICTION, COMPETENCE AND FUNCTIONING OF AN ABUNZI COMMITTEE",
"LAW N° 09/2004 OF 29/04/2004 RELATING TO THE CODE OF ETHICS FOR THE JUDICIARY",
"MINISTERIAL ORDER N°01/Mininter/14 OF 28/05/2014 DETERMINING JUDICIAL POLICE CUSTODY FACILITIES",
"PRESIDENTIAL ORDER No 091/01 OF 21/09/2020 INCREASING THE NUMBER OF MEMBERS OF THE HIGH COUNCIL OF RWANDA INVESTIGATION BUREAU",
"ORGANIC LAW Nº 002/2018.OL OF 04/04/2018 ESTABLISHING THE COURT OF APPEAL",
"LAW Nº007/2023 OF 22/01/2024 AMENDING LAW No 22/2018 OF 29/04/2018 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE PROCEDURE",
"MINISTERIAL ORDER Nº 023/MOJ/AG/2017 OF 23/10/2017 DETERMINING THE SCALE OF FEES FOR PROFESSIONAL BAILIFFS",
"PROTOCOL TO OPERATIONALISE THE EXTENDED JURISDICTION OF THE EAST AFRICAN COURT OF JUSTICE",
"LAW Nº 040/2021 OF 28/07/2021 AMENDING LAW Nº 005/2021 OF 05/02/2021 GOVERNING MUTUAL LEGAL ASSISTANCE IN CRIMINAL MATTERS",
"LAW N° 025/2021 OF 12/05/2021 AMENDING LAW No 22/2018 OF 29/04/2018 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE PROCEDURE",
"LAW Nº12/2017 OF 07/04/2017 ESTABLISHING THE RWANDA INVESTIGATION BUREAU AND DETERMINING ITS MISSION, POWERS, ORGANISATION AND FUNCTIONING",
"PRESIDENTIAL ORDER Nº 049/01 OF 02/08/2023 ESTALSHING RWANDA FORENSIC INSTITUTE",
"LAW N° 013/2018 OF 04/04/2018 DETERMINING THE ORGANISATION, POWERS AND FUNCTIONING OF THE HIGH COUNCIL OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY",
"INSTRUCTIONS N° 001/2019 OF 05/12/2019 OF THE PRESIDENT OF THE  SUPREME COURT GOVERNING  COURT MEDIATION IN CIVIL,  COMMERCIAL, LABOUR AND  ADMINISTRATIVE CASES",
"MINISTERIAL INSTRUCTIONS N° 002/INSTR/MOJ/AG/20 OF 30/09/2020 RELATING TO SERVICES PROVIDED BY A PERSON AUTHORISED TO ASSIST THE PUBLIC IN THE USE OF INTEGRATED ELECTRONIC CASE MANAGEMENT SYSTEM",
"PROTOCOL TO THE AFRICAN CHARTER ON HUMAN AND PEOPLES’ RIGHTS ON THE ESTABLISHMENT OF AN AFRICAN COURT ON HUMAN AND PEOPLES’ RIGHTS",
"MINISTERIAL ORDER No 005/MOJ/AG/21 OF 07/06/2021 RELATING TO EXECUTION OF ENFORCEMENT ORDERS",
"INSTRUCTIONS OF THE PRESIDENT OF THE SUPREME COURT Nº 001/2023 OF 25/01/2023 ON EXPERTS APPOINTED BY COURTS",
"LAW No37/2016 OF 08/09/2016 DETERMINING ORGANISATION, JURISDICTION, COMPETENCE AND FUNCTIONING OF AN ABUNZI COMMITTEE",
"AMABWIRIZA N° 01/2022 YO KU WA 01/09/2022 YA KOMISIYOY’IGIHUGU Y’AMATORA AGENA IMIGENDEKERE Y’AMATORA Y’ABAGIZE KOMITE Y’ABUNZI",
"MINISTERIAL INSTRUCTIONS N°004/MOJ/ACT.2015 OF 02/11/2015 DETERMINING THE CODE OF CONDUCT OF PROFESSIONAL BAILIFFS",
"LAW N° 47/2013 OF 16/06/2013 RELATING TRANSFER OF CASES TO THE REPUBLIC OF RWANDA",
"LAW Nº 058/2023 OF 04/12/2023 AMENDING LAW Nº 027/2019 OF 19/09/2019 RELATING TO THE CRIMINAL PROCEDURE",
"PRESIDENTIAL ORDER N° 95/01 OF 18/09/2019 SPECIFYING MODALITIES FOR ELECTING ABUNZI COMMITTEE MEMBERS",
"LAW N°12/2016 OF 02/05/2016 MODIFYING AND COMPLEMENTING LAW N° 44 BIS/2011 OF 26/11/2011 GOVERNING THE STATUTE OF PROSECUTORS AND OTHER STAFF OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY",
"LAW N° 42/2014 OF 27/01/2015 GOVERNING RECOVERY OF OFFENCE-RELATED ASSETS",
"LAW N° 021/2022 OF 29/09/2022 GOVERNING RWANDA CORRECTIONAL SERVICE",
"LAW Nº014/2018 OF 04/04/2018 DETERMINING THE ORGANIZATION, FUNCTIONING AND COMPETENCE OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY AND OF THE MILITARY PROSECUTION DEPARTMENT",
"LAW N°12/2013 OF 22/03/2013 GOVERNING THE BAILIFF FUNCTION",
"MINISTERIAL ORDER Nº 004/MININTER/23 OF 19/10/2023 RELATING TO CORRECTION",
"21 JUNE 1975–JUDICIAL CONVENTION BETWEEN THE REPUBLIC OF BURUNDI, THE REPUBLIC OF RWANDA AND THE REPUBLIC OF ZAIRE",
"LAW Nº 005/2021 OF 05/02/2021 GOVERNING MUTUAL LEGAL ASSISTANCE IN CRIMINAL MATTERS",
"LAW N°44 bis/2011 OF 26/11/2011 GOVERNING THE STATUTE OF PROSECUTORS AND OTHER STAFF OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY",
"STATUTE OF THE INTERNATIONAL COURT OF JUSTICE",
"PROTOCOL OF THE COURT OF JUSTICE OF THE AFRICAN UNION",
"PRESIDENTIAL ORDER N° 093/01 OF 16/08/2019 ESTABLISHING THE SPECIAL STATUTES GOVERNING EMPLOYEES OF RWANDA INVESTIGATION BUREAU",
"LAW Nº 027/2019 OF 19/09/2019 RELATING TO THE CRIMINAL PROCEDURE",
"COOPERATION AGREEMENT BETWEEN NORTHERN CORRIDOR MEMBER COUNTRIES ON THE TRANSFER OF SENTENCED PRISONERS/OFFENDERS",
"LAW N° 022/2022 OF 29/09/2022 GOVERNING CORRECTIONAL SERVICES",
"MINISTERIAL ORDER No 07/MOJ/AG/20 OF 12/05/2020 DETERMINING THE MODALITIES OF EXERCISING COMPETENCE OF A BAILIFF",
"LAW Nº 22/2018 OF 29/04/2018 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE PROCEDURE",
"PRESIDENTIAL ORDER N°31/01 OF 24/1/2018 ESTABLISHING THE SPECIAL STATUTES GOVERNING PRISON GUARDS",
"LAW Nº012/2018 OF 04/04/2018 DETERMINING THE ORGANIZATION AND FUNCTIONING OF THE JUDICIARY",
"LAW Nº 027/2019 OF 19/09/2019 RELATING TO THE CRIMINAL PROCEDURE",
"LAW N°30/2018 OF 02/06/2018 DETERMINING THE JURISDICTION OF COURTS",
"MINISTERIAL ORDER N°140/MOJ/AG/2018 OF 30/08/2018 DETERMINING RANKS AND OTHER DISTINGUISHING MARKS FOR PRISON GUARDS",
"LAW N° 037/2021 OF 28/07/2021 AMENDING LAW N° 42/2014 OF 27/01/2015 GOVERNING RECOVERY OF OFFENCE-RELATED ASSETS",
"UBURYO BWO KWINJIZA ABAKOZI BASHYA MURI DASSO, REG Nº 009 YO MU 2023",
"LAW N° 57/2007 OF 17/11/2007 ESTABLISHING COMMUNITY WORKS IN RWANDA",
"LAW N° 10/98 OF 28/10/1998 ESTABLISHING THE PRACTICE OF ART OF HEALING",
"PRESIDENTIAL ORDER N° 053/01 OF 04/03/2020 DETERMINING OTHER SPECIFIC ACTIVITIES RELATED TO THE CELEBRATION OF NATIONAL HEROES’ DAY",
"AMABWIRIZA YA MINISITIRI N° 009 YO KU WA 09/11/2023 AGENGA IMYITWARIRE MBONEZAMURIMO Y'ABAGIZE URWEGO RWUNGANIRA UBUYOBOZI BW'AKARERE MU GUCUNGA UMUTEKANO (DASSO)",
"MINISTERIAL ORDER Nº 007/03/10/MIN OF 07/08/2003 DETERMINING PROCEDURES FOR THE PRIVATIZATION OF PUBLIC SERVICES AND ENTERPRISES AND FOR THE SELLING OF GOVERNMENT SHARES AND PARTNERSHIP SHARES IN SEMI PUBLIC COMPANIES",
"MINISTERIAL ORDER N° 02/7.04 OF 09/02/2006 ESTABLISHING REGULATIONS GOVERNING CONDUCT OF PERSONS WHO PARTICIPATE IN THE ELECTORAL ACTIVITY",
"INSTRUCTIONS OF THE REGISTRAR GENERAL Nº 001/2022/RG OF 23/05/2022 DETERMINING OTHER REQUIREMENTS FOR A PRIVATE COMPANY TO REQUEST FOR CONVERSION INTO A LIMITED LIABILITY PARTNERSHIP AND MODALITIES FOR SUCH A CONVERSION",
"MINISTERIAL ORDER N° 008/07.01 OF 10/10/2023 ESTABLISHING HEAD OFFICES OF DISTRICTS",
"LAW Nº 019/2020 OF 19/11/2020 AMENDING LAW N° 017/2020 OF 07/10/2020 ESTABLISHING THE GENERAL STATUTE GOVERNING PUBLIC SERVANTS",
"(58)\tMINISTERIAL INSTRUCTIONS Nº 01/CAB.M/017 OF  28/04/2017 DETERMINING INSPECTION OF TYPES OF BUILDINGS IN RELATION TO THEIR ANTICIPATED RISKS",
"INSTRUCTIONS OF THE REGISTRAR GENERAL Nº 002/2022/RG OF 23/05/2022 DETERMINING FEES PAYABLE FOR PARTNERSHIPS REGISTRATION SERVICES",
"PRESIDENTIAL ORDER Nº 061/01 OF 20/05/2019 DETERMINING MODALITIES FOR CONSOLIDATION OF MEMORIAL SITES FOR THE GENOCIDE AGAINST THE TUTSI",
"LAW Nº 59/2016 OF 11/01/2017 MODIFYING AND COMPLEMENTING LAW N°79/2013 OF 11/09/2013 DETERMINING THE MISSION, ORGANIZATION AND FUNCTIONING OF THE OFFICE OF THE AUDITOR GENERAL OF STATE FINANCES",
"LAW Nº 073/2021 OF 05/11/2021 REPEALING LAW No 42/2016 OF 18/10/2016 ESTABLISHING THE WORKFORCE DEVELOPMENT AUTHORITY AND DETERMINING ITS RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING",
"LAW N° 066/2021 OF 15/10/2021 REMOVING THE NATIONAL COMMISSION FOR THE FIGHT AGAINST GENOCIDE",
"LAW N° 066/2021 OF 15/10/2021 REMOVING THE NATIONAL COMMISSION FOR THE FIGHT AGAINST GENOCIDE",
"LAW N° 012/2020 OF 28/08/2020 REPEALING LAW N°22/2011 OF 28/06/2011 ESTABLISHING THE NATIONAL COMMISSION FOR CHILDREN AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"MINISTERIAL INSTRUCTIONS N° 02/MIN/022 OF 04/11/2022 ESTABLISHING THE NATIONAL COMMITTEE ON IMPLEMENTATION OF CIVIL AVIATION ENVIRONMENTAL PROTECTION",
"MINISTERIAL INSTRUCTIONS N° 02/MIN/022 OF 04/11/2022 ESTABLISHING THE NATIONAL COMMITTEE ON IMPLEMENTATION OF CIVIL AVIATION ENVIRONMENTAL PROTECTION",
"PRESIDENTIAL ORDER N° 091/01 OF 16/08/2019 DETERMINING THE CONSTITUENCY, THE NUMBER OF SENATORS TO BE ELECTED IN EACH CONSTITUENCY AND THE ELECTORAL COLLEGE",
"MINISTERIAL ORDER No 001/2016 OF 08/01/2016 PROVIDING SANCTIONS AGAINST PARENTS WHO DO NOT SEND THEIR CHILDREN TO SCHOOL AND AGAINST OTHER PERSONS WHO EMPLOY CHILDREN IN WORK PREVENTING THEM FROM GOING TO OR ENCOURAGING THEM TO DROP OUT OF SCHOOL",
"MINISTERIAL ORDER N° 007/2009 OF 01/12/2009 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE ASSET DISPOSAL EVALUATION COMMITTEE TO SET VALUE FOR STATE PRIVATE ASSETS TO BE SOLD, EXCHANGED, DONATED OR COMPLETELY DESTROYED",
"PRESIDENTIAL ORDER N° 010/01 OF 05/02/2021 DETERMINING ELECTIVE POSTS AT THE VILLAGE, CELL, SECTOR LEVELS AND ELECTORAL COLLEGE AT EACH LEVEL",
"MINISTERIAL ORDER N° 001/MoH/2021 OF 12/05/2021 DETERMINING BLOOD COMPONENTS WHICH MAY BE SOLD AND THE APPLICABLE PROCEDURE THEREOF",
"LAW Nº 60/2016 OF 11/01/2017 MODIFYING AND COMPLEMENTING LAW N°44 Bis/2011 OF 26/11/2011 GOVERNING THE STATUTE OF PROSECUTORS AND OTHER STAFF OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N° 19/2016 OF 20/05/2016 MODIFYING AND COMPLEMENTING LAW Nº 13 bis/2009 OF 16/06/2009 DETERMINING THE RESPONSIBILITIES, STRUCTURE AND FUNCTIONING OF THE CHANCELLERY FOR HEROES, NATIONAL ORDERS AND DECORATIONS OF HONOUR",
"MINISTERIAL ORDER N° 002/MoH/2021 OF 12/05/2021 DETERMINING MODALITIES FOR ESTABLISHMENT, ORGANISATION AND FUNCTIONING OF THE COMMITTEE OF MEDICAL DOCTORS",
"PRIME MINISTER’S ORDER N° 195/03 OF 03/08/2016 ESTABLISHING CRITERIA AND MODALITIES FOR DETERMINATION OF ALLOWANCES OF PUBLIC SERVANTS",
"MINISTERIAL ORDER N° 20/29 OF 18/04/2012 DETERMINING THE CONSENT FORM TO BE FILLED BY AN ORGAN, TISSUE OR HUMAN BODY PRODUCT RECIPIENT",
"PRESIDENTIAL ORDER N° 52/01 OF 13/09/2013 DETERMINING THE ELECTORAL CONSTITUENCIES, THE NUMBER OF WOMEN MEMBERS OF THE CHAMBER OF DEPUTIES ELECTED BY SPECIFIC COUNCILS IN ACCORDANCE WITH THE STATE ADMINISTRATIVE ENTITIES",
"MINISTERIAL ORDER N° 20/27 OF 18/04/2012 DETERMINING PROCEDURES FOR IMPORTATION AND EXPORTATION OF ORGANS, TISSUES OR PRODUCTS FROM A DEAD PERSON",
"MINISTERIAL ORDER N°20/34 OF 09/06/2015 DETERMINING THE CONTENT AND DESIGN OF THE WARNING TO BE PUT ON THE PACKAGE OF TOBACCO AND TOBACCO PRODUCTS",
"MINISTERIAL ORDER Nº 001/07.01 OF 23/03/2022 DETERMINING SITTING AND TRANSPORT ALLOWANCES GRANTED TO MEMBERS OF THE COUNCIL",
"ORGANIC LAW Nº 001/2021.OL OF 30/01/2021 AMENDING ORGANIC LAW N° 001/2019.OL OF 29/07/2019 GOVERNING ELECTIONS",
"MINISTERIAL ORDER Nº01/Cab.M/015 OF 03/02/2015 DETERMINING THE CLASSIFICATION AND NAMING OF ROADS",
"MINISTERIAL ORDER N° 20/28OF 18/04/2012 DETERMINING THE DONATION CARD AND THE WILL FORM FOR THE PERSON DONATING HIS/HER BODY",
"AMABWIRIZA Nº 02/2022 YO KU WA 07/10/2022 YA KOMISIYO Y’IGIHUGU Y’AMATORA YEREKEYE AMATORA Y’ABADEPITE B’U RWANDA MU NTEKO ISHINGA AMATEGEKO Y’UMURYANGO WA AFURIKA Y’IBURASIRAZUBA",
"PRIME MINISTER’S ORDER Nº75/03 OF 08/06/2017 DETERMINING THE FUNCTIONING OF THE STEERING COMMITTEE IN CHARGE OF APPROVAL AND OVERSIGHT OF PUBLIC PRIVATE PARTNERSHIP",
"LAW N° 011/2020 OF 28/08/2020 REMOVING THE RWANDA ACADEMY OF LANGUAGE AND CULTURE",
"MINISTERIAL ORDER No 001/20/MYCULTURE OF 23/01/2020 DETERMINING THE USE OF NATIONAL ORDERS",
"LAW N° 61/2018 OF 24/08/2018 MODIFYING LAW Nº 19/2013 OF 25/03/2013 DETERMINING MISSIONS, ORGANISATION AND FUNCTIONING OF THE NATIONAL COMMISSION FOR HUMAN RIGHTS",
"MINISTERIAL ORDER Nº 007/19/10/TC OF 16/07/2019 REGULATING INVESTMENT UNDERTAKING BY A DECENTRALISED ENTITY",
"LAW N°02/2011 OF 10/02/2011 DETERMINING THE RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING OF THE NATIONAL WOMEN’S COUNCIL",
"MINISTERIAL ORDER N°007/2016 OF 01/03/2016 DETERMINING MODALITIES FOR SPECIAL TREATMENT OF PERSONS WITH DISABILITIES IN SCHOOLS",
"PRESIDENTIAL ORDER Nº 116/01 OF 18/12/2015 DETERMINING MODALITIES FOR SUPPORTING PUBLIC SCHOOLS, GOVERNMENT-SUBSIDIZED SCHOOLS AND PRIVATE SCHOOLS TO MEET THEIR OBJECTIVES",
"PRESIDENTIAL ORDER No78/01 OF 30/09/2015 DETERMINING GUIDELINES FOR THE MANAGEMENT OF CONTRACTS ENTERED INTO BY A LEADER BEFORE ASSUMING PUBLIC OFFICE",
"MINISTERIAL ORDER N°20/30 OF 18/04/2012 ESTABLISHING A LIST OF DISEASES WHICH A PERSON WILLING TO DONATE OR RECEIVE AN ORGAN OR TISSUE OF HUMAN BODY MUST UNDERGO FOR A MEDICAL TEST",
"PRESIDENTIAL ORDER N ̊ 53/01 OF 19/08/2015 ESTABLISHING THE JOB CLASSIFICATION AND SALARY INDEX GRID IN PUBLIC SERVICE",
"MINISTERIAL ORDER NO 005/2016 OF 08/01/2016 DETERMINING MODALITIES FOR CONDUCTING MEETINGS AND MAKING DECISIONS OF THE SECTOR OR THE DISTRICT EDUCATION COUNCIL",
"MINISTERIAL ORDER N° 010/07.01 OF 12/08/2014 DETERMINING THE ORGANIZATION AND FUNCTIONING OF ASSOCIATION OF DECENTRALIZED ADMINISTRATIVE ENTITIES WITH LEGAL PERSONALITY",
"PRESIDENTIAL ORDER N°54/01 OF 19/08/2010 DETERMINING THE MODALITIES FOR A LEADER TO RECEIVE OR GIVE DONATIONS AND GIFTS",
"MINISTERIAL ORDER N°20/33 OF 09/06/2015 DETERMINING THE CHARACTERISTICS OF SMOKING AREAS AND THE CONTENT WHICH SHALL BE INCLUDED IN THE NOTICE TO BE DISPLAYED IN THE SMOKING AREA",
"ORGANIC LAW Nº 003/2021.OL OF 09/10/2021 AMENDING ORGANIC LAW N° 001/2019.OL OF 29/07/2019 GOVERNING ELECTIONS",
"PRESIDENTIAL ORDER N° 67/01 OF 20/10/2009 ESTABLISHING FOOD SUPPLEMENTS REGULATION",
"PRESIDENTIAL ORDER Nº 051/01 OF 02/08/2023 GOVERNING ROAD MAINTENANCE FUND",
"MINISTERIAL ORDER Nº20/37 OF 30/10/2015 DETERMINING THE CODE OF ETHICS FOR PHARMACY PROFESSION",
"PRESIDENTIAL ORDER No62/01 OF 08/03/2018 DETERMINING THE NATURE, AWARDING AND DECLARATION OF NATIONAL ORDERS",
"INSTRUCTIONS OF THE MINISTER N° 20/0005/19 OF 31/05/2019 ESTABLISHING THE LIST OF UNAUTHORISED DRINKS CONSIDERED AS SIMPLE NARCOTIC DRUGS",
"LAW N°50/2015 OF 14/12/2015 ESTABLISHING RWANDA DEMOBILIZATION AND REINTEGRATION COMMISSION (RDRC) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"MINISTERIAL ORDER N° 20/22 OF 07/03/2011 DETERMINING THE REGULATIONS FOR REGISTRATION OF NURSES AND MIDWIVES",
"ADDITIONAL PROTOCOL TO AMEND THE CONVENTION SIGNED AT PARIS ON THE 22nd OF NOVEMBER 1928 RELATING TO INTERNATIONAL EXHIBITIONS",
"LAW Nº 32/2017 OF 03/08/2017 GOVERNING ORGANISATION OF SPORT, GAMES AND LEISURE",
"PRESIDENTIAL ORDER N° 050/01 OF 02/08/2023 GOVERNI NG NATIONAL INSTITUTE OF STATISTICS OF RWANDA",
"LAW N° 67/2018 OF 30/08/2018 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF NATIONAL PUBLIC SERVICE COMMISSION",
"PRESIDENTIAL ORDER Nº 051/01 OF 02/08/2023 GOVERNING ROAD MAINTENANCE FUND",
"MINISTERIAL ORDER N°20/26 OF 18/04/2012 ESTABLISHING A COMMITEE OF AMPUTATION AND TRANSPLANTATION OF ORGANS, TISSUES OR PRODUCTS OF HUMAN BODY UTILIZATION AND DETERMINING ITS RESPONSIBILITIES AND FUNCTIONING",
"MINISTERIAL INSTRUCTIONS N° 001/INSTR/MINEDUC/23 OF 11/07/2023 RELATING TO THE AUTHORISATION TO CHANGE THE TYPE OF AN EDUCATION INSTITUTION",
"PRIME MINISTER’S ORDER N°114/03 OF 19/06/2015 DETERMINING CONDITIONS FOR AUTHORIZATION TO CARRY OUT REAL ESTATE DEVELOPMENT OPERATIONS",
"MINISTERIAL ORDER n° 20/20 of 03/06/2010 ESTABLISHING INTERNSHIP FOR MEDICAL DOCTORS",
"LAW Nº 40/2017 OF 16/08/2017 ESTABLISHING THE NATIONAL COUNCIL FOR SCIENCE AND TECHNOLOGY AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"PRE SI DENT I AL ORDER N° 052/01 OF 02/08/2023 GOVERNI NG RWAN DA PUBL I C PROCUREMENT AUTHORI TY",
"PRESIDENTIAL ORDER N°01/01 OF 14/01/2013 DETERMINING THE FUNCTIONING, COMPOSITION AND PROCEDURE FOR DECISION MAKING OF THE CABINET",
"MINISTERIAL ORDER N° 004/2016 OF 08/01/2016 DETERMINING RULES GOVERVERNING CODE OF CONDUCT OF HEADMASTERS, TEACHERS AND STUDENTS",
"MINISTERIAL ORDER N°01/09 OF 25/02/2009 DETERMINING THE USE OF FUNDS ALLOCATED AT SECTOR LEVEL",
"LAW N°56/2016 OF 16/12/2016 ESTABLISHING THE RWANDA GOVERNANCE BOARD AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRIME MINISTER’S ORDER N°113/03 OF 19/06/2015 ESTABLISHING THE INTER MINISTERIAL COMMITTEE RESPONSIBLE FOR FIGHTING AGAINST ILLICIT USE OF NARCOTIC DRUGS, PSYCHOTROPIC SUBSTANCES AND PRECURSORS, AND DETERMINING ITS ORGANISATION AND FUNCTIONING",
"MINISTERIAL ORDER N° 20/40 OF 12/01/2017 DETERMINING ADDITIONAL ALLIED HEALTH PROFESSIONS",
"PRESIDENTIAL ORDER No 01/01 OF 03/02/2011 GOVERNING ELECTIONS OF LEADERS AT VILLAGE, CELL AND SECTOR LEVELS",
"LAW N° 82/2013 OF 11/09/2013 ESTABLISHING NATIONAL POST OFFICE (NPO) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"MINISTERIAL ORDER Nº 002/17/10/TC OF 27/10/2017 DETERMINING THE FEES FOR REGISTRATION OF PHARMACEUTICAL PRODUCTS, MEDICAL DEVICES AND OTHER RELATED SERVICES",
"LAW Nº 31/2017 OF 25/07/2017 ESTABLISHING RWANDA INSPECTORATE, COMPETITION AND CONSUMER PROTECTION AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°52/2013 OF 28/06/2013 ESTABLISHING RWANDA MANAGEMENT INSTITUTE (RMI) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRESIDENTIAL ORDER NO 12 ter/01 OF 27/3/2003 RESTRUCTURING AND REORGANIZING THE RWANDA NATIONAL COMMISSION FOR UNESCO (R.N.C.U.)",
"PRESIDENTIAL ORDER N° 129/01 OF 16/12/2020 RELATING TO BORDER POSTS AND THE BORDER POSTS STEERING COMMITTEE",
"(56)\tPRESIDENTIAL ORDER N° 048/01 OF 20/07/2023 AMENDING PRESIDENTIAL ORDER NO 62/01 OF 08/03/2018 DETERMINING THE NATURE, AWARDING AND DECLARATION OF NATIONAL ORDERS",
"PRIME MINISTER’S ORDER N°58/03 OF 24/08/2009 DETERMINING THE ATTRIBUTIONS, ORGANISATION AND FUNCTIONING OF COMMUNITY WORKS SUPERVISING COMMITTEES AND THEIR RELATIONS WITH OTHER ORGANS",
"LAW N65/2013 OF 27/08/2013 ESTABLISHING THE INSTITUTE OF LEGAL PRACTICE AND DEVELOPMENT (ILPD) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N° 50/2008 OF 09/09/2008 DETERMINING THE PROCEDURE FOR DISPOSAL OF STATE PRIVATE ASSETS",
"LAW Nº 002/2018 OF 09/02/2018 ESTABLISHING THE INSTITUTE OF NATIONAL MUSEUMS OF RWANDA AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº 023/2024 OF 25/01/2024 GOVERNING RWANDA LAW REFORM COMMISSION",
"LAW Nº 003/2018 OF 09/02/2018 ESTABLISHING RWANDA FOOD AND DRUGS AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº 052/2023 OF 11/09/2023 ESTABLISHING THE AFRICAN BIOMANUFACTURING INSTITUTE",
"LAW N°12/2014 OF 09/05/2014 ESTABLISHING RWANDA ARCHIVES AND LIBRARY SERVICES AUTHORITY (RALSA) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"MINISTERIAL ORDER N° 008/2015 OF 22/01/2015 DETERMINING THE ORGANIZATION AND FUNCTIONING OF ADULT EDUCATION",
"LAW N°14/2013 OF 25/03/2013 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE PROVINCE",
"LAW N°01/2010 OF 29/01/2010 DETERMINING THE MISSION, ORGANISATION AND FUNCTIONING OF THE RWANDA ACADEMY OF LANGUAGE AND CULTURE",
"LAW N° 22/2017 OF 30/05/2017 ESTABLISHING RWANDA POLYTECHNIC HIGHER LEARNING INSTITUTION AND DETERMINING ITS MISSION, POWERS, ORGANISATION AND FUNCTIONING",
"MINISTERIAL INSTRUCTIONS Nº 7016 OF 30/11/2020 GOVERNING DUAL CLINICAL PRACTICE",
"LAW N° 066/2021 OF 15/10/2021 REMOVING THE NATIONAL COMMISSION FOR THE FIGHT AGAINST GENOCIDE",
"REGULATIONS Nº DGO/REG/005 OF 07/07/2022 GOVERNING TRADE OF USED ELECTRICAL AND ELECTRONIC EQUIPMENT",
"LAW N° 21/05/2016 OF 20/05/2016 RELATING TO HUMAN REPRODUCTIVE HEALTH",
"LAW N° 015/2022 OF 29/06/2022 RELATING TO RESEARCH ON A HUMAN BEING",
"MINISTERIAL ORDER N° 02/CAB.M/019 OF 15/04/2019 DETERMINING CATEGORISATION OF BUILDINGS AND PROCEDURES FOR APPLYING FOR AND GRANTING BUILDING PERMITS",
"LAW N°001/2016 OF 05/02/2016 DETERMINING THE MISSION, ORGANISATION AND FUNCTIONING OF THE NATIONAL YOUTH COUNCIL",
"MINISTERIAL ORDER N° 002/MoH/2023 OF 21/03/2023 RELATING TO RWANDA NATIONAL RESEARCH ETHICS COMMITTEE ON A HUMAN BEING",
"PRIME MINISTER‟S ORDER N°290/03 OF 13/11/2015 DETERMINING SPECIAL REGULATIONS GOVERNING GOVERNMENT SUBSIDIZED SCHOOLS",
"MINISTERIAL INSTRUCTIONS N° 20/7019 OF 21/11/2022 DETERMINING MODALITIES OF USE OF THE ONLINE INTEGRATED ELECTRONIC SYSTEM FOR RECRUITMENT AND TRANSFER OF HEALTH PROFESSIONALS",
"LAW Nº 057/2023 OF 17/11/2023 GOVERNING RWANDA DEVELOPMENT BOARD",
"LAW Nº03/2013 OF 08/02/2013 DETERMINING THE RESPONSIBILITIES, ORGANISATION, AND FUNCTIONING OF THE MEDIA HIGH COUNCIL (MHC)",
"LAW N° 45/2013 OF 16/06/2013 ON THE ORGANISATION OF STATISTICAL ACTIVITIES IN RWANDA",
"MINISTERIAL ORDER No 003/MoH/2021 OF 25/06/2021 RELATING TO THE CANNABIS AND CANNABIS PRODUCTS",
"LAW N°50/2013 OF 28/06/2013 ESTABLISHING RWANDA STANDARDS BOARD (RSB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRESIDENTIAL ORDER No 38/01 OF 22/02/2017 ESTABLISHING THE SPECIAL STATUTES GOVERNING EMPLOYEES OF THE OFFICE OF THE AUDITOR GENERAL OF STATE FINANCES",
"LAW N°39/2013 OF 16/06/2013 ESTABLISHING THE RWANDAN ELDERS ADVISORY FORUM AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°42/2013 OF 16/06/2013 ESTABLISHING RWANDA BROADCASTING AGENCY AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"PRESIDENTIAL ORDER N° 077/01 OF 11/12/2023 RELATING TO ELECTIONS OF THE PRESIDENT OF THE REPUBLIC AND DEPUTIES",
"MINISTERIAL ORDER Nº 001/MoH/2019 OF 04/03/2019 ESTABLISHING THE LIST OF NARCOTIC DRUGS AND THEIR CATEGORISATION",
"LAW N° 022/2021 OF 18/04/2021 ESTABLISHING RWANDA SPACE AGENCY",
"MINISTERIAL ORDER N° 05/Cab.M/015 OF 21/05/2015 DETERMINING THE CONTENTS OF URBAN PLANNING DOCUMENTS AND PROCEDURES FOR INVESTIGATION, INITIATION, ORGANIZATION AND ISSUANCE OF AUTHORIZATION TO CARRY OUT URBAN PLANNING OPERATIONS",
"MINISTERIAL INSTRUCTIONS No 003/MIN/022 OF 29/12/2022 DETERMINING REQUIREMENTS RELATING TO THE GOVERNMENT SUPPORT FOR AFFORDABLE HOUSING PROJECTS",
"MINISTERIAL ORDER N° 003/2016 OF 08/01/2016 DETERMINING GENERAL RULES GOVERNING NURSERY, PRIMARY AND SECONDARY SCHOOLS AND FUNCTIONING OF SCHOOL GENERAL ASSEMBLY AND ITS SUBSIDIARY ORGANS",
"LAW Nº 18/2017 OF 28/04/2017 GOVERNING RESULTS-BASED PERFORMANCE MANAGEMENT IN BRANCHES OF GOVERNMENT",
"ORGANIC LAW N° 001/2020.OL OF 08/06/2020 ESTABLISHING GENERAL PROVISIONS GOVERNING PUBLIC INSTITUTIONS",
"PRIME MINISTER’S ORDER No 020/03 OF 29/08/2021 GOVERNING ELECTIONS OF THE MEMBERS OF THE EXECUTIVE COMMITTEE OF EACH NATIONAL COUNCIL",
"PRESIDENTIAL ORDER N° 122/01 OF 15/10/2020 ESTABLISHING RWANDA BASIC EDUCATION BOARD",
"LAW N°57/2018 OF 13/08/2018 ON IMMIGRATION AND EMIGRATION IN RWANDA",
"MINISTERIAL ORDER Nº 16/MOJ/AG/19 OF 09/09/2019 ON COMMEMORATION OF THE GENOCIDE AGAINST THE TUTSI",
"PRESIDENTIAL ORDER N° 121/01 OF 15/10/2020 ESTABLISHING NATIONAL EXAMINATION AND SCHOOL INSPECTION AUTHORITY",
"LAW N° 55/2021 OF 29/08/2021 ON DECLARATION OF ASSETS",
"PRESIDENTIAL ORDER N° 123/01 OF 15/10/2020 ESTABLISHING THE RWANDA TECHNICAL AND VOCATIONAL EDUCATION AND TRAINING BOARD",
"PRESIDENTIAL ORDER N° 065/01 OF 26/10/2022 GOVERNING RWANDA MILITARY HOSPITAL",
"PRESIDENTIAL ORDER N° 032/01 OF 06/05/2022 GOVERNING RWANDA BIOMEDICAL CENTRE",
"UNITED NATIONS FOR EDUCATION, SCIENCE AND CULTURE CONSTITUTION (UNESCO)",
"PRESIDENTIAL ORDER N° 127/01 OF 03/12/2020 ESTABLISHING RWANDA ATOMIC ENERGY BOARD",
"PRESIDENTIAL ORDER N° 028/01 OF 06/05/2022 ESTABLISHING THE UNIVERSITY TEACHING HOSPITAL OF BUTARE",
"LAW Nº 15/2016 OF 02/05/2016 GOVERNING CEREMONIES TO COMMEMORATE THE GENOCIDE AGAINST THE TUTSI AND ORGANISATION AND MANAGEMENT OF MEMORIAL SITES FOR THE GENOCIDE AGAINST THE TUTSI",
"PRESIDENTIAL ORDER N° 029/01 OF 06/05/2022 ESTABLISHING THE UNIVERSITY TEACHING HOSPITAL OF KIGALI",
"LAW N°20/2011 OF 21/06/2011 GOVERNING HUMAN HABITATION IN RWANDA",
"PRIME MINISTER’S ORDER N°151/03 OF 10/06/2016 DETERMINING MODALITIES FOR CONDUCTING TRAINING OF PUBLIC SERVANTS",
"PRESIDENTIAL ORDER N° 081/01 OF 28/08/2020 ESTABLISHING HIGHER EDUCATION COUNCIL",
"PRESIDENTIAL ORDER N° 025/01 OF 18/03/2022 GOVERNING RWANDA WATER RESOURCES BOARD",
"LAW N°08/2013 OF 01/03/2013 RELATING TO THE CONTROL OF TOBACCO",
"PRESIDENTIAL ORDER N° 071/01 OF 09/12/2022 GOVERNING THE LOCAL ADMINISTRATIVE ENTITIES DEVELOPMENT AGENCY",
"PRESIDENTIAL ORDER N° 034/01 OF 06/05/2022 GOVERNING RWANDA FORESTRY AUTHORITY",
"LAW Nº 28/2016 OF 22/7/2016 ON THE PRESERVATION OF CULTURAL HERITAGE AND TRADITIONAL KNOWLEDGE",
"LAW N°49/2012 OF 22/01/2013 ESTABLISHING MEDICAL PROFESSIONAL LIABILITY INSURANCE",
"PRESIDENTIAL ORDER N° 033/01 OF 06/05/2022 GOVERNING RWANDA ENVIRONMENT MANAGEMENT AUTHORITY",
"PRESIDENTIAL ORDER N° 031/01 OF 06/05/2022 GOVERNING RWANDA METEOROLOGY AGENCY",
"LAW Nº 13 bis/2009 OF 16/06/2009 DETERMINING THE RESPONSIBILITIES, STRUCTURE AND FUNCTIONING OF THE CHANCELLERY FOR HEROES , NATIONAL ORDERS AND DECORATIONS OF HONOUR",
"LAW N° 71/2013 OF 10/09/2013 ESTABLISHING THE UNIVERSITY OF RWANDA (UR) AND DETERMINING ITS MISSION, POWERS, ORGANIZATION AND FUNCTIONING",
"PRESIDENTIAL ORDER N° 073/01 OF 09/12/2022 GOVERNING NATIONAL INDUSTRIAL RESEARCH AND DEVELOPMENT AGENCY",
"LAW N° 79/2013 OF 11/09/2013 DETERMINING THE MISSION, ORGANIZATION AND FUNCTIONING OF THE OFFICE OF THE AUDITOR GENERAL OF STATE FINANCES",
"PRESIDENTIAL ORDER N° 030/01 OF 06/05/2022 ESTABLISHING NATIONAL LAND AUTHORITY",
"PRESIDENTIAL ORDER N° 074/01 OF 09/12/2022 GOVERNING RWANDA AGRICULTURE AND ANIMAL RESOURCES DEVELOPMENT BOARD",
"LAW Nº13/2017 OF 14/04/2017 ESTABLISHING NATIONAL AGRICULTURAL EXPORT DEVELOPMENT BOARD (NAEB) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N° 45/2012 OF 14/01/2013 ON ORGANIZATION, FUNCTIONING AND COMPETENCE OF THE COUNCIL OF PHARMACISTS",
"PRESIDENTIAL ORDER N° 001/01 OF 06/02/2023 RELATING TO THE SECTOR, CELL AND VILLAGE",
"MINISTERIAL ORDER N°01 OF 11/11/2014 DETERMINING MODALITIES OF ELECTING WORKERS’ REPRESENTATIVES",
"PRESIDENTIAL ORDER N° 072/01 OF 31/10/2023 RELATING TO THE ADVISORY COUNCIL FOR THE FIGHT AGAINST INJUSTICE AND CORRUPTION",
"PRESIDENTIAL ORDER N°31/01 OF 24/1/2018 ESTABLISHING THE SPECIAL STATUTES GOVERNING PRISON GUARDS",
"PRESIDENTIAL ORDER N° 076/01 OF 09/12/2022 GOVERNING RWANDA HOUSING AUTHORITY",
"LAW N° 54/2021 OF 29/08/2021 GOVERNING THE OFFICE OF THE OMBUDSMAN",
"PRESIDENTIAL ORDER N° 128/01 OF 03/12/2020 RELATING TO RECRUITMENT OF PUBLIC SERVANTS AND INDUCTION PROGRAM",
"PRESIDENTIAL ORDER N°40/01 OF 24/01/2018 ESTABLISHING SPECIAL STATUTES GOVERNING EMPLOYEES OF NATIONAL AGRICULTURAL EXPORT DEVELOPMENT BOARD",
"PRIME MINISTER’S ORDER N° 027/03 OF 30/12/2021 ESTABLISHING THE SPECIAL STATUTE GOVERNING EMPLOYEES OF RWANDA SOCIAL SECURITY BOARD",
"CONVENTION AGAINST DISCRIMINATION IN EDUCATION",
"LAW Nº14/2016 OF 02/05/2016 GOVERNING PUBLIC PRIVATE PARTNERSHIPS",
"PRESIDENTIAL ORDER N° 071/01 OF 31/10/2023 RELATING TO THE SECURITY COMMITTEE",
"PRESIDENTIAL ORDER N° 104/01 OF 30/09/2015 ESTABLISHING THE SPECIAL STATUTES GOVERNING EMPLOYEES OF RWANDA CIVIL AVIATION AUTHORITY (RCAA)",
"MINISTERIAL INSTRUCTIONS N° 7015 OF 30/11/2020 DETERMINING THE RESPONSIBILITIES, POWERS AND FUNCTIONING OF COMMITTEES IN CHARGE OF THE MANAGEMENT OF PUBLIC OR SUBSIDIZED HEALTH FACILITIES",
"LAW N°03/2012 OF 15/02/2012 GOVERNING NARCOTIC DRUGS, PSYCHOTROPIC SUBSTANCES AND PRECURSORS IN RWANDA",
"CONVENTION ON TECHNICAL AND VOCATIONAL EDUCATION",
"LAW N°46/2012 OF 14/01/2013 ESTABLISHING THE RWANDA ALLIED HEALTH PROFESSIONS COUNCIL AND DETERMINING ITS ORGANIZATION, FUNCTIONING AND COMPETENCE",
"PRIME MINISTER’S ORDER Nº 005/03 OF 04/05/2023 ESTABLISHING SPECIAL STATUTE GOVERNING MEMBERS OF THE DISTRICT ADMINISTRATION SECURITY SUPPORT ORGAN",
"REGIONAL CONVENTION ON THE RECOGNITION OF STUDIES, DIPLOMAS AND DEGREES IN HIGHER EDUCATION IN LATIN AMERICA AND THE CARIBBEAN, 1974",
"MINISTERIAL ORDER Nº 001/MINUBUMWE/24 OF 08/02/2024 RELATING TO THE CLASSIFICATION OF TANGIBLE CULTURAL HERITAGE AND MODALITIES OF ITS USE AND INCOME GENERATION",
"LAW N°19/2013 OF 25/03/2013 DETERMINING MISSIONS, ORGANIZATION AND FUNCTIONING OF THE NATIONAL COMMISSION FOR HUMAN RIGHTS",
"PRESIDENTIAL ORDER N° 082/01 OF 28/08/2020 ESTABLISHING THE RWANDA CULTURAL HERITAGE ACADEMY",
"LAW N°12/2016 OF 02/05/2016 MODIFYING AND COMPLEMENTING LAW N° 44 BIS/2011 OF 26/11/2011 GOVERNING THE STATUTE OF PROSECUTORS AND OTHER STAFF OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY",
"LAW Nº09/2013 OF 01/03/2013 ESTABLISHING RWANDA UTILITIES REGULATORY AUTHORITY (RURA) AND DETERMINING ITS MISSION, POWERS, ORGANIZATION AND FUNCTIONING",
"STATUTES OF THE INTERNATIONAL CENTRE FOR THE STUDY OF THE PRESERVATION AND RESTORATION OF CULTURAL PROPERTY ICCROM AS REVISED AND APPROVED BY THE XXVIII SESSION OF THE G.A ON 29 NOVEMBER 2013",
"RULES ESTABLISHING THE INTERNATIONAL ORGANIZATION FOR MIGRATION",
"AFRICAN CHARTER ON DEMOCRACY, ELECTIONS AND GOVERNANCE",
"MINISTERIAL ORDER N° 20/24 OF 20/10/2011 DETERMINING THE LIST OF PARAMEDICAL PROFESSIONS AND THEIR REGULATIONS",
"LAW Nº 057/2021 BIS OF 18/09/2021 ESTABLISHING THE CAPITAL MARKET AUTHORITY OF RWANDA",
"CONVENTION ON THE RECOGNITION OF STUDIES, DIPLOMAS AND DEGREES IN HIGHER EDUCATION IN THE ARAB AND EUROPEAN STATES BORDERING ON THE MEDITERRANEAN, 1976",
"CONVENTION ON THE MEANS OF PROHIBITING AND PREVENTING THE ILLICIT IMPORT, EXPORT AND TRANSFER OF OWNERSHIP OF CULTURAL PROPERTY",
"LAW N° 51/2007 OF 20/09/2007 DETERMINING THE RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING OF THE GENDER MONITORING OFFICE IN RWANDA",
"MINISTERIAL ORDER N° 01/MIFOTRA/23 OF 13/06/2023 ON WORKING HOURS AND PUBLIC SERVANTS GOVERNED BY EMPLOYMENT CONTRACTS",
"CULTURAL CHARTER FOR AFRICA",
"ORGANIC LAW Nº 001/2023.OL OF 29/11/2023 AMENDING ORGANIC LAW 29/11/2023 N° 001/2019.OL OF 29/07/2019 GOVERNING ELECTIONS",
"REGIONAL CONVENTION ON THE RECOGNITION OF STUDIES, DIPLOMAS AND DEGREES IN HIGHER EDUCATION IN ASIA AND THE PACIFIC 1983",
"CONVENTION ON THE RECOGNITION OF STUDIES, DIPLOMAS AND DEGREES CONCERNING HIGHER EDUCATION IN THE STATES BELONGING TO THE EUROPE REGION 1979",
"MINISTERIAL ORDER Nº 001/MINEDUC/2021 OF 20/10//2021 DETERMINING STANDARDS IN EDUCATION",
"LAW N° 014/2021 OF 03/03/2021 DETERMINING STATUTE OF JUDGES AND JUDICIAL PERSONNEL",
"MINISTERIAL ORDER Nº 20/25 OF 18/04/2012 DETERMINING THE PROFESSION OF NURSES AND MIDWIVES",
"PRESIDENTIAL ORDER N° 021/01 OF 24/02/2021 DETERMINING PROFESSIONAL ETHICS FOR PUBLIC SERVANTS",
"PRESIDENTIAL ORDER N°30/01 OF 09/07/2012 ON SPECIFIC STATUTE FOR POLICE OFFICERS",
"MINISTERIAL ORDER N° 007/07.01 OF 13/07/2023 RELATING TO RULES OF PROCEDURE ESTABLISHED BY THE DISTRICT COUNCIL",
"ORGANIC LAW N° 001/2019.OL OF 29/07/2019 GOVERNING ELECTIONS",
"MINISTERIAL ORDER N° 003/MINEDUC/2021 OF 20/10//2021 DETERMINING RWANDA QUALIFICATIONS FRAMEWORK",
"AFRICAN CHARTER ON VALUES AND PRINCIPLES OF PUBLIC SERVICE AND ADMINISTRATION",
"LAW N°44 bis/2011 OF 26/11/2011 GOVERNING THE STATUTE OF PROSECUTORS AND OTHER STAFF OF THE NATIONAL PUBLIC PROSECUTION AUTHORITY",
"LAW N°10/2012 OF 02/05/2012 GOVERNING URBAN PLANNING AND BUILDING IN RWANDA",
"GUIDELINES Nº 001/RLRC/2022 OF 18/10/2022 ON LEGISLATIVE DRAFTING",
"MINISTERIAL ORDER N°001/14/10/TC OF 19/02/2014 ESTABLISHING REGULATIONS ON PUBLIC PROCUREMENT, STANDARD BIDDING DOCUMENTS AND STANDARD CONTRACTS",
"PROTOCOL AGAINST THE SMUGGLING OF MIGRANTS BY LAND, SEA AND AIR, SUPPLEMENTING THE UNITED NATIONS CONVENTION AGAINST TRANSNATIONAL ORGANIZED CRIME",
"CONVENTION CONCERNING THE PROTECTION OF THE WORLD CULTURAL AND NATURAL HERITAGE",
"LAW Nº 065/2021 OF 09/10/2021 GOVERNING THE DISTRICT",
"CONSTITUTION OF THE WORLD HEALTH ORGANIZATION",
"LAW N° 042/2023 OF 02/08/2023 GOVERNI NG LAND AND WATERWAYS TRAN S PORT",
"LAW N° 017/2020 OF 07/10/2020 ESTABLISHING THE GENERAL STATUTE GOVERNING PUBLIC SERVANTS",
"MINISTERIAL ORDER N° 003/17/10/TC OF 27/10/2017 SETTING OUT REGULATIONS FOR INTERNAL AUDIT AND AUDIT COMMITTEES IN PUBLIC ENTITIES",
"PRESIDENTIAL ORDER N° 077/01 OF 09/12/2022 GOVERNING RWANDA INFORMATION SOCIETY AUTHORITY",
"CONVENTION ON THE PROTECTION AND PROMOTION OF THE DIVERSITY OF CULTURAL EXPRESSIONS",
"CONVENTION ESTABLISHING THE INTERNATIONAL CENTER OF BANTU CIVILIZATION (CICIBA)",
"PRESIDENTIAL ORDER N° 072/01 OF 09/12/2022 GOVERNING THE NATIONAL IDENTIFICATION AGENCY",
"TREATY OF THE AFRICAN MEDICINES AGENCY (AMA)",
"MINISTERIAL ORDER N° 02/MIFOTRA/23 OF 01/08/2023 ON OCCUPATIONAL HEALTH AND SAFETY, ORGANISATIONS EMPLOYEES’ ORGANISATIONS AND EMPLOYERS’ ORGANISATIONS, CHILD EMPLOYMENT, EMPLOYMENT OF A FOREIGNER AND LEAVE",
"AMABWIRIZA YA KOMISIYO Y’IGIHUGU Y’AMATORA N ̊ 001/24 YO KU WA 19/02/2024 AGENGA AMATORA YA PEREZIDA WA REPUBULIKA N’AY’ABADEPITE YO MU MWAKA WA 2024",
"ORGANIC LAW N° 002/2022.OL OF 12/12/2022 ON PUBLIC FINANCE MANAGEMENT",
"LAW N° 010/2021 OF 16/02/2021 DETERMINING THE ORGANISATION OF EDUCATION",
"PRESIDENTIAL ORDER Nº 044/01 OF 14/02/2020 ESTABLISHING SPECIAL STATUTE GOVERNING RWANDA DEFENCE FORCE",
"WHO FRAMEWORK CONVENTON ON TOBACCO CONTROL",
"LAW N° 031/2022 OF 21/11/2022 GOVERNING PUBLIC PROCUREMENT",
"MINISTERIAL ORDER N°06/01 OF 29/05/2019 RELATING TO IMMIGRATION AND EMIGRATION",
"UNITED NATIONS CONVENTION AGAINST ILLICIT TRAFFIC IN NARCOTIC DRUGS AND PSYCHOTROPIC SUBSTANCES",
"MINISTERIAL ORDER Nº20/39 OF 29/01/2016 DETERMINING THE MEDICAL SERVICES PROVIDED AT EACH LEVEL OF HEALTH FACILITIES",
"SINGLE CONVENTION ON NARCOTIC DRUGS, 1961, AS AMENDED BY THE 1972 PROTOCOL AMENDING THE SINGLE CONVENTION ON NARCOTIC DRUGS, 1961",
"MINISTERIAL ORDER N°001/16/10/TC OF 26/01/2016 RELATING TO FINANCIAL REGULATIONS",
"MINISTERIAL ORDER N°03/CAB.M/019 OF 15/04/2019 DETERMINING URBAN PLANNING AND BUILDING REGULATIONS",
"INTERNATIONAL CONVENTION AGAINST DOPING IN SPORT",
"CONVENTION RELATING TO INTERNATIONAL EXHIBITIONS AMENDMENT OF 30th NOVEMBER 1972",
"PRESIDENTIAL ORDER No 064/01 OF 16/03/2020 ESTABLISHING SPECIAL STATUTES GOVERNING TEACHERS IN NURSERY, PRIMARY, SECONDARY AND TECHNICAL AND VOCATIONAL SCHOOLS",
"MINISTERIAL ORDER N° 002/MINEDUC/2021 OF 20/10/2021 ESTABLISHING CURRICULUM IN GENERAL, PROFESSIONAL AND TECHNICAL AND VOCATIONAL BASIC EDUCATION",
"MINISTERIAL ORDER N° 001/23/10/TC OF 10/10/2023 ESTABLISHING REGULATIONS GOVERNING PUBLIC PROCUREMENT",
"PRESIDENTIAL ORDER N° 093/01 OF 16/08/2019 ESTABLISHING THE SPECIAL STATUTES GOVERNING EMPLOYEES OF RWANDA INVESTIGATION BUREAU",
"LAW Nº 02/2000 OF 19/4/2000 RELATING TO PUBLIC AUCTION OF GOODS SEIZED OR CONFISCATED BY CUSTOMS",
"MINISTERIAL ORDER NO 005/04/10 OF 25/10/2004 FIXING RULES FOR CALCULATION OF IMPORT DUTIES",
"MIN. DECREE NO 002-FIN OF 16/3/2004 AUTHORIZING RWANDA REVENUE AUTHORITY TO RETAINNPART OF FISCAL REVENUE COLLECTED FOR ITS ORDINARY BUDGET ALLOCATION",
"LAW N° 15/97 OF NOVEMBER, 1997 ESTABLISHING RWANDA REVENUE AUTHORITY.",
"MINISTERIAL ORDER Nº 001/17/10/TC OF 30/01/2017 DETERMINING THE REQUIREMENTS FOR AN INDUSTRY TO BE ENTITLED TO EXEMPTION FROM THE VALUE ADDED TAX ON MACHINERY, CAPITAL GOODS AND RAW MATERIALS",
"ORDONNANCE-LOI DU 23/10/1964 DETERMINANT LE RÉGIME DES IMMUNITÉS DIPLOMATIQUES EN MATIÈRE FISCALE ET DOUANIERES ET LES RÉGIMES ASSIMILÉS",
"COMMISSIONER GENERAL RULES Nº 01/2017 OF 22/02/2017 GOVERNING THE PROCEDURE FOR IMPLEMENTING ZERO RATED GOODS AND SERVICES INTENDED FOR SPECIAL PERSONS",
"LAW Nº 051/2023 OF 05/09/2 0 23 AMENDI NG LAW Nº 027/2022 OF 20/10/2022 E S TABL ISH I NG TAXE S ON I NCOM",
"LAW No36/2015 OF 30/06/2015 ESTABLISHING THE LEVY ON PETROL AND GAS OIL FOR THE ESTABLISHMENT OF STRATEGIC PETROLEUM PRODUCTS RESERVES",
"COMMISSIONER GENERAL RULES Nº 002/2020 OF 05/08/2020 DETERMINING PAYMENT IN INSTALMENTS",
"COMMISSIONER GENERAL DIRECTIVES Nº 003/2020 OF 05/08/2020 DETERMINING MODALITIES AND CONDITIONS FOR REGISTERING A TAXPAYER AS LARGE TAXPAYER",
"LAW N°25/2016 OF 21/06/2016 MODIFYING AND COMPLEMENTING LAW N°35/2015 OF 30/06/2015 ESTABLISHING THE LEVY ON PETROL AND GAS OIL FOR ROAD MAINTENANCE",
"MINISTERIAL ORDER Nº 009/19/10/TC OF 16/07/2019 AMENDING MINISTERIAL ORDER Nº 001/17/10/TC OF 30/01/2017 DETERMINING THE REQUIREMENTS FOR AN INDUSTRY TO BE ENTITLED TO EXEMPTION FROM THE VALUE ADDED TAX ON MACHINERY, CAPITAL GOODS AND RAW MATERIALS",
"COMMISSIONER GENERAL RULES Nº 005/2020 OF 05/08/2020 DETERMINE THE CONDITIONS AND FUNCTIONING OF QUALIFIED PROFESSIONALS WHO REPRESENT TAXPAYERS",
"LAW N°25/2016 OF 21/06/2016 MODIFYING AND COMPLEMENTING LAW N°35/2015 OF 30/06/2015 ESTABLISHING THE LEVY ON PETROL AND GAS OIL FOR ROAD MAINTENANCE",
"COMMISSIONER GENERAL RULES N°02/2016 OF 08/08/2016 DETERMINING THE CONDITIONS AND MODALITIES OF REPRESENTATION",
"COMMISSIONER GENERAL RULES Nº 004/2020 OF 05/08/2020 DETERMINING THE MODALITIES FOR AMICABLE SETTLEMENT OF TAX RELATED DISPUTES",
"MINISTERIAL ORDER No 002/23/10/TC OF 24/11/2023 DETERMINING THE STANDARD RATES AND OTHER CRITERIA APPLIED TO SET THE TAX RATE PER SQUARE METER OF THE SURFACE OF LAND",
"MINISTERIAL ORDER Nº005/19/10/TC OF 29/04/2019 DETERMINING SIMPLIFIED ACCOUNTING METHOD FOR SMALL BUSINESSES",
"LAW Nº 29/2012 OF 27/07/2012 ESTABLISHING TAX ON GAMING ACTIVITIES",
"MINISTERIAL ORDER Nº003/19/10/TC OF 29/04/2019 DETERMINING A TAXPAYER’S PERMANENT RESIDENCE AND THE LOCATION OF EFFECTIVE PLACE OF MANAGEMENT",
"PRIME MINISTER’S ORDER N° 004/03 OF 16/02/2021 DETERMINING THE INSTITUTION IN CHARGE OF ASSESSMENT AND COLLECTION OF TAXES AND FEES ON BEHALF OF DECENTRALISED ENTITIES",
"LAW N°19/2017 OF 28/04/2017 ESTABLISHING THE LEVY ON IMPORTED GOODS FOR FINANCING AFRICAN UNION ACTIVITIES",
"LAW Nº55/2013 OF 02/08/2013 ON MINERALS TAX",
"MINISTERIAL ORDER N° 002/24/03/TC OF 08/03/2024 DETERMINING THE REWARD BASED ON THE VALUE ADDED TAX",
"MINISTERIAL ORDER Nº004/19/10/TC OF 29/04/2019 DETERMINING THE ANNUAL TURNOVER REQUIRED FOR CERTIFICATION OF FINANCIAL STATEMENTS",
"LAW Nº 050/2023 OF 05/09/ 2 023 E S TABL IS H I NG THE EXC IS E DUTY",
"MINISTERIAL ORDER Nº 003/24/03/TC OF 08/03/2024 DETERMINING MODALITIES TO APPLY FOR AUTHORISATION TO ACQUIRE FOREIGN SERVICES NOT AVAILABLE IN RWANDA",
"COMMISSIONER GENERAL INSTRUCTIONS Nº 001/2023 OF 11/01/2023 DETERMINING MODALITIES OF DECLARATION AND PAYMENT OF PAY AS YOU EARN AND VALUED ADDED TAX ON A QUARTERLY BASIS",
"MINISTERIAL ORDER Nº003/19/10/TC OF 29/04/2019 DETERMINING A TAXPAYER’S PERMANENT RESIDENCE AND THE LOCATION OF EFFECTIVE PLACE OF MANAGEMENT",
"MINISTERIAL ORDER Nº 002/13/10/TC OF 31/07/2013 ON MODALITIES OF USE OF A CERTIFIED ELECTRONIC BILLING MACHINE",
"MINISTERIAL ORDER Nº 001/24/03/TC OF 08/03/2024 DETERMINING MODALITIES AND CONDITIONS FOR TAXPAYERS TO BENEFIT FROM VOLUNTARY DISCLOSURE INCENTIVES",
"LAW Nº 027/2022 OF 20/10/2022 ESTABLISHING TAXES ON INCOME",
"LAW N° 021/2023 OF 31/03/2023 GOVERNING THE AUTOMATIC EXCHANGE OF INFORMATION FOR TAX PURPOSES",
"INTERNATIONAL CONVENTION ON THE SIMPLIFICATION AND HARMONIZATION OF CUSTOMS PROCEDURES",
"COMMISSIONER GENERAL RULES N°002/2013 OF 12/09/2013 IMPLEMENTING THE MINISTERIAL ORDER No002/13/10/TC OF 31/07/2013 ON MODALITIES OF USE OF CERTIFIED ELECTRONIC BILLING MACHINE",
"MINISTERIAL ORDER Nº 003/20/10/TC OF 11/12/2020 ESTABLISHING GENERAL RULES ON TRANSFER PRICING",
"PRESIDENTIAL ORDER Nº 075/01 OF 04/12/2023 DETERMINING FEES LEVIED ON SERVICES AND CERTIFICATES DELIVERED BY DECENTRALISED ENTITIES",
"LAW N°34/2015 OF 30/06/2015 ESTABLISHING THE INFRASTRUCTURE DEVELOPMENT LEVY ON IMPORTED GOODS",
"LAW Nº 048/2023 OF 05/09/2023 DETERMINING THE SOURCES OF REVENUE AND PROPERTY OF DECENTRALIZED ENTITIES",
"INTERNATIONAL CONVENTION ON THE SIMPLIFICATION AND HARMONIZATION OF CUSTOMS PROCEDURES (as amended)",
"NTERNATIONAL CONVENTION ON THE HARMONIZED COMMODITY DESCRIPTION AND CODING SYSTEM",
"LAW N° 020/2023 OF 31/03/2023 ON TAX PROCEDURES",
"EAST AFRICAN COMMUNITY AGREEMENT BETWEEN THE GOVERNMENTS OF THE REPUBLICS OF KENYA, UGANDA, BURUNDI, RWANDA AND THE UNITED REPUBLIC OF TANZANIA FOR THE AVOIDANCE OF DOUBLE TAXATION AND THE PREVENTION OF FISCAL EVASION WITH RESPECT TO TAXES ON INCOME",
"PROTOCOL ON THE ESTABLISHMENT OF THE EAST AFRICAN CUSTOMS UNION",
"LAW N° 72/2008 OF 31/12/2008 DETERMINING THE ENTRY INTO FORCE OF THE EAST AFRICAN COMMUNITY CUSTOMS MANAGEMENT ACT OF 1st JANUARY 2005",
"MINISTERIAL ORDER N° 008/19/10/TC OF 16/07/2019 DETERMINING TAX PROCEDURES APPLICABLE TO COLLECTION OF TAXES AND FEES FOR DECENTRALISED ENTITIES",
"LAW Nº 049/2023 OF 05/09/2023 ESTABLISHING VALUE ADDED TAX",
"LAW N° 10/2009 OF 14/05/2009 ON MORTGAGES",
"LAW N° 05/2011 OF 21/3/2011 REGULATING SPECIAL ECONOMIC ZONES IN RWANDA",
"MINISTERIAL ORDER No 014/11.30 OF 02/08/2017 DETERMINING A LIST OF PLANTS OR PLANT PRODUCTS THAT DO NOT REQUIRE A LICENSE OR A PHYTOSANITARY CERTIFICATE FOR IMPORTATION",
"LOI N° 22 DU 11/11/1964 SUR LA COLLECTES DE FONDS",
"DECRET-LOI DU 19 NOVEMBRE 1973 SUR LA PRESERVATION MORALE DE LA JEUNESSE",
"MINISTERIAL ORDER N° 009/19.20 OF 17/03/2020 DETERMINING FUNERAL EXPENSES AND DEATH ALLOWANCES FOR AN EMPLOYEE",
"MINISTERIAL ORDER Nº 01/09/MININFOR OF 10/08/2009 DETERMINING THE MODALITIES OF FACILITATING PERSONS WITH DISABILITIES IN MATTERS RELATING TO COMMUNICATION",
"MINISTERIAL ORDER Nº 006/19.20 OF 17/03/2020 DETERMINING MODALITIES FOR TRAINING OF EMPLOYEES",
"MINISTERIAL ORDER N° 002/19.20 OF 17/03/2020 ESTABLISHING THE LIST OF GROSS MISCONDUCT",
"PRESIDENTIAL ORDER Nº036/01 OF 16/02/2017 DETERMINING FEES PAID FOR A CIVIL STATUS RECORDS",
"MINISTERIAL ORDER N°011/MOJ/AG/2017 OF 24/02/2017 DETERMINING THE FORMAT OF AND MODALITIES FOR OBTAINING A PRIVATE NOTARY’S CARD",
"MINISTERIAL ORDER N°20/19 OF 27/7/2009 DETERMINING THE MODALITIES OF FACILITATING PERSONS WITH DISABILITIES ACCESS MEDICAL CARE",
"MINISTERIAL ORDER Nº 007/19.20 OF 17/03/2020 DETERMINING CORE ELEMENTS OF A WRITTEN EMPLOYMENT CONTRACT",
"MINISTERIAL ORDER N° 01/2009 OF 19/6/2009 DETERMINING THE MODALITIES OF FACILITATING PERSONS WITH DISABILITIES TO PRACTICE AND FOLLOW CULTURAL, ENTERTAINMENT AND SPORTS ACTIVITIES",
"MINISTERIAL ORDER N° 20/18 OF 27/7/2009 DETERMINING THE MODALITIES OF CLASSIFYING PERSONS WITH DISABILITIES INTO BASIC CATEGORIES BASED ON THE DEGREE OF DISABILITY",
"MINISTERIAL ORDER N°02/cab.M/09 OF 27/7/2009 DETERMINING THE MODALITIES OF FACILITATING PERSONS WITH DISABLITIES ON NECESSARY TRAVELS WITHIN THE COUNTRY",
"MINISTERIAL ORDER n° 010/07.01 OF 12/10/2007 PROVIDING FOR THE REGULATION OF THE FEDERATIONS, ASSOCIATIONS AND CENTERS RESPONSIBLE FOR WELFARE OF DISABLED PERSONS",
"MINISTERIAL ORDER N°002/Minifom/2010 OF 09/06/2010 DETERMINING KANEMBWE FOREST AS A DECLASSIFIED FOREST",
"MINISTERIAL ORDER N° 03/19.19 OF 27/7/2009 DETERMINING THE MODALITIES OF FACILITATING PERSONS WITH DISABILITIES TO EASYLY ACCESS EMPLOYMENT",
"MINISTERIAL ORDER N° 01/cab.M/09 OF 27/07/2009 DETERMINING THE MODALITIES OF CONSTRUCTING BUILDINGS PROVIDING VARIOUS PUBLIC SERVICES TO EASE THE ACCESS OF PERSONS WITH DISABILITIES",
"MINISTERIAL ORDER No 013/11.30 OF 02/08/2017 DETERMINING MODALITIES AND TIME LIMITS FOR CONFINING ANY MEANS OF CONVEYANCE AND ACTION TO BE TAKEN WITH REGARD TO UNLAWFULLY IMPORTED PLANTS, PLANT PRODUCTS AND REGULATED ARTICLES",
"LAW N°13/2010 OF 07/05/2010 MODIFYING AND COMPLEMENTING LAW N°10/2009 OF 14/05/2009 ON MORTGAGES",
"MINISTERIAL ORDER N° 06/07.01 OF 25/7/2009 MODIFYING AND COMPLEMENTING THE MINISTERIAL ORDER N° 010/07.01 OF 12/10/2007 PROVIDING FOR THE REGULATION OF THE FEDERATIONS, ASSOCIATIONS AND CENTERS RESPONSIBLE FOR WELFARE OF DISABLED PERSONS",
"MINISTERIAL ORDER N° 010/MoE/22 OF 12/05/2022 DETERMINING OTHER INFRASTRUCTURES INTENDED FOR COMMERCIAL PURPOSES",
"MINISTERIAL ORDER N° 008/MoE/22 OF 12/05/2022 DETERMINING TYPES OF SERVITUDE",
"MINISTERIAL ORDER N°05/09 OF 30/03/2009 ESTABLISHING MODALITIES OF STATE ASSISTANCE TO A NEEDY DISABLED PERSON",
"MINISTERIAL INSTRUCTIONS No004/08.11 OF 11/05/2015 MODIFYING AND COMPLETING MINISTERIAL INSTRUCTIONS NO 612/08.11 OF 16/04/2014 SETTING UP MODALITIES FOR DRAFTING, NEGOTIATING, REQUESTING FOR OPINIONS, SIGNING AND MANAGING CONTRACTS",
"MINISTERIAL ORDER N° 008/07.01/13 OF 19/12/2013 DETERMINING THE PROCEDURE OF CHARGES OF FEES RELATED TO ACCESS TO INFORMATION",
"MINISTERIAL ORDER N°012/MOJ/AG/2017 OF 24/02/2017 DETERMINING THE WRITINGS AND STAMP A NOTARY AFFIXES ON AUTHENTIC DEEDS",
"PRESIDENTIAL ORDER No100/01 OF 24/02/2017 DETERMINING FEES PAID FOR NOTARIAL SERVICES",
"MINISTERIAL ORDER N° 009/07.01/13 OF 19/12/2013 DETERMINING PRIVATE ORGANS TO WHICH THE LAW RELATING TO ACCESS TO INFORMATION APPLIES",
"MINISTERIAL INSTRUCTIONS No 002/MIN/022 of 18/04/2022 DETERMING REQUIREMENTS FOR TECHNOLOGISTS AND TECHNICIANS OF LEVEL 5, 6 AND 7, AND CONSTRUCTION SERVICES THEY ARE AUTHORISED TO PERFORM",
"MINISTERIAL ORDER N°007/2016 OF 01/03/2016 DETERMINING MODALITIES FOR SPECIAL TREATMENT OF PERSONS WITH DISABILITIES IN SCHOOLS",
"MINISTERIAL ORDER N° 04/09 OF 30/03/2009 ESTABLISHING MODALITIES OF HOW DISABLED PERSONS SHALL BE ASSISTED IN TIMES OF CONFLICT, ACCIDENTS AND OTHER DISASTERS",
"MINISTERIAL ORDER Nº023/MOJ/AG/2017 OF 23/10/2017 DETERMINING THE SCALE OF FEES FOR PROFESSIONAL BAILIFFS",
"MINISTERIAL ORDER N°003/16.01 OF 24/05/2013 DETERMINING THE STRUCTURE AND CONTENTS OF THE AQUACULTURE AND FISHING CONCESSION CONTRACT",
"MINISTERIAL ORDER Nº 007/07.01/13 OF 27/12/2013 DETERMINING THE TIME LIMIT FOR THE PROVISION OF INFORMATION OR EXPLANATIONS OF NOT PROVIDING IT",
"MINISTERIAL ORDER N° 011/07.01/15 OF 06/08/2015 DETERMINING REQUIREMENTS FOR BURYING IN PLACES OF WORSHIP",
"MINISTERIAL ORDER No005/MINIRENA/2015 OF 18/06/2015 ON REWARDING OF LOCAL AUTHORITIES THAT HAVE EXCELLED IN FOREST ACTIVITIES",
"MINISTERIAL ORDER N°007/16.01 OF 24/05/2013 DETERMINING THE MAIN MANAGEMENT VISIONS OF WATER RESOURCES IN THE MAIN HYDROGRAPHIC BASINS IN RWANDA",
"MINISTERIAL ORDER No 003/MoE/22 OF 15/02/2022 DETERMINING CATEGORIES OF LAND SUBJECT TO FREEHOLD AND MODALITIES FOR GRANTING FREEHOLD",
"MINISTERIAL ORDER Nº005/07.01/2014 OF 16/01/2014 DETERMINING MODALITIES OF THE GOVERNMENT SUPPORT TO LOCAL NON GOVERNMENTAL ORGANIZATIONS",
"MINISTERIAL ORDER N° 008/19.20 OF 17/03/2020 DETERMINING THE NATURE OF APPRENTICESHIP AND INTERNSHIP CONTRACTS",
"MINISTERIAL ORDER No 005/MoE/22 OF 15/02/2022 DETERMINING MODALITIES OF CHANGE OF LAND USE",
"MINISTERIAL ORDER Nº 01/MIDIMAR/13 OF 03/12/2013 DETERMINING APPROPRIATE MEASURES OF TRACING FAMILY MEMBERS OF UNACCOMPANIED REFUGEE CHILDREN FOR THEIR REUNIFICATON",
"LAW N° 027/2023 OF 18/05/2023 AMENDING THE LAW N° 66/2018 OF 30/08/2018 REGULATING LABOUR IN RWANDA",
"MINISTERIAL ORDER N° 001/MoE/23 OF 11/07/2023 TRANSFERRING STATE LAND IN PRIVATE DOMAIN TO A STATE-OWNED COMPANY",
"MINISTERIAL ORDER No 012/11.30 OF 02/08/2017 DETERMINING MODALITIES FOR IMPORTATION OF A PEST, A PLANT OR A PLANT PRODUCT FOR SCIENTIFIC AND RESEARCH PURPOSES AND MODALITIES FOR INSPECTION OF THE PLANT OR PLANT PRODUCT AND THE FORMAT OF THE PHYTOSANITARY CERTIFICATE",
"MINISTERIAL ORDER N0 007/2008 OF 15/08/2008 ESTABLISHING THE LIST OF PROTECTED ANIMAL AND PLANT SPECIES",
"MINISTERIAL ORDER No006/07.01/13 OF 19/12/2013 DETERMINING IN DETAILS THE INFORMATION TO BE DISCLOSED",
"NSTRUCTIONS No 01/NLA/2022 OF 21/10/2022 RELATING TO ELECTRONIC CERTIFICATE OF LAND REGISTRATION",
"LAW N°03/2011 OF 10/02/2011 DETERMINING THE RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING OF THE NATIONAL COUNCIL OF PERSONS WITH DISABILITIES",
"CONVENTION ON CONSENT TO MARRIAGE, MINIMUM AGE FOR MARRIAGE AND REGISTRATION OF MARRIAGES",
"MINISTERIAL ORDER N°004/16.01 OF 15/07/2010 GOVERNING THE IMPORTATION AND EXPORTATION OF WILD ANIMALS",
"PRIME MINISTER’S ORDER No115/03 OF 25/06/2015 DETERMINING THE ORGAN ISSUING A STATE FOREST HARVESTING LICENSE AND MODALITIES FOR ITS ISSUANCE",
"MINISTERIAL ORDER No006/MINIRENA/2015 OF 18/06/2015 DETERMINING THE MANAGEMENT OF PROTECTED STATE FORESTS NOT GOVERNED BY SPECIAL LAWS",
"C012 -WORKMEN'S COMPENSATION (AGRICULTURE) CONVENTION, 1921 (No 12)",
"MINISTERIAL ORDER N° 002/2021 OF 08/02/2021 DETERMINING PROCEDURES FOR CONDUCTING STRATEGIC ENVIRONMENTAL ASSESSMENT",
"MINISTERIAL ORDER Nº 003/2018 OF 24/10/2018 ESTABLISHING THE LIST OF ACTIVITIES AND PROJECTS FINANCED BY THE NATIONAL FUND FOR ENVIRONMENT",
"MINISTERIAL ORDER N°03/09 OF 30/03/2009 ESTABLISHING MODALITIES FOR REGULAR MONITORING OF ACTIVITIES OF TUTORS AND CENTRES THAT CATER FOR THE DISABLED PERSONS",
"MINISTERIAL ORDER No002/MIGEPROF/2017 OF 16/01/2017 DETERMINING PROCEDURES FOR GUARDIANSHIP OF MINOR BY THE STATE",
"MINISTERIAL ORDER N° 001/MoH/2023 OF 08/03/2023 DETERMINING MODALITIES TO ENSURE ASSISTANCE TO A CHILD INFECTED OR AFFECTED WITH AN INCURABLE DISEASE",
"MINISTERIAL ORDER N⁰003/MOJ/AG/2017 OF 07/02/2017 DETERMINING MODALITIES FOR MANAGEMENT OF ABANDONED PROPERTY AND COLLABORATION BETWEEN ORGANS INVOLVED IN THEIR MANAGEMENT",
"CONVENTION ON THE POLITICAL RIGHTS OF WOMEN",
"MINISTERIAL ORDER Nº20/37 OF 30/10/2015 DETERMINING THE CODE OF ETHICS FOR PHARMACY PROFESSION",
"MINISTERIAL ORDER N° 001/MINICT/24 OF 22/01/2024 RELATING TO THE SINGLE DIGITAL IDENTITY COORDINATION COUNCIL",
"MINISTERIAL ORDER N° 006/16.01 OF 24/05/2013 DETERMINING THE ORGANIZATION OF WATER RESOURCES DATA COLLECTION, TREATMENT, MANAGEMENT, EXPLOITATION AND COMMUNICATION",
"MINISTERIAL ORDER No 001/2021 OF 08/02/2021 ESTABLISHING THE LIST OF PROJECTS THAT MUST UNDERGO ENVIRONMENTAL AUDIT, INSTRUCTIONS AND PROCEDURES FOR CONDUCTING ENVIRONMENTAL AUDIT",
"MINISTERIAL ORDER No 001/07.01 OF 17/01/2017 ESTABLISHING MODALITIES AND PROCEDURES FOR CHANGE OF NAME",
"THE RIGHT OF ASSOCIATION (AGRICULTURE) CONVENTION, 1921",
"MINISTERIAL ORDER N° 001/07.01 OF 27/07/2020 DETERMINING THE OFFICER OF THE HEALTH FACILITY WITH POWERS OF CIVIL REGISTRAR",
"MINISTERIAL ORDER Nº 001/19.20 OF 17/03/2020 RELATING TO LABOUR INSPECTION",
"LAW N°55/2018 OF 13/08/2018 MODIFYING LAW N°05/2011 OF 21/03/2011 REGULATING SPECIAL ECONOMIC ZONES IN RWANDA",
"MINISTERIAL ORDER N°004/16.01 OF 24/05/2013 DETERMINING THE LIST OF WATER POLLUTANTS",
"MINISTERIAL ORDER N°27 OF 27/8/2018 DETERMINING MODALITIES FOR CONCLUDING A CONCESSION AGREEMENT FOR TOURISM INVESTMENT IN PROTECTED ARE",
"MINISTERIAL ORDER N° 004/MoE/23 OF 21/11/2023 DETERMINING THE FUNCTIONING OF THE REGULATORY COUNCIL ON THE ENVIRONMENTAL ASSESSMENT PROFESSION",
"MINISTERIAL ORDER N°02/2018 OF 17/09/2018 RELATING TO AIR POLLUTANTS EMISSION",
"LAW Nº 39/2017 OF 16/08/2017 ESTABLISHING THE NATIONAL FUND FOR ENVIRONMENT AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRIME MINISTER ORDER N°27/03 OF 23/10/2008 DETERMINING A LIST OF PROHIBITED DRUGS UNLESS AUTHORIZED OR TEMPORARY PERMITTED",
"MINISTERIAL ORDER Nº20/21 OF 30/11/2010 DETERMINING THE ORGANISATION AND PROCEDURES FOR ELECTION OF THE BOARD MEMBERS OF THE NATIONAL COUNCIL OF NURSES AND MIDWIVES",
"CONVENTION CONCERNING THE APPLICATION OF THE WEEKLY REST IN INDUSTRIAL UNDERTAKINGS, 1921 ( NO 14)",
"MINISTERIAL ORDER N° 001/MINISPOC/2015 OF 16/07/2015 DETERMINING METHODS FOR CREMATION OF A DEAD BODY AND BURIAL OF ASHES",
"PRIME MINISTER’S ORDER No 112/03 OF 19/06/2015 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE NATIONAL REFUGEE STATUS DETERMINATION COMMITTEE AND BENEFITS GRANTED TO ITS MEMBERS",
"MINISTERIAL ORDER N° 20/22 OF 07/03/2011 DETERMINING THE REGULATIONS FOR REGISTRATION OF NURSES AND MIDWIVES",
"MINISTERIAL ORDER Nº 20/23 OF 07/03/2011 DETERMINING THE CODE OF PROFESSIONAL CONDUCT OF NURSES AND MIDWIVES",
"LAW N° 01/2007 OF 20/01/2007 RELATING TO PROTECTION OF DISABLED PERSONS IN GENERAL",
"PROTOCOL RELATING TO THE STATUS OF REFUGEES",
"PRIME MINISTER‟S ORDER N° 143/03 OF 13/12/2010 ON THE ESTABLISHMENT OF THE NATIONAL MAN AND BIOSPHERE COMMITTEE",
"EQUALITY OF TREATMENT ON ACCIDENT COMPENSATION CONVENTION, 1925 (Nº 19)",
"MINISTERIAL INSTRUCTIONS N° 001/MINICT/2024 OF 22/03/2012 ON CHILD ONLINE PROTECTION",
"MINISTERIAL ORDER N°001/MIGEPROF/2017 OF 16/01/2017 DETERMINING CONDITIONS TO BE CONSIDERED IN INTERCOUNTRY ADOPTION AND THE PROCEDURE THEREOF",
"MINISTERIAL ORDER N°007/MINIRENA/2015 OF 18/06/2015 DETERMINING THE STRUCTURE AND THE CONTENTS OF THE LIST OF FORESTS",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER N° 004/MINES/RMB/2019 OF 18/07/2019 DETERMINING THE FORMAT AND CONTENT OF A MINERAL LICENCE AND THE CONTENT OF AN AGREEMENT WITH A MINING OR INDUSTRIAL QUARRY LICENCE HOLDER",
"LAW N°71/2018 OF 31/08/2018 RELATING TO THE PROTECTION OF THE CHILD",
"MINISTERIAL ORDER N°006/16.01 OF 15/07/2010 ESTABLISHING SPECIAL REGULATIONS RELATING TO BURYING TOXIC WASTES",
"LAW N° 04/2013 OF 08/02/2013 RELATING TO ACCESS TO INFORMATION",
"WORST FORMS OF CHILD LABOUR CONVENTION, 1999 (NO. 182)",
"OPTIONAL PROTOCOL TO THE CONVENTION ON THE RIGHTS OF THE CHILD ON THE INVOLVEMENT OF CHILDREN IN ARMED CONFLICT",
"MINISTERIAL ORDER Nº 008/MINIRENA/2015 OF 18/06/2015 ESTABLISHING A LIST OF PROTECTED TREES",
"MINISTERIAL ORDER Nº 007/01 OF 23/03/2022 RELATING TO RWANDAN NATIONALITY",
"CONVENTION (N°154) CONCERNING THE PROMOTION OF COLLECTIVE BARGAINING",
"LAW N°15/2010 OF 07/05/2010 CREATING AND ORGANIZING CONDOMINIUMS AND SETTING UP PROCEDURES FOR THEIR REGISTRATION",
"PRIME MINISTER’S ORDER Nº125/03 OF 27/07/2015 DETERMINING THE NUMBER, STRUCTURE AND USE OF PRIVATE CEMETERIES",
"MINISTERIAL ORDER Nº 01/MIDIMAR/18 OF 21/06/2018 RELATING TO ASSISTING ACTORS AND VOLUNTEERS IN CASE OF DISASTER RESPONSE",
"WORKMEN'S COMPENSATION (OCCUPATIONAL DISEASES) CONVENTION, 1925",
"MINIMUM WAGE-FIXING MACHINERY CONVENTION, 1928 (N° 26)",
"LAW N° 17/2019 OF 10/08/2019 RELATING TO THE PROHIBITION OF MANUFACTURING, IMPORTATION, USE AND SALE OF PLASTIC CARRY BAGS AND SINGLE-USE PLASTIC ITEMS",
"LAW N°39/2015 OF 22/08/2015 RELATING TO THE MANAGEMENT OF ABANDONED PROPERTY",
"INSTRUCTIONS OF THE REGISTRAR GENERAL Nº 002/2021/0RG OF 29/06/2021 AMENDING THE INSTRUCTIONS OF THE REGISTRAR GENERAL Nº 001/2020/ORG OF 12/05/2020 REGULATING MODALITIES OF MANAGEMENT, LEASE, AUCTION AND ACQUISITION OF MORTGAGE",
"MINISTERIAL ORDER N° 003/19.20 OF 17/03/2020 RELATING TO EMPLOYEES’ REPRESENTATIVES",
"MINISTERIAL ORDER Nº 004/MOE/22 OF 15/02/2022 DETERMINING MODALITIES AND PROCEDURES FOR RESOLUTION OF DISPUTES RELATED TO LAND BOUNDARIES AND SYSTEMATIC LAND REGISTRATION",
"PRIME MINISTER`S ORDER N°21/03 OF 05/03/2012 DETERMINING THE POWERS, ORGANIZATION AND FUNCTIONING OF THE RWANDA SPECIAL ECONOMIC ZONES AUTHORITY",
"MINISTERIAL ORDER Nº10 OF 28/07/2010 DETERMINING THE MODALITIES OF DECLARATION OF THE ENTERPRISE, WORKERS AND NATURE OF EMPLOYER REGISTER",
"OPTIONAL PROTOCOL TO THE CONVENTION ON THE ELIMINATION OF ALL FORMS OF DISCRIMINATION AGAINST WOMEN",
"MINISTERIAL ORDER N° 06/01 OF 19/03/2015 DETERMINING ADDITIONAL REQUIREMENTS FOR REGISTRATION AND RENEWAL OF CERTIFICATE OF REGISTRATION OF AN INTERNATIONAL NON-GOVERNMENTAL ORGANIZATION",
"LAW N°59/2017 OF 24/1/2018 GOVERNING RADIATION PROTECTION",
"CONVENTION (C 144) CONCERNING TRIPARTITE CONSULTATIONS TO PROMOTE THE IMPLEMENTATION OF INTERNATIONAL LABOUR STANDARDS",
"C017- WORKMEN'S COMPENSATION (ACCIDENTS) CONVENTION, 1925 (NO. 17)",
"MEDIA HIGH COUNCIL LAW(MHC)LAW Nº03/2013 OF 08/02/2013 DETERMINING THE RESPONSIBILITIES, ORGANIZATION, AND FUNCTIONING OF THE MEDIA HIGH COUNCIL (MHC)",
"MINISTERIAL ORDER N° 007/MOE/22 OF 12/05/2022 GOVERNING LAND COMMITTEES",
"PRIME MINISTER’S ORDER N° 032/03 OF 30/11/2022 ON NATIONAL LABOUR COUNCIL",
"CONVENTION CONCERNING PROTECTION AND FACILITIES TO BE AFFORDED TO WORKERS' REPRESENTATIVES IN THE UNDERTAKING",
"C123 – MINIMUM AGE (UNDERGROUND WORK) CONVENTION, 1965 (NO 123)",
"PRIME MINISTER’S ORDER Nº 022/03 OF 12/08/2022 GOVERNING REGISTRARS OF LAND TITLES",
"MINISTERIAL ORDER N° 009/MOE/22 OF 12/05/2022 DETERMINING MODALITIES FOR LAND SUBLEASE",
"LAW N° 18/2016 OF 18/05/2016 GOVERNING THE PRESERVATION OF AIR QUALITY AND PREVENTION OF AIR POLLUTION IN RWANDA",
"MINISTERIAL ORDER Nº 003/2021 OF 08/02/2021 DETERMINING THE LIST OF CHEMICALS AND OTHER POLLUTING SUBSTANCES THAT ARE NOT PERMITTED",
"PRIME MINISTER’S ORDER Nº 023/03 OF 12/08/2022 DETERMINING MODALITIES OF USING STATE LAND BY STATE ORGANS",
"PRIME MINISTER’S ORDER N° 031/03 OF 30/11/2022 GOVERNING THE NATIONAL WATER CONSULTATIVE COMMITTEE",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER Nº 001/MINES/RMB/2019 OF 18/07/2019 DETERMINING THE NATURE, AMOUNT AND DEPOSIT OF ENVIRONMENTAL REHABILITATION GUARANTEE",
"LAW N°11/2013 OF 11/03/2013 DETERMINING THE ORGANIZATION AND USE OF CEMETERIES",
"EQUAL REMUNERATION CONVENTION, 1951",
"LAW N° 26/2012 OF 29/06/2012 GOVERNING THE PROFESSIONS OF ARCHITECTURE AND ENGINEERING AND ESTABLISHING THE INSTITUTE OF ARCHITECTS AND THE INSTITUTE OF ENGINEERS IN RWANDA",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER Nº 006/MINES/RMB/2019 OF 18/07/2019 DETERMINING THE VOLUME OF MINERAL ORE SAMPLES",
"LAW N°02/2013 OF 08/02/2013 REGULATING MEDIA",
"MINISTERIAL ORDER N°005/07.01/13 OF 19/12/2013 DETERMINING WHICH INFORMATION COULD DESTABILIZE NATIONAL SECURITY",
"LAW N° 26/2012 OF 29/06/2012 GOVERNING THE PROFESSIONS OF ARCHITECTURE AND ENGINEERING AND ESTABLISHING THE INSTITUTE OF ARCHITECTS AND THE INSTITUTE OF ENGINEERS IN RWANDA",
"MINISTERIAL ORDER Nº 004/MINIRENA/2015 OF 18/06/2015 DETERMINING THE ISSUANCE OF LICENSE USED FOR THE ACTIVITIES RELATING TO A DISTRICT OR PRIVATE FOREST",
"C98 RIGHT TO ORGANIZE AND COLLECTIVE BARGAINING CONVENTION, 1949",
"LAW Nº05/2012 OF 17/02/2012 GOVERNING INTERNATIONAL NON-GOVERNMENTAL ORGANIZATIONS",
"C089 - NIGHT WORK (WOMEN) CONVENTION (REVISED), 1948 (NO. 89)",
"MINISTERIAL ORDER Nº 002/MOE/22 OF 31/01/2022 GOVERNING THE WATER RESOURCES MANAGEMENT COMMITTEE AT CATCHMENT LEVEL AND THE TECHNICAL COMMITTEE ON DAMS",
"Law N° 13ter/2014 of 21/05/2014 relating to refugees",
"HOLIDAYS WITH PAY CONVENTION, 1936 (Nº. 52)",
"DISCRIMINATION (EMPLOYMENT AND OCCUPATION) CONVENTION, 1958",
"MINISTERIAL ORDER Nº 002/07.01 OF 27/07/2020 DETERMINING THE NUMBER, TYPE, FORMAT AND USE OF CIVIL STATUS REGISTERS",
"PRIME MINISTER’S ORDER No 008/03 OF 26/04/2021 GOVERNING ENVIRONMENTAL PROTECTION COMMITTEES AND THEIR MEMBERS",
"LAW N° 001/2020 OF 02/02/2020 AMENDING LAW N° 32/2016 OF 28/08/2016 GOVERNING PERSONS AND FAMILY",
"NSTRUMENT FOR THE AMENDMENT OF THE CONSTITUTION OF THE INTERNATIONAL LABOUR ORGANISATION",
"CONVENTION ON WETLANDS OF INTERNATIONAL IMPORTANCE ESPECIALLY AS WATERFOWL HABITAT 1971",
"LAW N°16/2016 OF 10/05/2016 ON PLANT HEALTH PROTECTION IN RWANDA",
"MINISTERIAL ORDER Nº 002/MOJ/AG/23 OF 22/06/2023 DETERMINING MODALITIES TO PRACTICE THE OFFICE OF NOTARY BY PRIVATE PERSONS AND MODALITIES TO PROVIDE NOTARIAL SERVICES BY ELECTRONIC MEAN",
"NTERNATIONAL LABOUR CONVENTION N° 29 OF JUNE 28, 1930 CONCERNING FORCED OR COMPULSORY LABOUR",
"MINISTERIAL ORDER No 005/2021 OF 08/04/2021 RELATING TO THE NATIONAL REPORT ON CLIMATE CHANGE",
"C81 LABOUR INSPECTION CONVENTION",
"FREEDOM OF ASSOCIATION AND PROTECTION OF THE RIGHT TO ORGANISE CONVENTION, 1948",
"CONVENTION (N° 187) CONCERNING PROMOTIONAL FRAMEWORK FOR OCCUPATIONAL SAFETY AND HEALTH, 2006",
"LAW N°49/2018 OF 13/08/2018 DETERMINING THE USE AND MANAGEMENT OF WATER RESOURCES IN RWANDA",
"LAW N° 22/2005 OF 21/11/2005 ESTABLISHING THE NYUNGWE NATIONAL PARK",
"PROTOCOL TO THE AFRICAN CHARTER ON HUMAN AND PEOPLES’ RIGHTS ON THE RIGHTS OF OLDER PERSONS IN AFRICA",
"LAW N° 58/2018 OF 13/08/2018 ON MINING AND QUARRY OPERATIONS",
"LAW N°04/2012 OF 17/02/2012 GOVERNING THE ORGANISATION AND THE FUNCTIONING OF NATIONAL NON-GOVERNMENTAL ORGANISATIONS",
"PRIME MINISTER’S ORDER N° 079/03 OF 26/07/2019 DETERMINING THE STRUCTURE AND FUNCTIONING OF THE COMMITTEE IN CHARGE OF ASSESSMENT OF APPLICATIONS FOR LICENCES AND DISPUTES RELATED TO MINING AND QUARRY OPERATIONS",
"CONVENTION ON PROTECTION OF CHILDREN AND CO-OPERATION IN RESPECT OF INTERCOUNTRY ADOPTION",
"LAW N°41/2015 OF 29/08/2015 RELATING TO DISASTER MANAGEMENT",
"CONVENTION CONCERNING ANNUAL HOLIDAY WITH PAY (Revised), 1970",
"OAU CONVENTION GOVERNING THE SPECIFIC ASPECTS OF REFUGEE PROBLEMS IN AFRICA",
"CONVENTION CONCERNING LABOUR CLAUSE IN PUBLIC CONTRACTS",
"LAW Nº44/2012 OF 14/01/2013 ON THE ORGANISATION, FUNCTIONING AND COMPETENCE OF THE MEDICAL AND DENTAL COUNCIL",
"C062 - SAFETY PROVISIONS (BUILDING) CONVENTION (No 62), 193",
"MINISTERIAL ORDER No 004/2021 OF 12/02/2021GOVERNING THE USE OF SUBSTANCES THAT DEPLETE THE OZONE LAYER OR MAY CAUSE CLIMATE CHANGE",
"LAW N°46/2012 OF 14/01/2013 ESTABLISHING THE RWANDA ALLIED HEALTH PROFESSIONS COUNCIL AND DETERMINING ITS ORGANISATION, FUNCTIONING AND COMPETENCE",
"LAW N° 025/2024 OF 16/02/2024 GOVERNING BIOSAFETY",
"LAW N° 56/2013 OF 09/08/2013 ESTABLISHING RWANDA COUNCIL OF VETERINARY DOCTORS AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"CONVENTION ON THE ELIMINATION OF ALL FORMS OF DISCRIMINATION AGAINST WOMEN",
"LAW N° 32/2015 OF 11/06/2015 RELATING TO EXPROPRIATION IN THE PUBLIC INTEREST",
"C181- CONVENTION CONCERNING PRIVATE EMPLOYMENT AGENCIES",
"INSTRUCTIONS OF THE REGISTRAR GENERAL N° 001/2020/ORG OF 12/05/2020 REGULATING MODALITIES OF MANAGEMENT, LEASE, AUCTION AND ACQUISITION OF MORTGAGE",
"GENERAL CONVENTION ON SOCIAL SECURITY BETWEEN BURUNDI, RWANDA AND THE REPUBLIC OF ZAIRE",
"C138 - MINIMUM AGE CONVENTION, 1973 (N° 138)",
"LAW Nº45/2015 OF 15/10/2015 ESTABLISHING THE GISHWATI - MUKURA NATIONAL PARK",
"CONVENTION Nº 155 CONCERNING OCCUPATIONAL SAFETY AND HEALTH AND THE WORKING ENVIRONMENT",
"PARIS AGREEMENT ON UNITED NATIONS FRAMEWORK CONVENTION ON CLIMATE CHANGE",
"CONVENTION 118-EQUALITY OF TREATMENT (SOCIAL SECURITY), 1962, CONCERNING EQUALITY OF TREATMENT OF NATIONALS AND NON-NATIONALS IN SOCIAL SECURITY",
"AFRICAN CHARTER ON THE RIGHTS AND WELFARE OF THE CHILD",
"LAW N°011/2016 OF 02/05/2016 ESTABLISHING THE ASSOCIATION OF PROCUREMENT PROFESSIONALS AND DETERMINING ITS ORGANIZATION AND FUNCTIONING",
"CONVENTION ON THE REDUCTION OF STATELESSNESS",
"ORGANIC LAW  Nº 002/2021.OL OF 16/07/2021 GOVERNING RWANDAN NATIONALITY",
"LAW N°17/2010 OF 12/05/2010 ESTABLISHING AND ORGANISING THE REAL PROPERTY VALUATION PROFESSION IN RWANDA",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER N° 003/MINES/RMB/2019 OF 18/07/2019 DETERMINING THE CONTENT OF MINERAL PROCESSING AND TRADING LICENCES AND MODALITIES OF THEIR GRANTING",
"LAW N°36/2016 OF 08/09/2016 ESTABLISHING RWANDA ASSOCIATION OF PROFESSIONAL ENVIRONMENTAL PRACTITIONERS AND DETERMINING ITS ORGANIZATION AND FUNCTIONING",
"LAW N°72/2018 OF 31/08/2018 DETERMINING THE ORGANISATION AND FUNCTIONING OF FAITH-BASED ORGANISATIONS",
"AGREEMENT ON THE NILE RIVER BASIN COOPERATIVE FRAMEWORK",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER N° 002/MINES/RMB/2019 OF 18/07/2019 DETERMINING THE PROVISION OF SERVICES RELATING TO MINING AND QUARRY OPERATIONS",
"CONVENTION ON THE RIGHTS OF THE CHILD",
"AFRICAN YOUTH CHARTER",
"CONVENTION ON THE CIVIL ASPECTS OF INTERNATIONAL CHILD ABDUCTION",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER N° 007/MINES/RMB/2019 OF 18/07/2019 DETERMINING CATEGORIES OF QUARRIES, REQUIREMENTS FOR ACQUISITION OF QUARRY LICENCE AND REPORTING",
"AFRICAN CONVENTION ON THE CONSERVATION OF NATURE AND NATURAL RESOURCES",
"MINISTERIAL INSTRUCTIONS No612/08.11 OF 16/04/2014 SETTING UP MODALITIES FOR DRAFTING, NEGOTIATING, REQUESTING FOR OPINIONS, SIGNING AND MANAGING CONTRACTS",
"CONVENTION RELATING TO THE STATUS OF STATELESS PERSONS",
"LAW N°48/2018 OF 13/08/2018 ON ENVIRONMENT",
"THE VIENNA CONVENTION FOR THE PROTECTION OF THE OZONE LAYER",
"BASEL CONVENTION ON THE CONTROL OF TRANSBOUNDARY MOVEMENTS OF HAZARDOUS WASTES AND THEIR DISPOSAL",
"MINISTERIAL ORDER N° 006/MoE/22 OF 12/05/2022 ON LAND REGISTRATION",
"LAW N°83/2013 OF 11/09/2013 ESTABLISHING THE BAR ASSOCIATION IN RWANDA AND DETERMINING ITS ORGANIZATION AND FUNCTIONING",
"LAW No13bis/2014 OF 21/05/2014 GOVERNING THE OFFICE OF NOTARY",
"MINISTERIAL ORDER N° 013/MOJ/AG/19 OF 16/07/2019 DETERMINING REQUIREMENTS FOR GRANTING AUTHORISATION TO IMPORT, MANUFACTURE, TRANSPORT, TRADE IN AND USE DYNAMITES IN MINING AND QUARRY OPERATIONS",
"PROTOCOL TO THE AFRICAN CHARTER ON HUMAN AND PEOPLES' RIGHTS ON THE RIGHTS OF WOMEN IN AFRICA",
"MINISTERIAL ORDER No 001/MIGEPROF/2023 OF 12/01/2023 RELATING TO THE CHILD WELL- BEING",
"REVISED AFRICAN CONVENTION ON THE CONSERVATION OF NATURE AND NATURAL RESOURCES",
"UNITED NATIONS CONVENTION TO COMBAT DESERTIFICATION IN THOSE COUNTRIES EXPERIENCING SERIOUS DROUGHT AND/OR DESERTIFICATION, PARTICULARLY IN AFRICA",
"LAW N°45/2011 OF 25/11/2011 GOVERNING CONTRACTS",
"LAW N° 66/2018 OF 30/08/2018 REGULATING LABOUR IN RWANDA",
"LAW N° 064/2021 OF 14/10/2021 GOVERNING BIOLOGICAL DIVERSITY",
"PRIME MINISTER’S ORDER No 001/03 OF 30/01/2024 RELATING TO SWAMPLANDS",
"PRESIDENTIAL ORDER N° 038/01 OF 20/05/2022 ESTABLISHING THE NATIONAL LAND USE AND DEVELOPMENT MASTER PLAN",
"ROTTERDAM CONVENTION ON THE PRIOR INFORMED CONSENT PROCEDURE FOR CERTAIN HAZARDOUS CHEMICALS AND PESTICIDES IN INTERNATIONAL TRADE",
"MINAMATA CONVENTION ON MERCURY",
"LAW Nº32/2016 OF 28/08/2016 GOVERNING PERSONS AND FAMILY",
"NTERNATIONAL CONVENTION ON THE PROTECTION OF THE RIGHTS OF ALL MIGRANT WORKERS AND MEMBERS OF THEIR FAMILIES",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER N° 005/MINES/RMB/2019 OF 18/07/2019 DETERMINING POTENTIAL MINING AREAS, CRITERIA FOR CATEGORISATION OF MINES, MODALITIES AND REQUIREMENTS FOR MINERAL LICENCE APPLICATION AND FOR TENDERS",
"CONVENTION ON BIOLOGICAL DIVERSITY",
"PROTOCOL TO THE AFRICAN CHARTER ON HUMAN AND PEOPLES’ RIGHTS ON THE RIGHTS OF PERSONS WITH DISABILITIES IN AFRICA",
"LAW N° 68/2019 OF 29/10/2019 GOVERNING THE AKAGERA NATIONAL PARK",
"CONVENTION RELATING TO THE STATUS OF REFUGEES",
"LAW N° 27/2021 OF 10/06/2021 GOVERNING LAND",
"NAGOYA PROTOCOL ON ACCESS TO GENETIC RESOURCES AND THE FAIR AND EQUITABLE SHARING OF BENEFITS ARISING FROM THEIR UTILIZATION TO THE CONVENTION ON BIOLOGICAL DIVERSITY",
"MINISTERIAL ORDER N° 002/MINICOM/23 OF 22/12/2023 DETERMINING TECHNICAL REGULATIONS RELATING TO METROLOGY",
"CONVENTION CONCERNING WORKMEN'S COMPENSATION FOR OCCUPATIONAL DISEASES (REVISED), 1934",
"BAMAKO CONVENTION ON THE BAN OF THE IMPORT INTO AFRICA AND THE CONTROL OF TRANSBOUNDARY MOVEMENT AND MANAGEMENT OF HAZARDOUS WASTES WITHIN AFRICA",
"LAW Nº27/2016 OF 08/07/2016 GOVERNING MATRIMONIAL REGIMES, DONATIONS AND SUCCESSIONS",
"AFRICAN UNION CONVENTION FOR THE PROTECTION AND ASSISTANCE OF INTERNALLY DISPLACED PERSONS IN AFRICA",
"MONTREAL PROTOCOL ON SUBSTANCES THAT DEPLETE THE OZONE LAYER AS AMENDED IN LONDON 1990 COPENHAGEN 1992 VIENNA 1995 MONTREAL 1997 BEIJING 1999",
"KYOTO PROTOCOL TO THE UNITED NATIONS FRAMEWORK CONVENTION ON CLIMATE CHANGE",
"LAW N°25/2008 OF 25/07/2008 ESTABLISHING THE NATIONAL COUNCIL OF NURSES AND MIDWIVES AND DETERMINING ITS ORGANISATION, FUNCTIONING AND COMPETENCE",
"STOCKHOLM CONVENTION ON PERSISTENT ORGANIC POLLUTANTS, REVISED 2017",
"CARTAGENA PROTOCOL ON BIOSAFETY TO THE CONVENTION ON BIOLOGICAL DIVERSITY",
"DÉCRÊT -LOI Nº 32/75 DU 7 AÔUT 1975 RÉLATIF À L’ASSURANCE OBLIGATOIRE DE LA RÉSPONSABILITÉ CIVILE EN MATIÈRE DE VEHICULE AUTOMOTEURS",
"MINISTERIAL ORDER NO 7/DC/04 OF 07/06/2004 SPECIFYING THE CONTENT OF THE REGULATORY BOARD'S REGISTER OF TELECOMMUNICATIONS ACTIVITIES",
"LAW Nº 41/2001 OF 19/9/2001 RELATING TO THE COMPENSATION OF VOCTIMS OF PHYSICAL ACCIDENTS CAUSED BY MOTOVEHICLES",
"MINISTERIAL DECREE Nº 20/14 OF 7 03/5/2005 DETERMINING A LIST  OF DRUGS PHARMACEUTICALS PRODUCTS WHICH MUST APPEAR IN A PHARMACEUTICAL  POINT PF SALE",
"LOI NO 28/90 DU 8 MAI 1990 PORTANT CONTROLE DES CHANGES",
"PRESIDENTIAL ORDER N°009/01 OF  10/05/2016 DETERMINING  CONTRIBUTIONS RATE TO  MANDATORY PENSION SCHEME",
"NATIONAL BANK OF RWANDA DIRECTIVE No 4230/2020-00020[613] OF 30/06/2020 ON THE REFINANCING FACILITY",
"MINISTERIAL ORDER NO 2/DC/04 OF 7/06/2004 ON INSTRUCTIONS FOR THE PUBICATION IN OFFICIAL GAZETTE OF MODIFICATION MADE TO TELECOMMUNICATION",
"MINISTERIAL ORDER NO 8/DC/04 OF 07/06/2004 ON ADDITIONNAL AND SPECIFIC TYPES OF AGREEMENTS, DECISIONS, PRACTICES AND CODES OF CONDUCT CONSIDERED TO BE ANTI-COMPETITIVE OR ON CLAUSE OF A DOMINANT POSITION",
"PRESIDENTIAL ORDER NO 31/01 OF 25/08/2003 ON COMPENSATION FOR PERSONAL INJURY DUE TO ACCIDENTS CAUSED BY MOTO VEHICLES",
"DECLET-LOI NO 20/78 DU 14 AOUT 1978 COMPLETANT LA LOI DU 13 MARS 1970 RELATIVE AU REGIME DES BOISSONS ALCOOLIQUES",
"MINISTERIAL ORDER NO 6/DC/04 OF 07/06/2004 ON REQUESTS FOR INSTALLATION ON TELECOMMUNICATION FACILITIES AND TERMINAL EQUIPMENTS ON PUBLIC AND PRIVATE PROPERTY",
"NATIONAL BANQ TREASURY BOND ISSUANCE",
"ARRETE MINISTERIEL NO 1932/06 DU 8 DECEMBRE 1987 PRECISANT LES FORMES DE LA MISE EN DEMEURE ET DU RELEVE DES SOMMES DUES AINSI QUE LES CONDITIONS DE CERTICATION DUDIT RELEVE ET CELLES DANS LES QUELLES L'EMPLOYEUR PEUT INTRODUIRE UN RECOURS",
"ARRETE PRESIDENTIEL NO 110/11 DU 17 AVRIL 1978 PORTANT REGLEMENTATION DE LA PROTECTION DE CONSERVATION, DE L'EXPORTATION ET DE L'AMELIORATION DU PATURAGE",
"PRESIDENTIAL ORDER N° 069/01 OF 13/04/2018 INCREASING PENSION AND OCCUPATIONAL HAZARDS BENEFITS GRANTED BY RWANDA SOCIAL SECURITY BOARD",
"DECRET-LOI NO 02/77 DU 5 JANVIER 1977 MODIFIANT LE DECRET-LOI DU 22 AOUT 1974 PORTANT ORGANISATION DE LA SECURITE SOCIALE",
"DIRECTIVE NO 01/2012 OF 2205/2012 ON RESERVES REQUIREMENTS",
"DECLET-LOI DU 22/ AOUT 1974 PORTANT ORGANISATION DE LA SECURITE SOCIALE",
"NATIONAL BANK OF RWANDA DIRECTIVE No 03/2017 OF 30/06/2017 ON THE STANDING LENDING FACILITY",
"MINISTRIAL ORDER NO 05/DC/04 OF 07/06/2004 ON THE GENERAL CONDITIONS AND PRICING PRINCIPLES TO BE RESPECTED IN TERCONNECTION AGREEMENTS",
"ARRET MINISTERIEL NO 1931 BIS/06 DU 8 DECEMBRE 1987 PORTANT DETERMINATION DES MODALITES DE DECLARATION DES MALADIES PROFESSIONNAIRES",
"NATIONAL BANK OF RWANDA DIRECTIVE No 001/2015 OF 09/07/2015 ON THE TREASURY BONDS (T BONDS) REDISCOUNT WINDOWONDS (T-BONDS) REDISCOUNT WINDOW",
"ARRETE MINISTERIEL NO 11/05 DU 22 DECEMBRE 1975 RELATIF AU FINANCEMENT DU FOND DE GARANTIE RELATIF A L'ASSURANCE OBLIGATOIRE  DE LA RESPONSABILITE CIVILE DES VEHICULES AUTOMATEURS",
"NATIONAL BANK OF RWANDA DIRECTIVE No 01/2017 OF 30/06/2017 ON THE OVERNIGHT DEPOSIT FACILITY",
"LAW N°70/2018 OF 31/08/2018 AMENDING LAW N°03/2015 OF 02/03/2015 GOVERNING THE ORGANISATION OF COMMUNITY-BASED HEALTH INSURANCE SCHEME",
"DECRET-LOI NO 10/77 DU 3 FEVRIER 1977 MODIFIANT LE DECRET-LOI DU 22 AOUT 1974 PORTANT ORGANISATION DE LA SECURITE SOCIALE",
"MINISTERIAL ORDER No 001/18/10/TC OF 05/12/2018 DETERMINING MODALITIES OF GRANTING LONG- TERM SAVINGS SCHEME BENEFITS",
"ARRETE PRESIDENTIEL NO 252/11 DU 11 NOVEMBRE 1975 SUR LE CONTROLE PHYTOSANITAIRE DES VEGETEAUX ET PRODUITS VEGETEAUX DESTINES AL'IMPORTATION ET A L'EXPORTATION ET LES CONSTATS DE QUALITE ET D'AVARIE",
"MINISTERIAL ORDER NO 03/DC/04 OF 07/06/2004 ON TELECOMMUNICATION NETWORKS AND SERVICES NOT REQUIRING A TELECOMMUNICATION LICENSE",
"ARRETE MINISTERIEL N° 1156/06   DU 24/6/1988 FIXANT LES MODELES DE FORMULAIRES D'USAGE À LA CAISSE SOCIALE DU RWANDA",
"REGULATION N° 2310/2018 -00018[ 614 ] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA RELATING TO BOUNCING CHEQUES",
"LAW Nº 33/2002 OF 06/11/2002 REGARDING LIVESTOCK IDENTIFICATION",
"MINISTERIAL ORDER Nº18/2012/Minicom OF 27/07/2012 DETERMINING THE MODALITIES OF TRANSFER OF FIVE PERCENT (5 %) OF GROSS ANNUAL INCOME THAT THE ORGAN IN CHARGE OF TOURISM GAINS FROM TOURISM ACTIVITIES TO THE SPECIAL GUARANTEE FUND (SGF)",
"PROTOCOL RELATING TO AN AMENDMENT TO ARTICLE 56 OF THE CONVENTION ON INTERNATIONAL CIVIL AVIATION",
"ARRETE PRESIDENTIEL NO 579/11 DU 06/12/1983 RELATIF A LA PRODUCTION ET AU COMMERECE DE L'OR FEVRERIE",
"PRESIDENTIAL ORDER N° 099/01 OF 18/09/2019 ESTABLISHING SPECIAL STATUTES GOVERNING EMPLOYEES OF RWANDA FOOD AND DRUGS AUTHORITY",
"REGULATIONS N°004/ICT/RURA/2012 OF 7/05/2012 FOR INTERNATIONAL GATEWAY TRAFFIC VERIFICATION SYSTEM",
"REGULATION No20 OF 05/07/2016 MODIFYING AND COMPLEMENTING REGULATION No14 OF 05/08/2013 ON THE REAL ESTATE INVESTMENT TRUSTS",
"PRIME MINISTER’S ORDER N°92/03 OF 07/03/2013 DETERMINING THE MEMBERS OF THE ADVISORY COUNCIL ON THE USE OF AGROCHEMICALS AND THEIR RESPONSIBILITIES",
"REGULATION Nº08 ON CAPITAL MARKETS (FEES), 2012",
"PROTOCOL RELATING TO AN AMENDMENT TO ARTICLE 50(a) OF THE CONVENTION ON INTERNATIONAL CIVIL AVIATION",
"MINISTERIAL INSTRUCTIONS N°23/2015 OF 18/03/2015 MODIFYING AND COMPLEMENTING THE MINISTERIAL INSTRUCTIONS N°21/2013 OF 03/07/2013 DECLARING COMPULSORY RWANDAN STANDARDS",
"MINISTERIAL ORDER N°26 OF 17/03/2016 DETERMINING THE FORM AND CONTENT OF POWER OF ATTORNEY FOR THE INDUSTRIAL PROPERTY",
"MINISTERIAL ORDER No 002/11.30 OF 11/04/2017 DETERMINING THE MODALITIES FOR THE ASSIGNMENT AND TRANSFER OF PLANT BREEDER’S RIGHTS",
"PRIME MINISTER’S ORDER N°131/03 OF 10/05/2016 DETERMINING ANOTHER REGULATORY AUTHORITY FOR TRADE OF PETROLEUM AND PETROLEUM PRODUCTS AND ITS ADDITIONAL RESPONSIBILITIES",
"REGULATION NO 14/2011 ON THE PUBLICATION OF TARIFF OF INTEREST RATES AND FEES APPLIED BY BANKS",
"MINISTERIAL ORDER No 005/11.30 OF 11/04/2017 DETERMINING THE CRITERIA FOR RECOGNIZING A SEED TESTING LABORATORY",
"MINISTERIAL ORDER No 008/11.30 OF 11/04/2017 DETERMINING THE INFORMATION THAT A QUALITY SEED LABEL AND CONTAINER HAS TO BEAR AND THE CRITERIA FOR PUTTING SEED VARIETIES IN CATEGORIES AND THE COLOURS OF LABELS FOR EACH CATEGORY",
"PRIME MINISTER ORDER No198/03 OF 22/09/2015 DETERMINING THE AMOUNT AND PAYMENT MODALITIES OF CONTRIBUTIONS FROM ALL HEALTH INSURANCE ENTITIES OPERATING IN RWANDA",
"REGULATION N° 4230 /2019 - 00024[ 614 ] OF 5/6/2019 OF THE NATIONAL BANK OF RWANDA ON MINIMUM INTERNAL CONTROL AND INTERNAL AUDIT STANDARDS IN BANKS",
"MINISTERIAL ORDER No 007/11.30 OF 11/04/2017 DETERMINING THE REQUIREMENTS FOR A PERSON TO BE GRANTED A LICENSE FOR IMPORTING AND EXPORTING SEEDS",
"MINISTERIAL ORDER N°002/16/10/TC OF 19/04/2016 DETERMINING COMPENSATORY BENEFITS AND CASH VALUE OF BENEFITS IN KIND UNDER MANDATORY PENSION SCHEME",
"MINISTERIAL ORDER N° 002/12/10/TC OF 18/05/2012 DETERMINING THE MODALITIES FOR CONDUCTING INSPECTIONS AND INVESTIGATIONS IN CAPITAL MARKET",
"PRIME MINISTER’S ORDER N° 002/03 OF 14/01/2021 DETERMINING THE RESPONSIBILITIES OF THE AIRPORT SECURITY COMMITTEE, ITS MEMBERS AND FUNCTIONING",
"MINISTERIAL ORDER N°01/10/MINISPOC OF 20/08/2010 DETERMINING THE CONTENT OF THE APPLICATION FOR SUPENSION OF PROCEDURES OF CLEARING GOODS SUSPECTED TO HAVE BEEN PIRATED",
"LAW N° 50/2018 OF 13/08/2018 AMENDING LAW N° 31/2009 OF 26/10/2009 ON THE PROTECTION OF INTELLECTUAL PROPERTY",
"MINISTERIAL ORDER No25 OF 17/03/2016 DETERMINING THE TIMEFRAME PROVIDED FOR GRANTING OF UNILATERAL LICENSE, A COMPULSORY LICENSE AND OPPOSITION TO REGISTRATION OF INTELLECTUAL PROPERTY",
"MINISTERIAL ORDER N°27 OF 27/8/2018 DETERMINING MODALITIES FOR CONCLUDING A CONCESSION AGREEMENT FOR TOURISM INVESTMENT IN PROTECTED AREA",
"REGULATION N° 2310/2018 -00020[ 614 ] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA DETERMINING THE FOREIGN EXCHANGE EXPOSURE LIMITS",
"PRIME MINISTER’S ORDER N°237/03 OF 24/11/2016 ESTABLISHING THE NATIONAL PAYMENT COUNCIL AND DETERMINING ITS STRUCTURE, MISSION AND ITS MODALITIES OF FUNCTIONING",
"REGULATION N° 2310/2018 -00019[ 614 ] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA DETERMINING MODALITIES FOR MANAGEMENT OF DORMANTS AND CLOSED ACCOUNTS",
"MINISTERIAL ORDER N°013/11.30 OF 18/11/2010 ON TRANSPORT AND TRADE OF MEAT",
"MINISTERIAL ORDER No001/19/10/TC OF 14/01/2019 DETERMINING OTHER INCENTIVES FOR THE LONG-TERM SAVINGS SCHEME AND TERMS FOR THEIR ADMINISTRATION",
"PRESIDENTIAL ORDER N°131/01 OF 12/09/2018 DETERMINING RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF NATIONAL AIR TRANSPORT FACILITATION COMMITTEE",
"LAW Nº 024/2024 OF 26/01/2024 AMENDING LAW Nº 007/2019 OF 13/04/2019 ESTABLISHING RWANDA CIVIL AVIATION AUTHORITY",
"REGULATION N°03 ON CAPITAL MARKETS (CROSS BORDER INTRODUCTIONS), 2012",
"MINISTERIAL INSTRUCTIONS No02/07.01/15 OF 05/11/2015 DETERMINING RESPONSIBILITIES OF MEMBERS OF THE MOBILISATION COMMITTEE OF THE COMMUNITY BASED HEALTH INSURANCE SCHEME, THE ORGAN RESPONSIBLE FOR ORGANIZING THEIR ELECTION AND PROCEDURES FOR THE ELECTION",
"MINISTERIAL ORDER No 004/11.30 OF 11/04/2017 DETERMINING THE FORMAT, CONTENT OF THE REGISTER IN WHICH ALL INFORMATION RELATED TO THE PLANT BREEDER’S RIGHTS IS RECORDED AND THE CONDITIONS FOR HAVING ACCESS TO SUCH INFORMATION",
"REGULATION No 48/2022 OF 02/06/2022 ON ADMINISTRATIVE AND PECUNIARY SANCTIONS APPLICABLE TO INSURERS",
"MINISTERIAL ORDER N°24 OF 17/03/2016 DETERMINING FEES PAYABLE FOR REGISTRATION SERVICES OF INTELLECTUAL PROPERTY",
"LAW N° 70/2019 OF 10/01/2020 GOVERNING METROLOGY IN RWANDA",
"INSTRUCTIONS OF THE MINISTER N° 20/0005/19 OF 31/05/2019 ESTABLISHING THE LIST OF UNAUTHORISED DRINKS CONSIDERED AS SIMPLE NARCOTIC DRUGS",
"LAW N° 25/2013 OF 10/05/2013 DETERMINING THE ORGANIZATION AND FUNCTIONING OF BEEKEEPING IN RWANDA",
"MINISTERIAL ORDER Nº18/201 MINICOM2/OF 27/07/2012 DETERMINING THE MODALITIES OF TRANSFER OF FIVE PERCENT (5 %) OF GROSS ANNUAL INCOME THAT THE ORGAN IN CHARGE OF TOURISM GAINS FROM TOURISM ACTIVITIES TO THE SPECIAL GUARANTEE FUND (SGF)",
"REGULATION N°05 ON CAPITAL MARKETS PRINCIPLES, 2012",
"MINISTERIAL ORDER Nº009/16/10/TC OF 01/11/2016 APPOINTING MEMBERS OF THE ADVISORY COMMITTEE OF THE DEPOSIT GUARANTEE FUND FOR BANKS AND MICROFINANCE INSTITUTIONS AND DETERMINING THEIR RESPONSIBILITIES AND TERM OF OFFICE",
"REGULATION No 05/2017 OF 02/03/2017 ON ADMINSTRATIVE AND PECUNIARY SANCTIONS APPLICABLE TO CSD PARTICIPANTS",
"LAW N° 31/2015 OF 05/06/2015 DETERMINING THE ORGANIZATION AND FUNCTIONING OF DEPOSIT GUARANTEE FUND FOR BANKS AND MICROFINANCE INSTITUTIONS",
"INSTRUCTIONS OF THE REGISTRAR GENERAL Nº 001/2021/ORG OF 20/05/2021 RELATING TO REQUIREMENTS FOR REGISTRATION, AMENDMENT AND DEREGISTRATION OF FINANCE LEASE AGREEMENT",
"REGULATION N° 08/2017 OF 19/05/2017 ON PECUNIARY AND ADMINISTRATIVE SANCTIONS APPLICABLE TO PENSION SCHEMES AND PENSION SCHEME SERVICE PROVIDERS",
"AGREEMENT ON TRADE AND ECONOMIC COOPERATION BETWEEN THE GOVERNMENT OF THE REPUBLIC OF TURKEY AND THE GOVERNMENT OF THE REPUBLIC OF RWANDA",
"REGULATION OF THE NATIONAL BANK OF RWANDA No 2100 /2018 - 008[614] OF 25/07/2018 ON REPORTING REQUIREMENTS",
"LAW Nº 12/99 OF 02/07/1999 RELATING TO THE PHARMACEUTICAL ART",
"CONVENTION SUPPLEMENTARY TO THE WARSAW CONVENTION FOR THE UNIFICATION OF CERTAIN RULES RELATING TO INTERNATIONAL CARRIAGE BY AIR PERFORMED BY A PERSON OTHER THAN THE CONTRACTING CARRIER (GUADALAJARA CONVENTION 1961)",
"GUIDELINES N°18 FOR ISSUE OF MUNICIPAL BONDS IN RWANDA",
"PRESIDENTIAL ORDER N° 025/01 OF 12/05/2023 GOVERNING UNIVERSAL ACCESS FUND",
"CONVENTION SUPPLEMENTARY TO THE WARSAW CONVENTION FOR THE UNIFICATION OF CERTAIN RULES RELATING TO INTERNATIONAL CARRIAGE BY AIR PERFORMED BY A PERSON OTHER THAN THE CONTRACTING CARRIER (GUADALAJARA CONVENTION 1961)",
"LAW N°45/2018 OF 13/08/2018 MODIFYING LAW N°01/2011 OF 10/02/2011 REGULATING CAPITAL MARKET IN RWANDA AS MODIFIED TO DATE",
"LAW N° 016/2020 OF 07/09/2020 AMENDING LAW N° 03/2015 OF 02/03/2015 GOVERNING THE ORGANISATION OF THE COMMUNITY-BASED HEALTH INSURANCE SCHEME",
"REGULATION N° 67/2023 OF 14/06/2023 RELATING TO UNDERWRITING OF LARGE RISKS AND MARKET CAPACITY FACILITATION",
"LOI DU 13 MARS RELATIVE AU BOISSONS ALCOOLIQUES",
"INSTRUCTIONS OF THE REGISTRAR GENERAL N° 001/2023/RG OF 31/03/2023 DETERMINING THE THRESHOLD FOR IDENTIFICATION OF THE BENEFICIAL OWNER OF COMPANY AND OF A PARTNERSHIP",
"MINISTERIAL ORDER N⁰009/11.30 OF 18/11/2010 ON STRAY CATTLE AND OTHER DOMESTIC ANIMALS",
"PRESIDENTIAL ORDER N° 054/01 OF 02/08/2023 GOVERNINGS PECIAL GUARANTEE FUND FOR ACCIDENTS AND DAMAGES CAUSED BY AUTOMOBILES AND ANIMAL",
"LAW N°52/2018 OF 13/08/2018 MODIFYING LAW Nº21/2011 OF 23/06/2011 GOVERNING ELECTRICITY IN RWANDA AS MODIFIED TO DATE",
"MINISTERIAL ORDER N° 001/MINICT/22 OF 20/05/2022 DETERMINING RADIO COMMUNICATIONS LICENSE FEES",
"LAW Nº 016/2021 OF 03/03/2021 AMENDING LAW N° 48/2017 OF 23/09/2017 GOVERNING THE NATIONAL BANK OF RWANDA",
"REGULATION NO 001/2016 OF 18/05/2016 CONCERNING OPERATIONS OF THE DEPOSIT GUARANTEE FUND FOR BANKS AND MICROFINANCE INSTITUTIONS",
"MINISTERIAL ORDER No 25 OF 14/09/2016 DETERMINING REQUIREMENTS AND FEES FOR TOURISM ENTITY TO BE GRANTED OPERATING LICENSE",
"LAW Nº 24/2001 OF 27/04/2001 ON ESTABLISHMENT, ORGANIZATION AND FUNCTIONING OF A HEALTH INSURANCE SCHEME FOR GOVERNMENT EMPLOYEES",
"LAW N° 58/2008 OF 10/09/2008 DETERMINING THE ORGANIZATION AND MANAGEMENT OF AQUACULTURE AND FISHING IN RWANDA",
"LAW N°26/2011 OF  27/07/2011 ON COMPENSATION FOR DAMAGES CAUSED BY ANIMALS",
"LAW N° 005/2008 OF 14/02/2008 ON ARBITRATION AND CONCILIATION IN COMMERCIAL MATTERS",
"REGULATION N° 52/2022 OF  01/09/2022 GOVERNING TRUST AND COMPANY SERVICE PROVIDERS",
"PRIME MINISTER’S ORDER N°115/03  OF 02/11/2020 RELATING TO THE NATIONAL AERONAUTICAL SEARCH AND RESCUE COORDINATION COMMITTEE",
"LAW N° 19/2010 OF 09/06/2010 ON THE ORGANIZATION OF THE CRAFT SECTOR",
"MINISTERIAL ORDER N° 003/12/2012 OF  18/05/2012 DETERMINING THE ORGANIZATION AND FUNCTIONING OF THE CAPITAL MARKET INDEPENDENT REVIEW PANEL AND ITS COMPOSITION",
"LAW N° 48/2015 OF 23/11/2015 GOVERNING THE ORGANISATION, FUNCTIONING AND MANAGEMENT OF HEALTH INSURANCE SCHEMES IN RWANDA.",
"CONVENTION  FOR THE UNIFICATION OF CERTAIN RULES RELATING TO INTERNATIONAL CARRIAGE BY AIR",
"LAW N° 21/2011 OF 23/06/2011 GOVERNING ELECTRICITY IN RWANDA",
"MINISTERIAL ORDER NO 009/11.30  OF 11/04/2017 DETERMINING THE REQUIREMENTS FOR A PERSON TO BE AUTHORIZED TO BECOME A QUALITY SEED PRODUCER, CONDITIONER OR DEALER",
"PRIME MINISTER’S ORDER N° 105/03 OF  30/09/2020 RELATED TO THE COMMUNITY-BASED HEALTH INSURANCE SCHEME CONTRIBUTIONS",
"CAPITAL MARKET GUIDELINES N° 11 OF 06/06/2012 ON ISSUANCE OF COMMERCIAL PAPERS",
"LAW N° 29/2017 OF  29/06/2017 ESTABLISHING THE LONG-TERM SAVINGS SCHEME AND DETERMINING ITS ORGANIZATION",
"REGULATION N° 08/2010 OF 27/12/2010 OF THE NATIONAL BANK OF RWANDA ON THE LICENSING REQUIREMENTS FOR PARTICIPANTS IN CENTRAL SECURITIES DEPOSITORY AND THE PROTECTION OF SECURITIES HOLDERS",
"REGULATION N°07/2010  OF 27/12/2010 OF THE NATIONAL BANK OF RWANDA ON ELECTRONIC FUND TRANSFERS AND ELECTRONIC MONEY TRANSACTIONS",
"LAW Nº 001/2023 OF 13/01/2023 GOVERNING NATIONAL PARKS AND  NATURE RESERVES",
"LAW N° 41 BIS/2014 OF  17/01/2015 GOVERNING FINANCE LEASE OPERATIONS IN RWANDA",
"CONVENTION FOR THE UNIFICATION OF CERTAIN RULES RELATING TO THE PRECAUTIONARY ATTACHMENT OF AIRCRAFT",
"MINISTERIAL ORDER NO 006/11.30 OF  11/04/2017 DETERMINING THE PROCEDURES FOR SEED INSPECTION AND GRANTING OF SEED QUALITY CERTIFICATES",
"REGULATION Nº 09/2017 OF  19/05/2017 DETERMINING KEY FACTS STATEMENTS AND DISCLOSURE FOR ACCOUNTS",
"REGULATION NO 78/2023 OF 04/12/2023 DETERMINING ADMINISTRATIVE FAULTS AND SANCTIONS APPLICABLE TO PAYMENT SYSTEM OPERATORS AND PAYMENT SERVICE PROVIDERS",
"REGULATION N° 42/2022  OF  13/04/2022 GOVERNING FOREIGN EXCHANGE OPERATIONS",
"REGULATION N° 37/2021 OF 21/01/2021 ON THE APPLICATION OF PROPORTIONALITY PRINCIPLE TO BANKS",
"REGULATION NO 001/R/CA-MCA/RURA/016 OF 26/07/2016 ON PROMOTION BY TELECOMMUNICATION OPERATOR",
"LAW NO.32BIS/2011  OF 27/07/2011 AUTHORISING THE RATIFICATION OF THE AGREEMENT ON PROMOTION AND PROTECTION OF INVESTMENTS BETWEEN THE REPUBLIC OF RWANDA AND THE REPUBLIC OF SOUTH KOREA SIGNED IN KIGALI ON 29TH MAY 2009",
"INSTRUCTIONS N°001/2013 OF 05/12/2013 DETERMINING THE CODE OF CONDUCT FOR MEMBERS OF GOVERNING ORGANS OF THE CO-OPERATIVE ORGANISATIONS AND THEIR SENIOR EXECUTIVES",
"MINISTERIAL ORDER NO 003/11.30  OF 11/04/2017 DETERMINING THE MODALITIES FOR TESTING THE DISTINCTNESS, UNIFORMITY AND STABILITY OF PLANT VARIETY",
"MINISTERIAL ORDER N°001/11.30  OF  10/12/2014 RELATING TO HYGIENE IN BEEKEEPING AND MODALITIES FOR USE OF TOXIC SUBSTANCES",
"REGULATION N° 56/2022 OF 27/10/2022 ON FINANCIAL SERVICE CONSUMER’S INTERNAL COMPLAINTS HANDLING",
"PRESIDENTIAL ORDER N°21/01 OF 18/10/2016 RATIFYING THE COMMERCIAL AGREEMENT SIGNED IN KIGALI, RWANDA, ON 22/11/2011, BETWEEN THE REPUBLIC OF RWANDA AND THE REPUBLIC OF CONGO",
"REGULATION NO 44/2022  OF 02/06/2022 DETERMINING REQUIREMENTS AND OTHER CONDITIONS FOR ACCREDITATION OF EXTERNAL AUDITORS FOR REGULATED INSTITUTIONS",
"LAW N° 02/2002 OF 17/01/2002 MODIFYING THE LAW DECREE N° 32/75 OF 07/08/1975 RELATING TO THE COMPULSORY CIVIL LIABILITY WITH REGARD TO AUTOMOTIVE VEHICLES",
"REGULATION N° 81/2023 OF 04/12/2023 ON MAJOR INVESTMENTS AND PLACEMENTS OF BANKS",
"REGULATION N° 04 OF 06/06/2012 ON CAPITAL MARKET COMPLAINTS",
"REGULATION N° 2100 /2018 - 00010[614] OF 12/12/2018 OF THE NATIONAL BANK OF RWANDA ON ADMINISTRATIVE SANCTIONS AND FINES APPLICABLE TO BANKS",
"REGULATION OF THE NATIONAL BANK OF RWANDA N° 04/2013 OF 27/08/2013 RELATING TO CHEQUE TRANSACTIO",
"LAW N° 30/2012 OF 01/08/2012 ON GOVERNING THE USE OF AGROCHEMICALS",
"CONVENTION ON THE INTERNATIONAL RECOGNITION OF RIGHTS IN AIRCRAFT",
"LAW N°51/2010 OF 10/01/2010 ESTABLISHING THE KIGALI INTERNATIONAL ARBITRATION CENTRE AND DETERMINING ITS ORGANISATION, FUNCTIONING AND COMPETENCE",
"MINISTERIAL ORDER Nº 01/CAB.M/20 OF 30/12/2020 RELATING TO THE APPEAL COMMITTEE IN CIVIL AVIATION",
"LAW N°13/2016 OF  02/05/2016 GOVERNING PETROLEUM EXPLORATION AND PRODUCTION ACTIVITIES",
"MINISTERIAL ORDER NO 010/11.30 OF  11/04/2017 DETERMINING THE PROCEDURES FOR EVALUATION, CERTIFICATION AND REGISTRATION OF PLANT VARIETIES, PROCEDURES FOR THE WITHDRAWAL OF CERTIFIED PLANT VARIETIES FROM THE LIST AND ITS FORMAT",
"MINISTERIAL INSTRUCTIONS N° 20/7017 OF 31/08/2021 DETERMINING THE METHODOLOGY TO DEFINE THE COMMUNITY-BASED HEALTH INSURANCE BENEFIT PACKAGE",
"REGULATION N° 2310 /2019 – 00023 [614] OF 19/3/2019 OF THE NATIONAL BANK OF RWANDA GOVERNING THE SHAREHOLDING, ACQUISITION AND AMALGAMATION OF BANKS",
"LAW No12ter/2014 OF 19/05/2014 REGULATING THE TOURISM INDUSTRY IN RWANDA",
"LAW N°007/2019 OF 13/04/2019 ESTABLISHING RWANDA CIVIL AVIATION AUTHORITY",
"REGULATION N°13/2017 OF 23/11/2017 ON TRANSACTIONS WITH BANK RELATED PARTIES AND MANAGEMENT OF CREDIT CONCENTRATION RISK",
"REGULATION N° 2310/2018 -00017[ 614] OF  27/12/2018 OF THE NATIONAL BANK OF RWANDA RELATING TO LIQUIDITY REQUIREMENTS FOR BANKS",
"REGULATION No 41/2022 OF 13/04/2022 GOVERNING THE REGULATORY SANDBOX",
"REGULATION No 4230 /2019 - 00025[ 614 ] OF 5/6/2019 OF THE NATIONAL BANK OF RWANDA ON OPENING AND CLOSING A PLACE OF BUSINESS OF A BANK",
"PRIME MINISTER’S ORDER No 04/03 OF 16/01/2015 ESTABLISHING THE UNION OF BEEKEEPERS IN RWANDA AND DETERMINING ITS ORGANIZATION AND FUNCTIONING",
"REGULATION N° 46/2022 OF 02/06/2022 GOVERNING CHANGE IN SHAREHOLDING, AMALGAMATION AND TRANSFER OF PORTFOLIO OF INSURERS AND REINSURERS",
"MINISTERIAL INSTRUCTIONS N° 21/2013 OF 03/07/2013 DECLARING COMPULSORY RWANDAN STANDARDS",
"AGREEMENT FOR THE ESTABLISHMENT OF THE AFRICAN LEGAL SUPPORT FACILITY",
"UNITED NATIONS CONVENTION ON THE RECOGNITION AND ENFORCEMENT OF FOREIGN ARBITRAL AWARDS",
"CAPITAL MARKET REGULATION Nº13 FOR ISSUANCE OF REGIONAL FIXED INCOME SECURITIES",
"REGULATION N° 29/2019 OF 09/09/2019 ON CONSOLIDATED SUPERVISION FOR BANKS",
"PRIME MINISTER’S ORDER N° 027/03 OF 17/11/2022 RELATING TO NATIONAL HEALTH INSURANCE COUNCIL",
"AGREEMENT AMENDING THE FRAMEWORK AGREEMENT ON THE ESTABLISHMENT OF THE INTERNATIONAL SOLAR ALLIANCE (ISA)",
"REGULATION N°13/2011 ON DISCOUNT HOUSE ACTIVITIES",
"MINISTERIAL ORDER N°008/11.30 OF 18/11/2010 DETERMINING THE ORGANIZATION OF VETERINARY PHARMACY PRACTICE",
"REGULATION N° 45/2022 OF 02/06/2022 ON GROUP-WIDE SUPERVISION FOR INSURERS",
"MARRAKESH TREATY TO FACILITATE ACCESS TO PUBLISHED WORKS FOR PERSONS WHO ARE BLIND VISUALLY IMPAIRED, OR OTHERWISE PRINT",
"LAW N° 26/2010 OF 28/05/2010 GOVERNING THE HOLDING AND CIRCULATION OF SECURITIES",
"REGULATION N° 54/2022 OF 01/09/2022 GOVERNING THE ELECTRONIC MONEY ISSUERS",
"LAW N° 58/2018 OF 13/08/2018 ON MINING AND QUARRY OPERATIONS",
"REGULATIONS N° 010/R/TL- TPT/TRANS/RURA/2021 OF 14/12/2021 GOVERNING PUBLIC TRANSPORT BUS SERVICES",
"REGULATION N° 06 ON CAPITAL MARKET ENFORCEMENT GUIDANCE, 2012",
"REGULATION No 80/2023 OF 04/12/2023 ON TRANSACTIONS WITH BANK RELATED PARTY AND MANAGEMENT OF CREDIT CONCENTRATION RISK",
"CONVENTION ESTABLISHING THE ECONOMIC COMMUNITY OF THE GREAT LAKES COUNTRIES (C.E.P.G.L)",
"REGULATION OF THE NATIONAL BANK OF RWANDA No 2100 /2018 - 009[614] OF 25/07/2018 ON RISK MANAGEMENT FOR BANKS",
"REGULATION No 002/R/SAN- EWATSAN/RURA/2017 OF 01/03/2017 GOVERNING THE PROVISION OF SERVICES OF HAZARDOUS WASTE MANAGEMENT",
"CONVENTION AND STATUTE ON FREEDOM OF TRANSIT",
"REGULATION N° 005/R/MR- MCA/RURA/2019 OF 27/06/2019 GOVERNING DIGITAL TERRESTRIAL TELEVISION SERVICES",
"AGREEMENT ON THE ESTABLISHMENT OF THE GLOBAL GREEN GROWTH INSTITUTE",
"REGULATION No 64/2023 OF 25/04/2023 ON MONEY REMITTANCE SERVICES",
"REGULATION No 62/2023 OF 27/03/2023 GOVERNING ADMINISTRATIVE AND PECUNIARY SANCTIONS APPLICABLE TO DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"REGULATION N°22 OF 05/07/2016 GOVERNING LICENSEES’ FINANCIAL REPORTING",
"LAW Nº 017/2021 OF 03/03/2021 RELATING TO FINANCIAL SERVICE CONSUMER PROTECTION",
"MINISTERIAL ORDER Nº 001/11.30 OF 11/12/2020 REGULATING AQUACULTURE AND FISHERIES",
"THE CAPITAL MARKET CORPORATE GOVERNANCE CODE N° 09, 2012",
"LAW N° 036/2022 OF 09/12/2022 ESTABLISHING THE ORGAN OF MILITARY MEDICAL INSURANCE",
"PROTOCOL ON THIRD PARTY MOTOR VEHICLE INSURANCE SCHEME",
"MINISTERIAL ORDER N° 001/MINICOM/23 OF 05/10/2023 RELATING TO INSOLVENCY PRACTITIONERS",
"REGULATION N°15 FOR ISSUANCE OF CAPITAL MARKET DEBT SECURITIES",
"LAW N° 03/2015 OF 02/03/2015 GOVERNING THE ORGANISATION OF THE COMMUNITY-BASED HEALTH INSURANCE SCHEME",
"REGULATION N° 53/2022 OF 01/09/2022 ESTABLISHING OPERATIONAL REQUIREMENTS AND OTHER REQUIREMENTS FOR PENSION SCHEMES AND LONG TERM SAVING SCHEME",
"LAW LAW N° 018/2023 OF 30/03/2023 AMENDING LAW Nᵒ 008/2021 OF 16/02/2021 GOVERNING PARTNERSHIPS AMENDING LAW Nᵒ 008/2021 OF 16/02/2021 GOVERNING PARTNERSHIPS",
"LAW No47/2012 OF 14/01/2013 RELATING TO THE REGULATION AND INSPECTION OF FOOD AND PHARMACEUTICAL PRODUCTS",
"REGULATION N°12/2017 OF 23/11/2017 ON CREDIT CLASSIFICATION AND PROVISIONING",
"LAW N°005/2016 OF 05/04/2016 GOVERNING SEEDS AND PLANT VARIETIES IN RWANDA",
"GUIDELINES No21 OF 05/07/2016 GOVERNING THE DEVELOPMENT OF REAL ESTATE INVESTMENT TRUST",
"REGULATION No 82/2023 OF 04/12/2023 GOVERNING REINSURANCE AND OTHER FORMS OF RISK TRANSFER",
"REGULATIONS No23 OF 05/07/2016 RELATING TO THE REGISTRATION OF CREDIT RATING AGENCIES IN RWANDA",
"REGULATION No 59/2023 OF 27/03/2023 DETERMINING CREDIT CLASSIFICATION AND PROVISIONING RULES FOR DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"CONSTITUTION OF THE WEST AFRICA RICE DEVELOPMENT ASSOCIATION (WARDA)",
"CONVENTION ON THE CREATION AND STATUS OF THE AFRICAN FUND FOR GUARANTEE AND ECONOMIC COOPERATION (FAGACE)",
"REGULATION N° 33/2020 OF 08/06/2020 GOVERNING MORTGAGE REFINANCE COMPANIES",
"REGULATION No 50 /2022 OF 02/062022 ON CYBER SECURITY IN REGULATED INSTITUTIONS",
"PRESIDENTIAL ORDER Nº 58/01 OF 20/05/2019 RATIFYING THE AGREEMENT BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE GOVERNMENT OF THE KINGDOM OF MOROCCO ON THE RECIPROCAL PROMOTION AND PROTECTION OF INVESTMENTS, SIGNED AT KIGALI, RWANDA ON 19 OCTOBER 2016",
"REGULATION No 77/2023 OF 04/12/2023 ON PROVISION OF PAYMENT INITIATION, PAYMENT AGGREGATION, MERCHANT ACQUIRING AND PAYMENT ACCOUNTS INFORMATION SERVICES",
"REGULATION N° 27/2019 OF 09/09/2019 RELATING TO CREDIT REPORTING SYSTEM",
"INTERNATIONAL FINANCE CORPORATION ARTICLES OF AGREEMENT",
"CONSTITUTION OF THE UNIVERSAL POSTAL UNION (UPU)",
"REGULATION N° 36/2021 OF 21/1/2021 GOVERNING FINANCIAL HOLDING COMPANIES",
"LAW Nº 057/2021 BIS OF 18/09/2021 ESTABLISHING THE CAPITAL MARKET AUTHORITY OF RWANDA",
"REGULATION No 60/2023 OF 27/03/2023 DETERMINING PRUDENTIAL NORMS FOR DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"LAW N°58/2011 OF 31/12/2011 GOVERNING THE GAMING ACTIVITIES",
"CONVENTION ON THE SETTLEMENT OF INVESTMENT DISPUTES BETWEEN STATES AND NATIONALS OF OTHER STATES",
"LAW N° 009/2021 OF 16/02/2021 ESTABLISHING RWANDA SOCIAL SECURITY BOARD",
"REGULATION N° 2310/2018 - 00013[ 614 ] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA ON LICENSING CONDITIONS OF BANKS",
"CONVENTION ON TRANSIT TRADE OF LAND-LOCKED STATES",
"AGREEMENT ESTABLISHING THE INTERNATIONAL FUND FOR AGRICULTURAL DEVELOPMENT",
"REGULATIONS N° 012/R/STDICT/ RURA/2021 OF 14/12/2021 GOVERNING IMPORTATION, SUPPLY AND TYPE APPROVAL OF ELECTRONIC COMMUNICATIONS EQUIPMENTportation, supply of electronic communications equipment, Reg no 012 of 2021",
"LAW Nº 85/2013 OF 11/9/2013 REGULATING PETROLEUM AND PETROLEUM PRODUCTS TRADE IN RWANDA",
"REGULATION N° 04/2017 OF 02/03/2017 ON THE OPERATIONS OF THE CENTRAL SECURITIES DEPOSITORY",
"LAW Nº 003/2018 OF 09/02/2018 ESTABLISHING RWANDA FOOD AND DRUGS AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"MINISTERIAL ORDER N°01/MOS/Trans/2018 OF 23/01/2018 ESTABLISHING REGULATIONS RELATING TO UNMANNED CIVIL AIRCRAFT SYSTEM",
"REGULATION N°003/R/GP- EWATSAN/RURA/2017 OF 04/09/2017 GOVERNING THE INSTALLATION, UPGRADE AND OPERATION OF PETROL SERVICE STATIONS IN RWANDA",
"UNITED NATIONS CONVENTION ON INTERNATIONAL MULTIMODAL TRANSPORT OF GOODS",
"LAW Nº36/2012 OF 21/09/2012 RELATING TO COMPETITION AND CONSUMER PROTECTION",
"UNITED NATIONS CONVENTION ON THE CARRIAGE OF GOODS BY SEA, 1978 (HAMBURG RULES)",
"REGULATION N° 2310/2018 -00016[ 614 ] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA RELATING TO CAPITAL REQUIREMENTS FOR BANKS",
"REGULATION N°70/2023 OF 14/06/2023 RELATING TO PROCEDURES APPLICABLE TO EXIT FROM THE MARKET AND RESOLUTION OF AN INSURER",
"LAW Nº 73/2018 OF 31/08/2018 GOVERNING CREDIT REPORTING SYSTEM",
"INTERNATIONAL COFFEE AGREEMENT 2007",
"PROTOCOL TO THE TREATY ESTABLISHING THE AFRICAN ECONOMIC COMMUNITY RELATING TO THE PAN- AFRICAN PARLIAMENT",
"PRESIDENTIAL ORDER Nº 57/01 OF 20/05/2019 RATIFYING THE AGREEMENT BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE GOVERNMENT OF THE REPUBLIC OF DJIBOUTI CONCERNING THE RECIPROCAL PROMOTION AND PROTECTION OF INVESTMENTS, SIGNED AT DJIBOUTI ON 18 APRIL 2017",
"REGULATION N° 47/2022 OF 02/06/2022 ON PUBLICATION OF FINANCIAL STATEMENTS AND OTHER DISCLOSURES BY INSURERS",
"AGREEMENT RELATING TO THE INTERNATIONAL TELECOMMUNICATIONS SATELLITE ORGANIZATION",
"CONVENTION OF THE AFRICAN ENERGY COMMISSION",
"EAST AFRICAN COMMUNITY PROTOCOL ON THE ESTABLISHMENT OF THE EAST AFRICAN COMMUNITY MONETARY UNION",
"MINISTERIAL ORDER No 002/11.30 OF 14/07/2016 DETERMINING REGULATIONS GOVERNING AGROCHEMICALS",
"AFRICAN MARITIME TRANSPORT CHARTER",
"AGREEMENT BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND THE GOVERNMENT OF THE RUSSIAN FEDERATION, ON COOPERATION IN THE CONSTRUCTION OF THE CENTER OF NUCLEAR SCIENCE AND TECHNOLOGY ON THE TERRITORY OF THE REPUBLIC OF RWANDA",
"CAPITAL MARKETS (TAKEOVERS) REGULATIONS N°10, 2012",
"LAW N° 063/2021 OF 14/10/2021 GOVERNING TRUSTS",
"LAW Nº 54/2008 OF 10/09/2008 DETERMINING THE PREVENTION AND FIGHT AGAINST CONTAGIOUS DISEASES FOR DOMESTIC ANIMALS IN RWANDA",
"MINISTERIAL ORDER No16/012 OF 15/05/2012 DETERMINING ARBITRATION RULES OF KIGALI INTERNATIONAL ARBITRATION CENTER (KIAC)",
"LAW N°48/2017 OF 23/09/2017 GOVERNING THE NATIONAL BANK OF RWANDA",
"PRESIDENTIAL ORDER No 144/01 OF 27/12/2019 RATIFYING THE AGREEMENT BETWEEN THE REPUBLIC OF RWANDA AND THE UNITED ARAB EMIRATES ON THE PROMOTION AND RECIPROCAL PROTECTION OF INVESTMENTS, DONE AT DUBAI, ON 01/11/2017",
"PRESIDENTIAL ORDER Nº003/01 OF 04/05/2016 RATIFYING THE AGREEMENT SIGNED IN LONDON, UNITED KINGDOM ON 26 JUNE 2015, BETWEEN THE REPUBLIC OF RWANDA AND JERSEY, FOR THE AVOIDANCE OF DOUBLE TAXATION AND THE PREVENTION OF FISCAL EVASION WITH RESPECT TO TAXES ON INCOME",
"REGULATION No 75/2023 OF 18/09/2023 RELATING TO DESIGNATION OF PAYMENT SYSTEMS",
"REGULATION N ̊ 001/LPG/R/GP-EWS /RURA/2018 OF 10/01/2018 GOVERNING LIQUEFIED PETROLEUM GAS BUSINESS IN RWANDA",
"AGREEMENT ESTABLISHING THE COLLABORATIVE AFRICA BUDGET REFORM INITIATIVE",
"AGREEMENT ESTABLISHING THE WORLD TRADE ORGANIZATION",
"REGULATION Nº01 ON CAPITAL MARKETS (LICENSING REQUIREMENTS), 2012",
"REGULATION No 61/2023 OF 27/03/2023 ESTABLISHING RISK MANAGEMENT FRAMEWORK FOR DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"PROTOCOL TO THE TREATY ESTABLISHING THE AFRICAN ECONOMIC COMMUNITY RELATING TO FREE MOVEMENT OF PERSONS, RIGHT OF RESIDENCE AND RIGHT OF ESTABLISHMENT",
"LAW Nº 061/2021 OF 14/10/2021 GOVERNING THE PAYMENT SYSTEM",
"AGREEMENT  BETWEEN THE REPUBLIC OF RWANDA AND THE REPUBLIC OF MAURITIUS FOR THE AVOIDANCE OF DOUBLE TAXATION AND PREVENTION OF FISCAL EVASION WITH RESPECT TO TAXES ON INCOME",
"PROTOCOL TO THE TREATY ESTABLISHING THE AFRICAN ECONOMIC COMMUNITY RELATING TO FREE MOVEMENT OF PERSONS, RIGHT OF RESIDENCE AND RIGHT OF ESTABLISHMENT",
"STATUTES OF THE INTERNATIONAL RENEWABLE ENERGY AGENCY",
"REGULATION N° 08/2016 OF 01/12/2016 GOVERNING THE ELECTRONIC MONEY ISSUERS",
"REGULATION N° 49/2022 OF 02/06/2022 ON OUTSOURCING",
"REGULATION No 58/2023 OF 27/03/2023 ESTABLISHING REQUIREMENTS ON CORPORATE GOVERNANCE FOR DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"LAW N°01/2011 OF 10/02/2011 REGULATING CAPITAL MARKET IN RWANDA",
"REGULATION N° 73/2023 OF 18/09/2023 GOVERNING THE AGENT MANAGEMENT",
"CONVENTION ESTABLISHING THE WORLD INTELLECTUAL PROPERTY ORGANIZATION",
"CONVENTION ON DAMAGE CAUSED BY FOREIGN AIRCRAFT TO THIRD PARTIES ON THE SURFACE",
"LAW Nº 060/2021 OF 14/10/2021 GOVERNING NEGOTIABLE INSTRUMENTS",
"REGULATION N° 01/2018 OF 24/01/2018 ON CORPORATE GOVERNANCE FOR BANKS",
"LAW Nº 059/2021 OF 14/10/2021 GOVERNING FOUNDATIONS",
"GUIDELINES N° 002/CMA G/2023 OF 27/04/2023 GOVERNING THE FINTECH REGULATORY SANDBOX FOR CAPITAL MARKETS IN RWANDA",
"LAW N° 062/2021 OF 14/10/2021 GOVERNING COLLECTIVE INVESTMENT SCHEMES",
"BASIC TEXT OF THE FOOD AND AGRICULTURE ORGANIZATION OF THE UNITED NATIONS",
"AGREEMENT ESTABLISHING THE COMMON FUND FOR COMMODITIES",
"LAW N° 006/202OF 05/02/2021 ON INVESTMENT PROMOTION AND FACILITATION",
"REGULATION Nº02 ON CAPITAL MARKET CONDUCT OF BUSINESS, 2012",
"REGULATION Nº14 ON REAL ESTATE INVESTMENT TRUSTS",
"REGULATIONS OF THE CHIEF EXECUTIVE OFFICER N° 003/MINES/RMB/2019 OF 18/07/2019 DETERMINING THE CONTENT OF MINERAL PROCESSING AND TRADING LICENCES AND MODALITIES OF THEIR GRANTING",
"LAW Nº 072/2021 OF 05/11/2021 GOVERNING DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"REGULATION N° 55/2022 OF 27/10/2022 RELATING TO FINANCIAL SERVICE CONSUMER PROTECTION",
"MADRID AGREEMENT CONCERNING THE INTERNATIONAL REGISTRATION OF MARKS OF APRIL 14, 1891, AS AMENDED AT STOCKHOLM ON SEPTEMBER 28, 1979",
"REGULATION No 71/2023 OF 14/06/2023 GOVERNING THE ORGANISATION OF MICRO-INSURANCE BUSINESS",
"LAW N° 019/2023 OF 30/03/2023 AMENDING LAW N° 007/2021 OF 05/02/2021 GOVERNING COMPANIES",
"REGULATION No 39/2021 OF 07/10/2021 GOVERNING THE ACCREDITATION AND OTHER REQUIREMENTS FOR APPOINTED ACTUARIES FOR INSURANCE BUSINESS AND PENSION SCHEMES",
"REGULATION N°2310/2018 - 00015 [614] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA GOVERNING FOREIGN EXCHANGE BUREAUS",
"PROTOCOL ON THE ESTABLISHMENT OF THE EAST AFRICAN COMMUNITY COMMON MARKET",
"CONVENTION ESTABLISHING THE MULTILATERAL INVESTMENT GUARANTEE AGENCY",
"REGULATION Nº07 ON CAPITAL MARKETS (PUBLIC OFFER AND ISSUE OF SECURITIES), 2012",
"LAW N° 05/2015 OF 30/03/2015 GOVERNING THE ORGANIZATION OF PENSION SCHEMES",
"REGULATION N° 74/2023 OF 18/09/2023 OF GOVERNING PAYMENT SERVICES PROVIDERS",
"TREATY BETWEEN THE GOVERNMENT OF THE UNITED STATES OF AMERICA AND THE GOVERNMENT OF THE REPUBLIC OF RWANDA CONCERNING THE ENCOURAGEMENT AND RECIPROCAL PROTECTION OF INVESTMENT",
"AGREEMENT ON TRADE-RELATED ASPECTS OF INTELLECTUAL PROPERTY RIGHTS",
"LAW N°20/2018 OF 29/04/2018 ESTABLISHING REGULATIONS GOVERNING CIVIL AVIATION",
"LAW N°58/2017 OF 21/1/2018 REGULATING THE WAREHOUSE RECEIPT SYSTEM",
"REGULATION Nº 11/2017 OF 23/11/2017 ON CORPORATE GOVERNANCE, RISK MANAGEMENT AND INTERNAL CONTROLS REQUIREMENTS FOR INSURANCE BUSINESS",
"WAKOPMUND PROTOCOL ON THE PROTECTION OF TRADITIONAL KNOWLEDGE AND EXPRESSIONS OF FOLKLORE WITHIN THE FRAMEWORK OF THE AFRICAN REGIONAL INTELLECTUAL PROPERTY ORGANIZATION (ARIPO)",
"PATENT COOPERATION TREATY (PCT)",
"LAW Nº 47/2017 OF 23/9/2017 GOVERNING THE ORGANISATION OF BANKING",
"REVISED TREATY ESTABLISHING THE ECONOMIC COMMUNITY OF CENTRAL AFRICAN STATES",
"REATY AMENDING AND RE-ENACTING THE CHARTER OF THE EAST AFRICAN DEVELOPMENT BANK",
"REGULATION No 65/04/2023 OF 25/04/2023 GOVERNING NON-DEPOSIT TAKING FINANCIAL SERVICES PROVIDERS",
"CHICAGO CONVENTION ON INTERNATIONAL CIVIL AVIATION (1944)",
"LAW N° 28/2017 OF 29/06/2017 REGULATING COMMODITY EXCHANGE AND RELATED CONTRACTS",
"AGREEMENT ESTABLISHING INTERNATIONAL BANK FOR RECONSTRUCTION AND DEVELOPMENT",
"LAW N° 0082021 OF 16/02/2021 GOVERNING PARTNERSHIPS",
"UNITED NATIONS CONVENTION ON CONTRACTS FOR THE INTERNATIONAL SALE OF GOODS",
"LAW N° 024/2021 OF 27/04/2021  GOVERNING COOPERATIVES IN RWANDA",
"REGULATIONS Nº 001/CMA/2024 OF 26/02/2024 GOVERNING LEVERAGED FOREIGN EXCHANGE TRADING IN RWANDA",
"AGREEMENT ESTABLISHING THE AFRICAN TRADE INSURANCE AGENCY",
"LAW N° 030/2021 OF 30/06/2021 GOVERNING THE ORGANISATION OF INSURANCE BUSINESS",
"AGREEMENT FOR THE ESTABLISHMENT OF THE AFRICAN EXPORT-IMPORT BANK",
"REGULATION N° 79/2023 OF 04/12/2023 ON PROTECTION OF PAYMENT SERVICES USERS",
"AMENDMENTS OF ARTICLES OF AGREEMENT OF THE INTERNATIONAL MONETARY FUND",
"TREATY ESTABLISHING THE AFRICAN ECONOMIC COMMUNITY",
"LAW N°24/2016 OF 18/06/2016 GOVERNING INFORMATION AND COMMUNICATION TECHNOLOGIES",
"NORTHERN CORRIDOR TRANSIT AND TRANSPORT AGREEMENT",
"REGULATION N° 66/2023 OF 25/04/2023 ON LICENSING CONDITIONS FOR INSURERS AND REINSURERS",
"AGREEMENT ESTABLISHING THE AFRICAN CONTINENTAL FREE TRADE AREA",
"LAW N° 31/2009 OF 26/10/2009 ON THE PROTECTION OF INTELLECTUAL PROPERTY",
"BERNE CONVENTION FOR THE PROTECTION OF LITERARY AND ARTISTIC WORKS",
"LAW N° 007/2021 OF 05/02/2021   GOVERNING COMPANIES",
"THE HAGUE AGREEMENT OF 6 NOVEMBER 1925 CONCERNING THE INTERNATIONAL REGISTRATION OF INDUSTRIAL DESIGNS",
"LAW N° 075/2021 OF 06/12/2021 RELATING TO INSOLVENCY",
"REGULATION N° 68/2023 OF 14/06/2023 GOVERNING THE INVESTMENT OF INSURERS AND REINSURERS",
"TREATY ESTABLISHING THE COMMON MARKET FOR EASTERN AND SOUTHERN AFRICA",
"REGULATION No 43/2022 OF 02/06/2022 GOVERNING BUSINESS CONTINUITY MANAGEMENT AND OPERATIONAL RESILIENCE FOR REGULATED INSTITUTIONS",
"CONSTITUTION OF THE UNITED NATIONS INDUSTRIAL DEVELOPMENT ORGANIZATION",
"REGULATION N° 40/2021 OF 07/10/2021 GOVERNING THE REGISTRATION OF PENSION SCHEMES AND LICENSING OF SERVICE PROVIDERS",
"MINISTERIAL ORDER N°26 OF 14/09/2016 DETERMINING THE STANDARDS FOR THE GRADING OF TOURISM ENTITIES",
"MINISTERIAL ORDER No 04/CAB.M/018 OF 24/07/2018 ESTABLISHING CIVIL AVIATION REGULATIONS",
"MINISTERIAL ORDER No 01/CAB.M/019 OF 06/02/2019 AMENDING MINISTERIAL ORDER Nº 04/CAB.M/08 OF 24/07/2018 ESTABLISHING CIVIL AVIATION REGULATIONS",
"LOI DU 11 DECEMBRE 1962 DETERMINANT L’HYMNE NATIONAL RWANDAIS",
"LOI DU 8 SEPTEMBRE 1966 PORTANT DETERMINATION DE LA CAPITALE DU RWANDA",
"REVISION CONSTITUTIONELLE DU 12 JUIN 1963",
"DECRET-LOI DU 1 AOUT1973 PORTANT REVISION DES ARTICLES 47 ET 48 DE LA CONSTITUTION",
"ARRETE MINISTERIEL NO 04/09 DU 1 OCTOBRE 1967 PORTANT MESURES DE LA LOI CREANT CAPITALE DU RWANDA",
"LOI NO 30/90 DU 28 MAI 1990 PORTANT MODIFICATION DE LA LOI DU 8 SEPTEMBRE 1966 PORTANT DETERMINATION DE LA CAPITALE DU RWANDA",
"ORDONNANCE-LOI DU 26 JUIN 1965 PORTANT DETERMINATION DE LA CAPITALE DU RWANDA",
"LOI DU 23 JUILLET 1965 FIXANT LE NOMBRE DES DEPUTES A L’ASSEMBLEE NATIONALE",
"REVISION DU 22/8/1996  DE LA LOI FONDAMENTALE",
"LOI DU 18 MAI 1973 PORTANT REVISION DE LA CONSTIFUTION DE LA REPUBLIQUE RWANDAISE",
"AMENDMENT OF 18/04/2000 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"LOI FONDAMENTALE DE LA REPUBLIQUE RWANDAISE",
"AMENDMENT OF 19/04/2000 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"AMENDMENT OF THE 31/12/2001 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"LOI DU 15 AVRIL 1963 SUR L’ORGANISATION TERRITORIALE DE LA REPUBLIQUE",
"LAW Nº 06/99 OF 28/3/1999 MODIFYING LAW NO 35/87 OF 17 SEPTEMBER 1987 ON THE SEAL’S CUSTODY",
"CONSTITUTION DE LA REPUBLIQUE RWANDAISE  DU 24 NOVEMBRE 1962",
"LAW Nº 58/2001 OF 31/12/2001 AMENDING AND COMPLEMENTING THE LAW NO 35/1987 OF SEPTEMBER 17, 1987 GOVERNING THE PROTECTION OF EMBLEMS",
"AMENDMENT OF 10/11/2000 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"CONSTITUTION DE LA REPUBLIQUE  RWANDAISE",
"ORGANIC LAW  Nº 03/2005 OF 25/02/2005 DETERMINING THE METHODS THE PARLIAMENT USES TP OBTAIN INFORMATION AND EXERCISES OVERSIGHT OF THE GOVERNMENT ACTION",
"LOI NO 28/91 DU 18 JUIN 1991 SUR LES PARTIS POLITIQUES",
"Amendment n° 02 of 08/12/2005 of the Constitution of the Republic of Rwanda of June 4, 2003 as amended to",
"Amendment of 13/8/2008 of the Constitution of the Republic of Rwanda of 4 June 2003 as amended to date",
"LOI NO 35/1987 DU 17 SEPTEMBRE 1987 ORGANISANT LA GARDE DES SCEAUX",
"CONSTITUTION DE LA REPUBLIQUE DU RWANDAISE",
"LOI NO 29/90 DU 28 MAI 1990 MODIFIANT ET COMPLETANT LA LOI DU 14 AVRIL 1963 SR L’ORGANISATION TERRITORIALES DE LA REPUBLIQUE",
"LAW N°15/2012 OF 03/05/2012 RELATING TO ELECTION PROCEDURES FOR RWANDA MEMBERS OF THE EAST AFRICAN LEGISLATIVE ASSEMBLY",
"DECRET-LOI NO 27/81 DU 30 OCTOBRE 1981 FIXANT LE NOMBRE DES DEPUTES AU CONSEIL NATIONAL DE DEVELOPPEMENT",
"IVUGURURWA RYO KU WA 13/7/1999 RY’ITEGEKO SHINGIRO RYA REPUBULIKA Y’U RWANDA",
"ORGANIC LAW N°02/2012/OL OF 03/05/2012 REPEALING ORGANIC LAW N°12/2008 OF 09/05/2008 RELATING TO ELECTION PROCEDURES OF RWANDAN REPRESENTATIVES TO THE EAST AFRICAN LEGISLATIVE ASSEMBLY (EALA)",
"REVISION DU 18/1/1996 DE LA LOI FONDAMENTALE",
"AMENDMENT OF 30/01/2003 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"CONSTITUTION DE LA REPUBLIQUE RWANDAISE",
"LAW N°44/2016 OF 18/10/2016 MODIFYING AND COMPLEMENTING LAW N°15/2012 OF 03/05/2012 RELATING TO ELECTION PROCEDURES FOR RWANDAN MEMBERS OF THE EAST AFRICAN LEGISLATIVE ASSEMBLY",
"THE CONSTITUTION OF THE REPUBLIC OF RWANDA OF 2003 REVISED IN 2015",
"LAW Nº 10/2003 OF 18/04/2003 GOVERNING THE ORGANISATION OF THE REFERENDUM OF THE CONSTITUTION",
"LAW Nº 01/97 OF 4.2.1997, AMENDING AND COMPLETING THE LAW OF APRIL  15, 1963 AS AMENDED AND COMPLETED BY THE LAW NO 29/90 OF MAY 28, 1990, RELATING TO THE TERRITORIAL ORGANIZATION OF THE REPUBLIC OF RWANDA",
"ORGANIC LAW N°08/2012/OL OF 02/11/2012 ESTABLISHING INTERNAL RULES OF THE SENATE",
"AMENDMENT NO 1 OF 02/12/2003, OF THE CONSTITUTION OF THE REPUBLIC OF RWANDA  OF JUNE 4, 2003",
"ORGANIC LAW Nº 29/2005 OF 31/12/2005 DETERMINING ADMINISTRATIVE ENTITIES OF THE REPUBLIC OF RWANDA",
"LAW Nº 47/2000 OF 19/12/2000 AMENDING THE LAW OF APRIL 15, 1963CONCERNING THE ADMINISTRATION OF THE REPUBLIC OF RWANDA AS MODIFIED AND COMPLETED TO DATE",
"PRESIDENTIAL ORDER NO 155/01 OF 31/12/2002 ON STATUTES GOVERNING NATIONAL POLICE",
"LAW Nº 25/2004 OF 19/11/2004 ESTABLISHING AND DETERMINING THE ORGANISATION AND FUNCTIONNING OF THE LOCAL SERVICE IN CHARGE OF ASSITING IN MAINTENANCE OF SECURITY REFERRED TO AS ‘’LOCAL DEFENCE’’",
"DECRET-LOI DU 23 JANVIER 1974 PORTANT CREATION DE LA GENDARMERIE",
"LAW N° 48/2008 OF 09/09/2008 RELATING TO THE INTERCEPTION OF COMMUNICATIONS",
"MINISTERIAL ORDER n° 006/08/10/MIN OF 14/11/2007 DETERMINING THE SUBSISTENCE ALLOWANCE ENTITLED TO NEEDY DISABLED FORMER WAR COMBATANT",
"AMABWIRIZA YA MINISITIRI NO 01/07.01/2015 YO KU WA 29/05/2015 AGENGA IMYITWARIRE N’IMYIFATIRE Y’ABAGIZE URWEGO RWUNGANIRA UBUYOBOZI BW’AKARERE MU GUCUNGA UMUTEKANO",
"DECRET-LOI NO 12/79 DU 7 MAI 1979 SUR LE REGIME DES ARMES A FEU ET DE LEURS MUNITIONS",
"LAW N°31/2014 OF 19/08/2014 GOVERNING PRIVATE SECURITY SERVICES PROVIDERS",
"LAW N°46/2010 OF 14/12/2010 DETERMINING THE POWERS, RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING OF THE RWANDA NATIONAL POLICE",
"LAW N°33/2009 OF 18/11/2009 RELATING TO ARMS",
"PRESIDENTIAL ORDER Nº 101/01 OF 18/06/2014 ESTABLISHING THE SPECIAL STATUTES FOR THE DISTRICT ADMINISTRATION SECURITY SUPPORT ORGAN",
"LAW N° 74/2019 OF 29/01/2020 ESTABLISHING THE FINANCIAL INTELLIGENCE CENTRE",
"LAW Nº 23/2003 OF 07/08/2003 AIMS AT PREVENTION, SUPPRESSION AND PUNISHMENT OF CORRUPTION AND RELATED OFFENCES",
"DECRET-LOI No 21/77 DU 18 AOUT 1977 INSTITUANT LE CODE PENAL",
"MINISTERIAL ORDER N° 013/MOJ/AG/21 OF 29/08/2021 PROVIDING FOR OTHER PARTICULAR MEANS FOR SUPPORTING THE VICTIM OF CRIME OF TRAFFICKING IN PERSONS",
"LAW N° 35/2012 OF 19/09/2012 RELATING TO THE PROTECTION OF WHISTLE- BLOWERS",
"LOI N° 33 bis/2003 DU 06/09/2003 REPRIMANT LE CRIME DE GENOCIDE, LES CRIMES CONTRE L’ HUMANITE ET LES CRIMES DE GUERRE",
"PRIME MINISTER’S ORDER N° 019/03 OF 29/08/2021 DETERMINING THE ORGAN RESPONSIBLE FOR PROVIDING NECESSARY MEANS FOR REPATRIATION OF THE VICTIM OF CRIME OF TRAFFICKING IN PERSONS",
"REGULATIONS N° 002/FIC/2021 OF 26/08/2021 RELATING TO THE DECLARATION OF CROSS BORDER CASH OR BEARER NEGOTIABLE INSTRUMENTS",
"LAW Nº 51/2018 OF 13/08/2018 RELATING TO THE PREVENTION, SUPPRESSION AND PUNISHMENT OF TRAFFICKING IN PERSONS AND EXPLOITATION OF OTHERS",
"LAW Nº 75/2019 OF 29/01/2020 ON PREVENTION AND PUNISHMENT OF MONEY LAUNDERING, FINANCING OF TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION",
"LAW N°18/2008 OF 23/07/2008 RELATING TO THE PUNISHMENT OF THE CRIME OF GENOCIDE IDEOLOGY",
"LAW Nº 75/2019 OF 29/01/2020 ON PREVENTION AND PUNISHMENT OF MONEY LAUNDERING, FINANCING OF TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION",
"REGULATION No 63/2023 OF 25/04/2023 DETERMINING ADMINISTRATIVE SANCTIONS APPLICABLE TO REGULATED INSTITUTION FOR NON COMPLIANCE WITH THE PREVENTION MONEY LAUNDERING, FINANCING TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION REQUIREMENTS",
"LAW Nº 45/2008 OF 09/09/2008 ON COUNTER TERRORISM",
"MINISTERIAL ORDER Nº 004/Mininter/11 OF 06/12/2011 DETERMINING THE PROCEDURES FOR SUSPENSION OF A TERRORIST ORGANISATION AND MODALITIES FOR APPEAL AGAINST SUCH DECISION",
"LAW Nº 038/2021 OF 28/07/2021 AMENDING LAW Nº 75/2019 OF 29/01/2020 ON PREVENTION AND PUNISHMENT OF MONEY LAUNDERING, FINANCING OF TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION",
"LOI NO 08/1983 DU 10 MARS 1983 MODIFIANT ET COMPLETANT LE CHAPITRE PREMIER DU TITLE III DU LIVRE II DU CODE PENAL",
"ORGANIC LAW N° 01/2012/OL OF 02/05/2012 INSTITUTING THE PENAL CODE",
"LAW N°47/2008 OF 09/09/2008 ON PREVENTION AND PENALISING THE CRIME OF MONEY LAUNDERING AND FINANCING TERRORISM",
"LAW N° 69/2013 OF 02/09/2013 ON EXTRADITION",
"LAW N° 84/2013 OF 11/09/2013 ON THE CRIME OF GENOCIDE IDEOLOGY AND OTHER RELATED OFFENCES",
"ORGANIC LAW  Nº 03/2004 OF 20/03/2004 DETERMINING THE ORGANISATION, POWERS, AND FUNCTIONNING OF THE PROSECUTION SERVICE",
"PRESIDENTIAL ORDER NO 43/1 OF 10/11/2007 ESTABLISHING PRISONS AND THEIR MODE OF CONSTRUCTIONS",
"LAW No61/2016 OF 11/01/2017 MODIFYING AND COMPLEMENTING LAW N°10/2013 OF 08/03/2013 GOVERNING THE STATUTES OF JUDGES AND JUDICIAL PERSONNEL AS MODIFIED AND COMPLEMENTED TO DATE",
"MINISTERIAL ORDER N°001/11 OF 29/09/2011 DETERMINING RIGHTS OF A PERSON SERVING COMMUNITY SERVICE AS AN ALTERNATIVE PENALTY TO IMPRISONMENT (TIG)",
"LOI DU 30/7/1964PORTANT STATUT DU MINISTERE PUBLIC-J.O. N0 15-1.8.1964",
"ORGANIC LAW  Nº 002/OL/2016 OF 08/09/2016 REPEALING ORGANIC LAW N° 02/2010/OL OF 09/06/2010 ON ORGANISATION, JURISDICTION, COMPETENCE AND FUNCTIONING OF THE MEDIATION COMMITTEE AS MODIFIED AND COMPLEMENTED TO DATE",
"MINISTERIAL ORDER N°002/11 OF 29/09/2011 GOVERNING RELIGIOUS ACTIVITIES IN PRISONS BY RELIGIOUS MINISTRIES",
"MINISTERIAL ORDER N°003/11 OF 29/09/2011 DETERMINING QUANTITY AND QUALITY OF RATION FOR AN INCARCERATED PERSON",
"PRESIDENTIAL ORDER NO 66/01 OF 02/11/2012 DETERMINING THE MODALITIES OF IMPLIMENTATION OF COMMUNITY SERVICE AS AN ALTERNATIVE PENALTY TO IMPRISONMENT",
"ARRETE MINISTERIEL NO 146/07 DU 4 JUIN 1980 MODIFIANT L’ORDONNANCE NO 111/187 DU 30 MAI 1961 ORGANISANT LE SERVICE PENITENTIAIRE.",
"ORGANIC LAW N° 59/2007 OF 16/12/2007 ESTABLISHING THE C O M M E R C I A L C O U R T S A N D D E T E R M I N I N G T H E I R O R G A N I S A T I O N , FUNCTIONING AND JURISDICTION",
"PRIME MINISTER’S ORDER N ̊110/03 OF 05/09/2011 DETERMINING THE FUNCTIONING OF THE HIGH COUNCIL OF RWANDA CORRECTIONAL SERVICE",
"ORGANIC LAW N°12/2006 OF 21/3/2006 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 22/2004 OF 13/08/2004 ON THE STATUTE OF PUBLIC PROSECUTORS AND PERSONNEL OF THE PUBLIC PROSECUTION SERVICE",
"LAW N°19bis/2017 OF 28/04/2017 MODIFYING AND COMPLEMENTING LAW N°34/2010 OF 12/11/2010 ON THE ESTABLISHMENT, FUNCTIONING AND ORGANIZATION OF RWANDA CORRECTIONAL SERVICE (RCS)",
"LAW N°38/2006 OF 25/09/2006 ESTABLISHING AND DETERMINING THE ORGANISATION OF THE NATIONAL PRISONS SERVICE",
"ORGANIC LAW Nº05/2011/OL OF 25/11/2011 REPEALING ORGANIC LAW Nº 22/2004 OF 13/08/2004 ON THE STATUTE OF PUBLIC PROSECUTORS AND PERSONNEL OF THE PUBLIC PROSECUTION SERVICE AS MODIFIED AND COMPLEMENTED TO DATE",
"ORGANIC LAW N°07/2012/OL OF 19/09/2012 DETERMINING THE ORGANIZATION, POWERS AND FUNCTIONING OF THE HIGH COUNCIL OF THE JUDICIARY",
"ORGANIC LAW N°06/2012/OL OF 14/09/2012 DETERMINING THE ORGANISATION, FUNCTIONING AND JURISDICTION OF COMMERCIAL COURTS",
"LAW N° 34/2010 OF 12/11/2010 ON THE ESTABLISHMENT, FUNCTIONING AND ORGANISATION OF RWANDA CORRECTIONAL SERVICE (RCS)",
"ORGANIC LAW N° 13/2008 OF 19/05/2008 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 16/2004 OF 19/06/2004 ESTABLISHING THE ORGANISATION, COMPETENCE AND FUNCTIONING OF GACACA COURTS CHARGED WITH PROSECUTING AND TRYING THE PERPETRATORS OF THE CRIME OF GENOCIDE AND OTHER CRIMES AGAINST HUMANITY, COMMITTED BETWEEN OCTOBER 1, 1990 AND DECEMBER 31, 1994 AS MODIFIED AND COMPLEMENTED TO DATE",
"ORGANIC LAW N° 01/2013/OL OF 07/02/2013 MODIFYING AND COMPLEMENTING ORGANIC LAW Nº03/2012/OL OF 13/06/2012 DETERMINING THE ORGANIZATION, FUNCTIONING AND JURISDICTION OF THE SUPREME COURT",
"ORGANIC LAW N°04/2012/OL OF 15/06/2012 TERMINATING GACACA COURTS AND DETERMINING MECHANISMS FOR SOLVING ISSUES WHICH WERE UNDER THEIR JURISDICTION",
"ORGANIC LAW N°03/2012/OL Of 13/06/2012 DETERMINING THE ORGANIZATION, FUNCTIONING AND JURISDICTION OF THE SUPREME COURT",
"MINISTERIAL ORDER N° 67 DU OF 05/5/2009 GRANTING JUDICIAL POLICE POWERS TO THE STAFF OF THE OFFICE OF THE OMBUDSMAN",
"LAW N°10/2013 OF 08/03/2013 GOVERNING THE STATUTES OF JUDGES AND JUDICIAL PERSONNEL",
"LAW N°41/2016 OF 15/10/2016 ESTABLISHING THE RWANDA FORENSIC LABORATORY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW N° 15/2006 OF 24/03/2006 MODIFYING AND COMPLEMENTING THE ORGANIC LAW N ̊03/2004 OF 20/03/2004 DETERMINING THE ORGANISATION, POWERS AND FUNCTIONING OF THE PROSECUTION SERVICE",
"ORGANIC LAW Nº02/2015/OL. OF 16/07/2015 MODIFYING AND COMPLEMENTING ORGANIC LAW Nº02/2010/OL. OF 09/06/2010 ON THE ORGANISATION, JURISDICTION, COMPETENCE AND FUNCTIONING OF THE MEDIATION COMMITTEE",
"ORGANIC LAW N°04/2012/OL OF 15/06/2012 TERMINATING GACACA COURTS AND DETERMINING MECHANISMS FOR SOLVING ISSUES WHICH WERE UNDER THEIR JURISDICTION",
"PRESIDENTIAL ORDER Nº42/01 OF 06/06/2011 MODIFYING AND COMPLEMENTING PRESIDENTIAL ORDER Nº 43/01 OF 10/11/2007 ESTABLISHING PRISONS AND THEIR MODE OF CONSTRUCTION",
"ORGANIC LAW N° 51/2008 OF 09/09/2008 DETERMINING THE ORGANISATION, FUNCTIONING AND JURISDICTION OF COURTS",
"MINISTERIAL ORDER N°128/08.11 OF 15/11/2010 EMPOWERING STAFF OF THE NATIONAL FORESTRY AUTHORITY (NAFA) TO ACT AS JUDICIAL POLICE OFFICERS",
"DECRET –LOI DU 12 SEPTEMBRE 1973 MODIFIANT LA LOI DU 15 AVRIL 1963 SUR L’ORGANISATION TERRITORIALE DE LA REPUBLIQUE TELLE QUE MODIFIEE A CE JOUR",
"DECRET LOI N0 01/77 DU 3/01/1977 COMPLETANT LE DECRET-LOI DU 19/03/1974 PORTANT STATUT GENERAL DES  AGENTS DE L'ETAT",
"ARRETE PRESIDENTIEL NO 792/06 DU 29/11/1988 PORTANT FIXATION DE LA PRIME AFFERENTE AUX DECORATIONS DE SERVICE, DE MERITE ET DE L'HEROISME ET DES MODALITES DE SA LIQUIDATION",
"LOI DU 18/9/1967   MODIFIANT LES ARTICLES 95 ET 96 DE LA LOI DU  5 JUILLET 1967, PORTANT ORGANISATION DU  REGIME ELECTORAL",
"DECRET-LOI NO 28/78 DU 22 SEPTEMBRE 1978 COMPLETANT LE DECRET-LOI DU 19 MARS 1974 PORTANT STATUT GENERAL DES AGENTS DE L’ETAT.",
"DECRET-LOI NO 30/75 DU 4 AOUT 1975 PORTANT ABROGATION DE L’ARTICLE 58 DE LA LOI DU 27 AOUT 1966 SUR L’EDUCATION NATIONALE DE LA REPUBLIQUE RWANDAISE",
"DECRET-LOI NO 07/78 DU 17 AVRIL 1978 COMPLETANT LE DECRET-LOI DU 19 MARS 1974 PORTANT STATUT GENERAL DES AGENTS DE L’ETAT.",
"DECRET-LOI DU 12 SEPTEMBRE 1973 SUSPENDANT PROVISOIREMENT LA LOI DU 5 SEPTEMBRE 1975 RELATIVE AU REGIME ELECTORAL, TELLE QUE MODIFIEE PAR LA LOI DU 18 SEPTEMBRE 1967 ET LA LOI DU 19 MAI 1969",
"ARRETE PRESIDENTIEL NO 231/03 DU 05/12/1972 PORTANT MODIFICATION DE L'ARRETE PRESIDENTIEL NO  168/03 DU 20 FEVRIER 1971 PORTANT CREATION DE  L'ACADEMIE RWANDAISE DE CULTURE",
"DECRET-LOI NO 34/78 DU 30 OCTOBRE 1978 MODIFIANT ET COMPLETANT LE DECRET-LOI NO 35/75  DU 7 NOVEMBRE 1975 SUR LES ETABLISSEMENTS PUBLICS.",
"ARRETE PRESIDENTIEL NO 45/06 DU 12/04/1976 MODIFIANT L'ARRETE PRESIDENTIEL NO 234/06 DU 21/10/1975 PORTANT CREATIONDE CENTRES DE REEDUCATION ET DE PRODUCTIONCREATION DE CENTRE DE REEDUCATION ET PRODUCTION",
"PRESIDENTIAL ORDER Nº 167/01 DU 22 JUIN 1979 PORTANT CREATION DE LA COMMISSION NATIONALE DES ARCHIVES",
"ARRETE PRESIDENTIEL NO  116/03 DU 27 JUIN 1970 PRTANT CREATION ET ORGANISATION DE L'INSTITUT PEDAGOGIQUE NATIONAL DE LA REPUBLIQUE RWANDAISEIQUE NATIONAL",
"P.O N° 116/03 DU 27/6/1970 PORTANT CREATION ET ORGANISATION DE LINSTITUT PEDAGOGIQUE NATIONAL -I.P.N.-J.O.NO 13-1.7.1970",
"ARRETE PRESIDENTIEL NO 234/06 DU 21/10/1975 PORTANT CREATION DE CENTRES DE REEDUCATION ET DE PRODUCTION",
"ARRETE MINISTERIEL NO 1091/06 DU 30 NOVEMBRE 1981 PORTANT FIXATION DU MODELE DE BOVET ATTESTATNT L'OCTROI D'UNE DECORATION",
"DECRET LOI No. 16/76 DU 7 AVRIL 1976 PORTANT CREATION D’ORDRES NATIONAUX",
"DECRET LOI No. 27/76 DU 26 MAI 1976 PORTANT CREATION DE L’ORDRE NATIONAL DU RWANDA",
"DECRET-LOI NO 20/77 DU 12 AOUT 1977 COMPLETANT LE DECRET-LOI DU 19 MARS 1974 PORTANT STATUT GENERAL DES AGENTS DE L’ETAT.",
"DECRET-LOI N° 11/76 DU 08/3/1976 MODIFICATION-LOIS DE 1968 -CONTRIBUTION PERSONNELLE MINIMUM-IMPOT SUR  LE BETAIL-J.O. NO 6-15.3.1976",
"DECRET-LOI NO 38/75 DU 10 NOVEMBRE 1975 MODIFIANT ET COMPLETANT LE DECRET-LOI DU 19 MARS PORTANT STATUT GENERAL DES AGENTS DE L’ETAT.",
"LOI DU 23/8/1963 PORTANT CREATION DU FONDS ROUTIER-J.O. N0 16-15.8.1963",
"LOI N0 27/85 DU 5/11/1985 ORGANISATION COMMUNALE- MODIFICATION-J.O. N0 14-15.7.1985pdf",
"LOI NO 41/1988 DU 27 OCTOBRE 1988 MODIFIANT ET COMPLETANT LE DECRET-LOI NO 26/76 DU 18 JUIN 1976 PORTANT CREATION DE DECORATIONS.",
"MO N° 112/15.20 OF 17/10/1990  SECTEUR DACTIVITE-SOCIETE COOPERATIVE",
"PO N° 113/09 DU 10/5/1979 EQUIVALENCE DES DIPLOMES",
"LOI N0 41/1988 DU 27/10/1988  Création de décorations Loi  n° 41 of 1988  amendement",
"AP N°218/09  DU 02/10/1975  MESURE_D_EXECUTION_DECRET_LOI_DE_1974_PERSONNEL_SOUS_CONTRAT_",
"LOI DU 28/2/1968 RELATIVE A LIMPOT SUR LE BETAIL-J.O. N0 6-15.3.1968",
"LOI N° 14/1986  DU 06/6/1986 SOINS MEDICAUX DANS LES ETABLISSEMENT DE SANTE PUBLIQUE  -J.O.N0 17-1.9.1986",
"DECRET-LOI  N° 26/76  DU  18 JUIN 1976 PORTANT CREATION DE  DECORATIONS",
"DECRET-LOI N°  17/77 DU 13/7/1977 PORTANT CREATION DU FONDS DE DEVELOPPEMENT COMMUNAL-J.O. NO 15-1.8.1977",
"DECRET-LOI DU 14/3/1974   RELATIF AUX SOINS MEDICAUX-J.O. NO 10-15.5.1974",
"DECRET-LOI N°27/78 DU SEPTEMBRE 1978 PORTANT CREATION DE L’OFFICE DES CAFES",
"LOI DU 19/5/1969 MODIFIANT LA LOI DU 5-7-1967  PORTANT REGIME ELECTORAL-J.O. NO 11-1.6.1969",
"DECRET-LOI N° 26/76 DU 18/6/1976  PORTANT CREATION DE DECORATIONS-J.O. NO 13-1.7.1976",
"ARRETE PRESIDENTIEL N° 168/03 DU 20 FEVRIER 1971 PORTANT CREATION DE LACADEMIE RWANDAISE DE CULTURE",
"LOI DU 30/7/1964 CREANT L'OFFICE DES CULTURES INDUSTRIELLES DU RWANDA-OCIR",
"DECRET-LOI NO 26/78 DU 5 SEPTEMBRE 1978 PORTANT CREATION DE L’OFFICE DU THE",
"DECRET-LOI N° 10/75 DU 11/3/1975  ORGANISATION ET FONCTIONNEMENT DE LA PREFECTURE-J.O. NO 7-1.4.1975",
"DECRET-LOI NO 21/79 DU 23 JUILLET 1979 RELATIF A L’EXPROPRIATION POUR CAUSE D’UTILITE PUBLIQUE",
"LOI DU 27/8/1966 SUR L'EDUCATION NATIONAL-J.O. N0 19-1.10.1966",
"LOI PORTANT CREATION ET ORGANISATION DE LUNIVERSITE NATIONALE DU RWANDA-J.O. N0 10-15.5.1964",
"DECRET-LOI NO 39/75 DU 7/11/1975  SUR LES ETABLISSEMENTS PUBLICS -J.O. NO 23-1.12.1975",
"DECRET-LOI DU 26/9/1974 MODIFIANT-TITRE PREMIER DE LA LOI DE 1963 PORTANT ORGANISATION COMMUNALE-J.O. NO 20-15.10.1974",
"MINISTERIAL ORDER N° 007/07.01 OF 18/09/2006 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE COMMUNITY DEVELOPMENT COMMITTEE",
"MINISTERIAL ORDER N° 002/07.01 OF 15/09/2006 DETERMINING THE FUNCTIONING AND RELATIONSHIP BETWEEN THE COUNCIL BUREAU AND THE EXECUTIVE COMMITTEE",
"LAW Nº 26/2003 OF 16/08/2003 ESTABLISHING AND ORGANIZING  THE \"HIGHER  INSTITUTE  OF AGRICULTURE  AND ANIMAL  HUSBANDRY\"",
"ORGANIC LAW N° 30/2006 OF 14/08/2006 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 14/2004 OF 26/5/2004 ESTABLISHING GENERAL PROVISIONS GOVERNING PUBLIC INSTITUTIONS AS MODIFIED TO DATE",
"MINISTERIAL ORDER N° 002/07.01 OF 24/09/2021 ANNOUNCING THE RESUMPTION OF ELECTIONS",
"PMO 05/03 OF 15/3/2003 General Inspectorate of Education PMO n° 05-03 of 2003",
"LOI DU 11/8/1965 RELATIVE AU REGIME ELECTORAL-J.O. N0 16-15.8.1965",
"LOI DU 23/11/1963 PORTANT ORGANISATION COMMUNALE-J.O. N0 23-1.12.1963",
"LAW N° 17/2005 OF 18/08/2005 MODIFYING AND COMPLEMENTING LAW N°25/2003 OF 15/08/ /2003 ESTABLISHING THE ORGANISATION AND THE FUNCTIONING OF THE OFFICE OF THE OMBUDSMAN",
"LAW N°04/2007 OF 22/01/2007DETERMINING RESPONSIBILITIES ORGANISATION FUNCTIONING OF RIAM OF 2007",
"DECRET-LOI DU 30/7/1974 RELATIF AUX BIENS COMMUNAUX-J.O. NO 16-15.8.1974",
"LAW Nº 30/2001  DU 12/6/2001 SCOPE OF ACTIVITIES OF MEDICAL COUNCIL  -O.G. N0 23 OF 1.12.2001",
"LAW N° 15/2008 OF 09/06/2008 ON THE ESTABLISHMENT OF RWANDA HORTICULTUREDEVELOPMENT AUTHORITY (RHODA) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW N°23/2006 OF 28/04/2006 GOVERNING THE NATIONAL COUNCIL OF HIGHER EDUCATION",
"LOI DU 5/7/1967  RELATIVE AU REGIME ELECTORAL-J.O. N0 14-15.7.1967",
"LAW N° 09/2005 OF 14/07/2005 ESTABLISHING THE NATIONAL INSTITUTE OF STATISTICS OF RWANDA",
"LAW  MODIFYING  LAW  N°14-2004  ESTABL PROVISIONS GOVERNING  PUBLIC INSTITUTIONS 2008",
"LAW N° 09/2005 OF 14/07/2005 ESTABLISHING THE NATIONAL INSTITUTE OF STATISTICS OF RWANDA",
"•\tLAW  MODIFYING  LAW  N°14-2004  ESTABL PROVISIONS GOVERNING  PUBLIC INSTITUTIONS 2008",
"LAW Nº 07/2007  OF 01/02/2007 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF THE COMMON DEVELOPMENT FUND FOR DISTRICTS AND THE CITY OF KIGALI (CDF)",
"LAW N°41/2006 OF 29/9/2006 ESTABLISHING THE RESPONSIBILITIES, STRUCTURE AND FUNCTIONING OF RWANDA ANIMAL RESOURCES DEVELOPMENT AUTHORITY (RARDA)",
"MINISTERIAL ORDER N° 20/31 OF 18/04/2012 DETERMINING THE MODALITIES FOR DEPLOYMENT OF MEDICAL STAFF IN HEALTH SECTOR",
"LAW Nº 40/2006 OF 30/9/2006 ESTABLISHING AND DETERMINING THE ORGANISATION, RESPONSIBILITIES AND FUNCTIONING OF RWANDA AGRICULTURAL DEVELOPMENT AUTHORITY (RADA)",
"LAW N°  51 OF 5/10/2006 INSTITUTE OF NATIONAL MUSEUMS OF RWANDA (INMR)",
"LAW  N°49/2006 OF 05/10/2006 DETERMINING RESPONSIBILITIES OF OCIR THE- OG N0 24BIS OF 15 DEC 2006",
"LAW N° 50/2006 OF 05/10/2006 LAW ESTABLISHING AND DETERMINING SFAR",
"LAW N° 06/2007 OF 01/02/2007 DETERMINING THE ORGANIZATION AND FUNCTIONING OF THE PUBLIC SERVICE COMMISSION",
"LAW Nº 12/99 OF 02/07/1999 RELATING TO PHARMACEUTICAL ART",
"DECRET-LOI NO 19/76 DU 20 AVRIL 1976 MODIFIANT LE DECRET-LOI NO 39/75 DU 7 NOVEMBRE 1975 SUR LES ETABLISSEMENYS PUBLICS",
"ORGANIC LAW N° 003/2018/OL OF 18/05/2018 MODIFYING ORGANIC LAW Nº 001/2016/OL OF 20/04/2016 ESTABLISHING GENERAL PROVISIONS GOVERNING PUBLIC INSTITUTIONS",
"MINISTERIAL ORDER N°008/2016/Mineduc OF 14/11/2016 PROVIDING INSTRUCTIONS FOR ESTABLISHING THE BOARDING SYSTEM IN PRIMARY AND SECONDARY SCHOOLS",
"LAW N° 16/2006 OF 03/04/2006 DETERMINING THE ORGANISATION, FUNCTIONING AND RESPONSIBILITIES OF RWANDA ENVIRONMENT MANAGEMENT AUTHORITY",
"ORGANIC LAW N° 06/2009/OL OF 21/12/2009 ESTABLISHING GENERAL PROVISIONS GOVERNING PUBLIC INSTITUTIONS",
"LAW Nº16/2012 OF 22/05/2012 DETERMINING THE ORGANIZATION, FUNCTIONING AND MISSION OF THE NATIONAL FUND FOR ENVIRONMENT (FONERWA)",
"LAW N°12bis/2014 OF 19/05/2014 MODIFYING AND COMPLEMENTING LAW N° 49/2013 OF 28/06/2013 ESTABLISHING ROAD MAINTENANCE FUND (RMF) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRESIDENTIAL ORDER N°106/01 OF 10/07/2014 DETERMINING ORGANIZATION OF THE CELL COUNCIL",
"LAW Nº 01/2006 OF 24/01/2006 ESTABLISHING THE ORGANISATION AND FUNCTIONING OF PROVINCE",
"LAW N°43/2006 OF 05/10/2006 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF THE RWANDA BUREAU OF STANDARDS (RBS)",
"LAW N° 17/2008 OF 20/06/2008 ESTABLISHING THE NATIONAL FORESTRY AUTHORITY (NAFA) A N D D E T E R M I N I N G I T S ORGANISATION, FUNCTIONING AND RESPONSIBILITIES",
"LAW N° 09/2007 OF 16/02/2007 ON THE ATTRIBUTIONS, ORGANISATION AND FUNCTIONING OF THE NATIONAL COMMISSION FOR THE FIGHT AGAINST GENOCIDE",
"LAW N°53/2010 OF 25/01/2011 ESTABLISHING RWANDA NATURAL RESOURCES AUTHORITY (RNRA) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRIME MINISTER’S ORDER N° 195/03 OF 03/08/2016 ESTABLISHING CRITERIA AND MODALITIES FOR DETERMINATION OF ALLOWANCES OF PUBLIC SERVANTS",
"MINISTERIAL ORDER N°03/Mifotra/15 OF 09/06/2015 DETERMINING MODALITIES FOR RECRUITING CONTRACTUAL STAFF IN PUBLIC SERVICE",
"LAW Nº07/2012 OF 29/02/2012 ESTABLISHING RWANDA MILITARY HOSPITAL (RMH) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N° 05/2006 OF 05/02/2006 MODIFYING AND COMPLEMENTING LAW N° 24/2003 OF 14/08/2003 ESTABLISHING THE FUNCTIONING AND ORGANISATION OF THE NATIONAL YOUTH COUNCIL",
"LAW N°40/2013 OF 16/06/2013 MODIFYING AND COMPLEMENTING LAW N° 35/2008 OF 08/08/2008 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE NATIONAL UNITY AND RECONCILIATION COMMISSION",
"DECRET-LOI NO 03/80 DU 24 JANVIER 1980 MODIFIANT ET COMPLETANT LE DECRET DU 19 MARS 1952 RELATIF A L’EXERCISE DE L’ART DE GUERIR",
"LAW N°29/2014 OF 14/08/2014 MODIFYING AND COMPLEMENTING LAW N°02/2010 OF 20/01/2010 ESTABLISHING RWANDA TRANSPORT DEVELOPMENT AGENCY (RTDA) AND DETERMINING ITS MISSION, STRUCTURE AND FUNCTIONING",
"LAW N°29/2014 OF 14/08/2014 MODIFYING AND COMPLEMENTING LAW N°02/2010 OF 20/01/2010 ESTABLISHING RWANDA TRANSPORT DEVELOPMENT AGENCY (RTDA) AND DETERMINING ITS MISSION, STRUCTURE AND FUNCTIONING",
"LAW N° 52bis/2006 OF 12/12/2007 DETERMINING THE ATTRIBUTIONS, STRUCTURE, AND FUNCTIONING OF THE ROAD MAINTENANCE FUND (FER)",
"LAW N°44/2010 OF 07/12/2010 ESTABLISHING RWANDA EDUCATION BOARD (REB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW N°09/2012/OL OF 30/12/2012 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 06/2009/OL OF 21/12/2009 ESTABLISHING GENERAL PROVISIONS GOVERNING PUBLIC INSTITUTIONS AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N°02/2010 OF 20/01/2010 ESTABLISHING RWANDA TRANSPORT DEVELOPMENT AGENCY (RTDA) AND DETERMINING ITS MISSION, STRUCTURE AND FUNCTIONING",
"LAW N°44/2016 OF 18/10/2016 MODIFYING AND COMPLEMENTING LAW N°15/2012 OF 03/05/2012 RELATING TO ELECTION PROCEDURES FOR RWANDAN MEMBERS OF THE EAST AFRICAN LEGISLATIVE ASSEMBLY",
"LAW N°39/2011 OF 13/09/2011 ESTABLISHING THE WORKFORCE DEVELOPMENT AUTHORITY (WDA) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"MINISTERIAL INSTRUCTIONS N°001/15/10/TC OF 20/07/2015 DETERMINING MISSION ALLOWANCE OF CIVIL SERVANTS ON MISSION INSIDE THE COUNTRY",
"MINISTERIAL ORDER N°001/MINEDUC/2013 OF 15/11/2013 DETERMINING THE CONDITIONS FOR GRANTING ACCREDITATION TO A PRIVATE INSTITUTION OF HIGHER LEARNING, UPGRADING THE LEVEL OF TEACHING, OPENING A COLLEGE, A SCHOOL, A FACULTY OR AN AFFILIATED RESEARCH INSTITUTE",
"LAW N° 67/2018 OF 30/08/2018 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF NATIONAL PUBLIC SERVICE COMMISSION",
"ORGANIC LAW N° 65/2008 OF 11/09/2008 MODIFYING AND COMPLEMENTING THE ORGANIC LAW N° 37/2006 OF 12/09/2006 ON STATE FINANCE AND PROPERTY",
"PRESIDENTIAL ORDER Nº 02/01 OF 19/01/2015 DETERMINING THE SHARING OUT OF FUNDS DEPOSITED INTO THE JOINT ACCOUNT OF THE CITY OF KIGALI AND ITS DISTRICTS",
"ORGANIC LAW N° 05/2007 OF 23/01/2007 MODIFYING AND COMPLEMENTING THE ORGANIC LAW N° 17/2003 OF 07/07/2003 GOVERNING PRESIDENTIAL AND PARLIAMENTARY ELECTION",
"LAW N° 52/2011 OF 14/12/2011 ESTABLISHING THE SPECIAL GUARANTEE FUND FOR ACCIDENTS AND DAMAGES CAUSED BY AUTOMOBILES AND ANIMALS (SGF) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº03/2017 OF 21/02/2017 ESTABLISHING RWANDA CIVIL AVIATION AUTHORITY (RCAA) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW  N° 20/2005 OF 20/10/2005  GOVERNING THE ORGANISATION AND FUNCTIONING OF HIGHER EDUCATION",
"LAW Nº48/2012 OF 14/01/2013 MODIFYING AND COMPLEMENTING THE LAW N° 54/2010 OF 25/01/2011 ESTABLISHING RWANDA BIOMEDICAL CENTER (RBC) AND DETERMING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°22/2006 OF 28/04/2006 ESTABLISHING THE INSTITUTE OF LEGAL PRACTICE AND DEVELOPM",
"PRESIDENTIAL ORDER N ̊77/01 OF 30/09/2015 DETERMINING COMPETENT AUTHORITY AND MODALITIES OF DELEGATING AUTHORITY IN PUBLIC SERVICE",
"AMABWIRIZA N° 01/2020 YO KU WA 30/04/2020 YA KOMISIYO Y’IGIHUGU Y’AMATORA AGENA IMIGENDEKERE Y’AMATORA Y’ABAGIZE KOMITE Y’ABUNZI",
"LAW N°41/2010 OF 25/11/2010 ESTABLISHING THE RWANDA LOCAL DEVELOPMENT SUPPORT FUND (RLDSF) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LOI NO 29/90 DU 28 MAI 1990 MODIFIANT EY COMPLETANT LA LOI DU 16 AVRIL 1963 SUR L’ORGANISATION TERRITORIALE DE LA REPUBLIQUE",
"LAW N° 49/2013 OF 28/06/2013 ESTABLISHING ROAD MAINTENANCE FUND (RMF) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW Nº 01/2009/OL OF 17/04/2009 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 53/2008 OF 02/09/2008 ESTABLISHING RWANDA DEVELOPMENT BOARD (RDB) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW N°02/2012/OL OF 03/05/2012 REPEALING ORGANIC LAW N°12/2008 OF 09/05/2008 RELATING TO ELECTION PROCEDURES OF RWANDAN REPRESENTATIVES TO THE EAST AFRICAN LEGISLATIVE ASSEMBLY (EALA)",
"LAW N°40/2010 OF 25/11/2010 ESTABLISHING THE RWANDA HOUSING AUTHORITY (RHA) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW Nº 91bis/2013 OF 22/01/2014 ESTABLISHING THE UNIVERSITY TEACHING HOSPITAL (CHU) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW Nº 37/2006 OF 12/09/2006 ON STATE FINANCES AND PROPERTY",
"MINISTERIAL INSTRUCTIONS N°003/2010 OF 09/12/2010 REGULATING RESEARCH ACTIVITIES IN RWANDA",
"MINISTERIAL ORDER Nº 01/MIFOTRA/22 OF 30/08/2022 ON PUBLIC SERVANTS GOVERNED BY AN EMPLOYMENT CONTRACT AND WEEKLY WORKING HOURS FOR PUBLIC SERVANTS",
"LAW N°14/2017 OF 14/04/2017 ESTABLISHING RWANDA AGRICULTURE AND ANIMAL RESOURCES DEVELOPMENT BOARD (RAB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"MINISTERIAL ORDER N° 003/07.01 OF 14/10/2021 DETERMINING OTHER MODALITIES TO CONDUCT ELECTIONS OF DECENTRALIZED ADMINISTRATIVE ENTITIES DUE TO FORCE MAJEURE",
"LAW Nº 91bis/2013 OF 22/01/2014 ESTABLISHING THE UNIVERSITY TEACHING HOSPITAL (CHU) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°25/2011 OF 30/06/2011 ESTABLISHING RWANDA PUBLIC PROCUREMENT AUTHORITY (RPPA) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N° 02/2006 OF 25/01/2006 INSTITUTING THE ORGANISATION OF ELECTIONS OF LEADERS OF LOCAL ADMINISTRATIVE ENTITIES",
"MINISTERIAL ORDER N° 002/2016 OF 08/01/2016 DETERMINING THE RESPONSIBILITIES OF SCHOOL MANAGEMENT BOARD MEMBERS",
"LAW Nº 39/2017 OF 16/08/2017 ESTABLISHING THE NATIONAL FUND FOR ENVIRONMENT AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 41/2011 OF 30/09/2011 ESTABLISHING THE RWANDA GOVERNANCE BOARD AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N°01/2010 OF 29/01/2010 DETERMINING THE MISSION, ORGANISATION AND FUNCTIONING OF THE RWANDA ACADEMY OF LANGUAGE AND CULTURE",
"LAW N°72/03 OF 10/09/2013 ESTABLISHING HIGHER EDUCATION COUNCIL AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW N°54/2010 OF 25/01/2011 ESTABLISHING RWANDA BIOMEDICAL CENTER (RBC) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº64/2013 OF 27/08/2013 ESTABLISHING THE INSTITUTE OF NATIONAL MUSEUMS OF RWANDA (INMR) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 35/2014 OF 28/11/2014 MODIFYING AND COMPLEMENTING LAW N° 44/2013 OF 16/06/2013 ESTABLISHING THE RWANDA LAW REFORM COMMISSION (RLRC) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N°01/2010 OF 29/01/2010 DETERMINING THE MISSION, ORGANISATION AND FUNCTIONING OF THE RWANDA ACADEMY OF LANGUAGE AND CULTURE",
"LAW N° 74/2013 OF 11/09/2013 ESTABLISHING RWANDA FOOD AND MEDICINES AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°54bis/2011 OF 14/12/2011 ESTABLISHING RWANDA METEOROLOGY AGENCY (METEO RWANDA) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº 53/2011 OF 14/12/2011 ESTABLISHING RWANDA CIVIL AVIATION AUTHORITY (RCAA), AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONNING",
"LAW Nº64/2013 OF 27/08/2013 ESTABLISHING THE INSTITUTE OF NATIONAL MUSEUMS OF RWANDA (INMR) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°55/2011 OF 14/12/2011 GOVERNING ROADS IN RWANDA",
"LAW N° 20/2009 OF 29/07/2009 ESTABLISHING THE NATIONAL LAND CENTRE (NLC) AND DETERMINING ITS RESPONSIBLITIES, FUNCTIONING ORGANIZATION AND COMPETENCE",
"LAW N°56/2008 OF 10/09/2008 GOVERNING MEMORIAL SITES AND CEMETERIES OF VICTIMS OF THE GENOCIDE AGAINST THE TUTSI IN RWANDA",
"DECRET-LOI DU 20 JANVIER 1974 PORTANT MODIFICATION DE LA LOI DU 30 JUILLET 1964 CREANT L’OFFICE DES CULTURES INDUSTRIELLES DU RWANDA (OCIR).",
"LAW N°53bis/2013 OF 28/06/2013 ESTABLISHING NATIONAL INSTITUTE OF STATISTICS OF RWANDA (NISR) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°54/2010 OF 25/01/2011 ESTABLISHING RWANDA BIOMEDICAL CENTER (RBC) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LOI NO 15/1987 DU 30 JUIN 1987 COMPLETANT LE DECRET DU 19 MARS 1952 SUR L’EXERCISE DE L’ART DE GUERIR",
"LAW N°53bis/2013 OF 28/06/2013 ESTABLISHING NATIONAL INSTITUTE OF STATISTICS OF RWANDA (NISR) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°81/2013 OF 11/09/2013 ESTABLISHING THE FUND FOR SUPPORT AND ASSISTANCE TO THE NEEDIEST SURVIVORS OF THE GENOCIDE AGAINST THE TUTSI COMMITTED BETWEEN 01 OCTOBER 1990 AND 31 DECEMBER 1994 AND DETERMINING ITS MISSION, POWERS, ORGANISATION AND FUNCTIONING",
"LAW N°39/2010 OF 25/11/2010 ESTABLISHING NATIONAL AGRICULTURAL EXPORT DEVELOPMENT BOARD (NAEB) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW N°80/2013 OF 11/09/2013 ESTABLISHING THE NATIONAL COMMISSION OF SCIENCE AND TECHNOLOGY AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N°15/2012 OF 03/05/2012 RELATING TO ELECTION PROCEDURES FOR RWANDA MEMBERS OF THE EAST AFRICAN LEGISLATIVE ASSEMBLY",
"LAW N°39/2013 OF 16/06/2013 ESTABLISHING THE RWANDAN ELDERS ADVISORY FORUM AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°22/2011 OF 28/06/2011 ESTABLISHING THE NATIONAL COMMISSION FOR CHILDREN AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"DECRET-LOI NO 24/1984 DU 27 NOVEMBRE 1984 MODIFIANT LE DECRET-LOI NO 36/79 DU 13 NOVEMBRE 1979 PORTANT ORGANISATION DES ELECTIONS DES CONSEILLERS COMMUNINAUX",
"LAW N°62/2013 OF 27/08/2013 ESTABLISHING THE LOCAL ADMINISTRATIVE ENTITIES DEVELOPMENT AGENCY (LODA) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONIN",
"LAW Nº04/2010 OF 16/4/2010 REGULATING THERAPEUTIC, EDUCATIONAL AND SCIENTIFIC UTILISATION OF ORGANS AND PRODUCTS OF THE HUMAN BODY",
"LAW N° 41/2013 OF 16/06/2013 ESTABLISHING THE NATIONAL ITORERO COMMISSION AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 50/2007 OF 18/09/2007 DETERMINING THE ESTABLISHMENT, ORGANIZATION AND FUNCTIONING OF COOPERATIVE ORGANIZATIONS IN RWANDA",
"ORGANIC LAW  Nº001/2016/OL OF 20/04/2016 ESTABLISHING GENERAL PROVISIONS GOVERNING PUBLIC INSTITUTIONS",
"PRESIDENTIAL ORDER Nº105/01 OF 10/07/2014 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE ADMINSITRATIVE ORGANS OF THE VILLAGE",
"LAW N°38/2010 OF 25/11/2010 ESTABLISHING RWANDA AGRICULTURE BOARD (RAB) AND DETERMINING ITS RESPONSIBILITIES , ORGANISATION AND FUNCTIONING",
"LOI N0 05/1987 DU 18/2/1987 ORGANISATION DES SPORTS ET LOISIRS AU RWANDA- J.O. N0 7-1.4.1987",
"LAW N° 30/2009 OF 16/9/2009 DETERMINING THE MISSION, ORGANISATION AND FUNCTIONING OF THE MEDIA HIGH COUNCIL (MHC)",
"LAW N°35/2008 OF 08/08/2008 DETERMINING THE ORGANIZATION AND FUNCTIONING OF THE NATIONAL UNITY AND RECONCILIATION COMMISSION",
"PRESIDENTIAL ORDER N° 64/01 OF 12/02/2014 DETERMINING THE RESPONSIBILITIES,ORGANISATION AND FUNCTIONING OF THE ADVISORY COUNCIL TO FIGHT AGAINST CORRUPTION AND INJUSTICE",
"LAW N°39/2012 OF 24/12/2012 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF THE PUBLIC SERVICE COMMISSION",
"LAW N°03/2009 OF 27/03/2009 ESTABLISHING THE WORKFORCE DEVELOPMENT AUTHORITY (WDA) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW Nº 46/2013 OF 16/06/2013 ESTABLISHING RWANDA DEVELOPMENT BOARD (RDB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW N°02/2011/OL OF 27/07/2011 GOVERNING ORGANISATION OF EDUCATION",
"LAW N° 04/2011 OF 21/03/2011 ON IMMIGRATION AND EMIGRATION IN RWANDA",
"LAW N°01/2017 OF 31/01/2017 GOVERNING THE ORGANISATION AND FUNCTIONING OF HIGHER EDUCATION",
"LAW No20bis/2017 OF 28/04/2017 ESTABLISHING RWANDA EDUCATION BOARD AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 69/2008 OF 30/12/2008 RELATING TO THE ESTABLISHMENT OF THE FUND FOR THE SUPPORT AND ASSISTANCE TO THE SURVIVORS OF THE TUTSI GENOCIDE AND OTHER CRIMES AGAINST HUMANITY COMMITTED BETWEEN 1st OCTOBER 1990 AND 31st DECEMBER 1994, AND DETERMINING ITS ORGANISATION, COMPETENCE AND FUNCTIONING",
"PRESIDENTIAL ORDER Nº83/01 OF 09/12/2010 GOVERNING MODALITIES FOR THE RECRUITMENT OF PUBLIC SERVANTS",
"LAW Nº42/2016 OF 18/10/2016 ESTABLISHING THE WORKFORCE DEVELOPMENT AUTHORITY AND DETERMINING ITS RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING",
"PRESIDENTIAL ORDER Nº83/01 OF 09/12/2010 GOVERNING MODALITIES FOR THE RECRUITMENT OF PUBLIC SERVANTS",
"MINISTERIAL INSTRUCTIONS N°001/MINICT/2012 OF 12/03/2012 RELATED TO THE PROCUREMENT OF INFORMATION AND COMMUNICATIONS TECHNOLOGY GOODS AND SERVICES BY RWANDA PUBLIC INSTITUTIONS",
"LAW N° 21/2008 OF 21/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF THE KIGALI HEALTH INSTITUTE ( KHI)",
"LAW N° 21/2008 OF 21/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF THE KIGALI HEALTH INSTITUTE ( KHI)",
"LAW Nº06/2017 OF 03/02/2017 ESTABLISHING RWANDA WATER AND FORESTRY AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 18/2007 OF 19/04/2007 RELATING TO EXPROPRIATION IN THE PUBLIC INTEREST",
"PRESIDENTIAL ORDER Nº46/01 OF 29/07/2011 GOVERNING MODALITIES FOR THE RECRUITMENT, APPOINTMENT AND NOMINATION OF PUBLIC SERVANTS",
"LAW N° 21/2008 OF 21/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF THE KIGALI HEALTH INSTITUTE ( KHI)",
"LAW Nº07/2017 OF 03/02/2017 ESTABLISHING RWANDA MINES, PETROLEUM AND GAS BOARD AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 21/2008 OF 21/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF THE KIGALI HEALTH INSTITUTE ( KHI)",
"LAW N° 22/2008 OF 21/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF THE NATIONAL UNIVERSITY OF RWANDA (UNR)",
"MINISTERIAL ORDER N°002/09/10/GP/A OF 12/02/2009 SETTING OUT REGULATIONS FOR INTERNAL CONTROL AND INTERNAL AUDIT IN GOVERNMENT",
"LAW Nº 013/2019 OF 30/06/2019 GOVERNING RWANDA BIOMEDICAL CENTRE",
"ORGANIC LAW N° 01/2010/OL OF 09/6/2010 ESTABLISHING THE NATIONAL LAW REFORM COMMISSION",
"MINISTERIAL ORDER N°01 OF 11/11/2014 DETERMINING MODALITIES OF ELECTING WORKERS’ REPRESENTATIVES AND FULFILLMENT OF THEIR DUTIES",
"LAW N° 49/2008 OF 09/09/2008 GOVERNING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF THE HIGHER INSTITUTE OF AGRICULTURE AND ANIMAL HUSBANDRY ( ISAE)",
"LAW N° 23/2008 OF 22/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF KIGALI INSTITUTE OF SCIENCE AND TECHNOLOGY (KIST)",
"ORGANIC LAW N̊ 61/2008 OF 10/09/2008 ON THE LEADERSHIP CODE OF CONDUCT",
"LAW N°17/2017 OF 28/04/2017 ESTABLISHING THE NATIONAL REHABILITATION SERVICE AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº05/2017 OF 03/02/2017 ESTABLISHING RWANDA LAND MANAGEMENT AND USE AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 20/2008 OF 18/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF KIGALI INSTITUTE OF EDUCATION (KIE)",
"PRESIDENTIAL ORDER N°144/01 OF 13/04/2017 DETERMINING MODALITIES FOR RECRUITMENT, APPOINTMENT AND NOMINATION OF PUBLIC SERVANTS",
"PRESIDENTIAL ORDER NO65/01 OF 04/03/2014 DETERMINING MODALITIES OF IMPOSING DISCIPLINARY SANCTIONS TO PUBLIC SERVANTS",
"ORGANIC LAW N° 11/2013/0L OF 11/09/2013 MODIFYING AND COMPLEMENTING THE ORGANIC LAW Nº 61/2008 OF 10/09/2008 ON THE LEADERSHIP CODE OF CONDUCT",
"LAW N°27/2013 OF 24/05/2013 GOVERNING ORGANISATION AND FUNCTIONING OF HIGHER EDUCATION",
"LAW N° 20/2008 OF 18/07/2008 DETERMINING THE STRUCTURE, ORGANISATION AND FUNCTIONING OF KIGALI INSTITUTE OF EDUCATION (KIE)",
"LAW Nº 76/2013 OF 11/9/2013 DETERMINING THE MISSION, POWERS, ORGANIZATION AND FUNCTIONING OF THE OFFICE OF THE OMBUDSMAN",
"LOI No 21/1982 DU 10 JUIN 1982 PORTANT RESTRUCTURATION DE L’INSTITUT DES SCIENCES AGRONO MIQUES DU RWANDA (ISAR).S.A.R.",
"MINISTERIAL ORDER N° 002/20/10/TC OF 19/05/2020 ESTABLISHING REGULATIONS ON PUBLIC PROCUREMENT",
"LAW N° 24/2009 OF 08/09/2009 DETERMINING THE ORGANISATION AND FUNCTIONING OF THE SCHOOL OF FINANCE AND BANKING (SFB",
"MINISTERIAL ORDER Nº002/07.01 OF 02/07/2015 INSTITUTING THE INTERNAL RULES AND REGULATIONS GOVERNING THE COUNCILS OF DECENTRALISED ADMINISTRATIVE ENTITIES",
"LAW N°75/2018 OF 07/09/2018 DETERMINING THE SOURCES OF REVENUE AND PROPERTY OF DECENTRALIZED ENTITIES",
"LAW N°86/2013 OF 11/09/2013 ESTABLISHING THE GENERAL STATUTES FOR PUBLIC SERVICE",
"LAW N° 44/2013 OF 16/06/2013 ESTABLISHING THE RWANDA LAW REFORM COMMISSION (RLRC) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N° 27/2010 OF 19/06/2010 RELATING TO ELECTIONS",
"LAW N°75/2018 OF 07/09/2018 DETERMINING THE SOURCES OF REVENUE AND PROPERTY OF DECENTRALIZED ENTITIES",
"DECRET-LOI DU 19 MARS 1974 PORTANT STATUT GENERAL DES AGENTS DE L’ETAT.",
"DECRET-LOI N° 36/79 DU 13 NOVEMBRE 1979 PORTANT O/GANISATION DES ELECTIONS DES CONSEILLERS COMMUNAUX",
"LOI N° 35/90 DU 22 JUIN 1990 PORTANT ORGANISATION ADMINISTRATIVE DE LA PREFECTURE DE LA VILLE DE KIGALI",
"DECRET-LOI N° 17/81 DU 22 AOUT 1981 PORTANT MODIFICATION DE LA LOI DU 5 JUILLET 1967 RELATIVE AU REGIME ELECTORAL",
"LAW N°23/2012 OF 15/06/2012 GOVERNING THE ORGANIZATION AND FUNCTIONING OF NURSERY, PRIMARY AND SECONDARY EDUCATION",
"ORGANIC LAW N°004/2018.OL. OF 21/06/2018 GOVERNING ELECTIONS",
"DECRET - LOI N° 02/81 DU 16 JANVIER 1981 PORTANT ORGANISATION DE L’ENSEIGNEMENT SUPERIEUR AU RWANDA",
"LOI ORGANIQUE No 1/1985 DU 25 JANVIER 1985 SUR L’EDUCATION NATIONALE DE LA REPUBLIQUE RWAN DAISE",
"LAW Nº87/2013 OF 11/09/2013 DETERMINING THE ORGANISATION AND FUNCTIONING OF DECENTRALIZED ADMINISTRATIVE ENTITIES",
"LAW N°62/2018 OF 25/08/2018 GOVERNING PUBLIC PROCUREMENT",
"ORGANIC LAW N° 12/2013/OL OF 12/09/2013 ON STATE FINANCES AND PROPERTY",
"MINISTERIAL ORDER N°001/14/10/TC OF 19/02/2014 ESTABLISHING REGULATIONS ON PUBLIC PROCUREMENT, STANDARD BIDDING DOCUMENTS AND STANDARD CONTRACTS",
"LAW N° 21 BIS/2009 OF 29/7/2009 ESTABLISHING “UMUTARA POLYTECHNIC” HIGHER INSTITUTE AND DETERMINING ITS STRUCTURE, ORGANISATION AND FUNCTIONING",
"PRESIDENTIAL ORDER N°107/01 OF 10/07/2014 DETERMINING RESPONSIBILITIES AND FUNCTIONING OF THE SECURITY COMMITTEE",
"DECRETE-LOI NO 04/77 DU 13 JANVIER 1977 COMPLETANT LA LOI DU 17 JUILLET 1968 RELATIVE AU REGIME DOUANIER",
"ORDONNANCE-LOI N0 22 DU 15/11/1965 PORTANT_MODIFICATION_DE_LA_LEGISLATION_DOUANIERE-J.O._N0_22-15.11.1965",
"MO No 005/04/10/MIN  OF 25/10/2004 RULES FOR CALCULATION OF IMPORT DUTIES",
"LOI DU 14/7/1964 PORTANT_MODIFICATON_DU_DECRET_DOUANIER_DE_1949-J.O._N0_14-",
"MINISTERIAL DECREE NO 052/00/FIN OF 16/11/2000 MODIFIANT AND COMPLEMENTING THE MINISTERIAL DECREE NO 08.09/FIN.4 OF JULY 27, 1968 STATING THE EXECUTION MEASURES OF THE JULY 17, 1968 LAW CONCERNING THE CUSTOMS LAW",
"ARRETE MINISTERIEL NO 06/FIN.08.05 DU 30 DECEMBRE 1976 RELATIF AUX DROITS DE MAGASIN EN DOUANE.",
"MO NO 005/04/FIN OF21/4/2004 AEXECUTION MEASURES OF THE CUSTOMS REGIMES 1968  MENDMENT",
"ARRETE MINISTERIEL NO 01/70 DU 27 MARS 1970 RELATIF A LA FIXATION DES TAXES REMUNERATOIRES, DE PROPAGANDE, DE DIVERSIFICATION ET EGALISATION A PERCEVOIR SUR LES CAFES EXPORTES DE LA REPUBLIQUE RWANDAISE",
"ARRETE MINISTERIEL NO 2/09 DU 12 AVRIL 1968 RELATIF A LA FIXATION DES TAXES REMUNERATOIRE, DE PROPAGANDE, DE DIVERSIFICATION ET D’EGALISATION A PERCEVOIR SUR LES CAFES EXPORTES DE LA REPUBLIQUE RWANDAISE",
"MINISTERIAL DECREE NO 050/00/FIN OF 16/11/2000 MODIFYING THE MINISTERIAL DECREE NO 08.09/FIN OF JULY 27,1968 STATING THE EXECUTION MEASURES OF THE JULY 17, 1968 LAW CONCERNING THE CUSTOMS REGIMES",
"MINISTERIAL ORDER NO 067 DU 26/09/2002 RELATED TO PRE-SHIPMENT INSPECTION OF GOODS IMPORTED TO RWANDA",
"LAW Nº 02/2000 OF 19/04/2000 RELATING TO PUBLIC SALE BY AUCTION, OF GOODS SEIZED OR CONFISCATED BY CUSTOMS",
"ARRETE MINISTERIEL NO 03/FIN 10.05. DU 15 JUIN 1993 MODIFIANT L’ARRETE MINISTERIEL NO 08.09./FIN. 4 DU 27 JUILLET 1968 PORTANT MESURES D’EXECUTION DE LA LOI DU 17 JUILLET 1968 RELATIVE AU REGIME DOUANIER",
"LOI NO 47/90 DU 14 DECEMBRE 1990 MODIFIANT ET COMPLETANT LA LOI NO 08/90 DU 31 JANVIER 1990 PORTANT LA LOI NO 08/90 DU 31 JANVIER 1990 PORTANT CREATION DE L’IMPOT SUR LE CHIFFRE D’AFFAIRES",
"LAW N°74/2008 OF 31/12/2008 MODIFYING AND COMPLEMENTING LAW Nº 25/2005 OF 04/12/2005 ON TAX PROCEDURES",
"ORDONNANCE-LOI DU 23 OCTOBRE 1964 DETERMINANT LE REGIME DES IMMUNITES DIPLOMATIQUES EN MATIERE FISCALE ET DOUANIERE ET LES REGIMES ASSIMILES",
"LOI DU 17 JUILLET RELATIVE AU REGIME DOUANIER",
"LOI NO 29/91 DU 28 JUIN 1991 RELATIVE A L’IMPOT SUR LE CHIFFRE D’AFFAIRES",
"ANNEX TO LAW N° 29/2010 OF 30/06/2010 MODIFYING AND COMPLEMENTING LAW N° 06/2001 OF 20/01/2001 ON THE CODE OF VALUE ADDED TAX",
"LAW Nº 04/2000 OF 19/04/2000 MODIFYING THE LAW OF JULY, 1968 RELATING TO CUSTOMS REGIME",
"ARRETE MINISTERIEL NO 08.09/FIN. 4 DU 27 JUILLET 1968- MESURES D’EXECUTION DE LA LOI DU 17 JUILLET 1968 RELATIVE AU REGIME DOUANIER",
"LAW N° 75/2008 OF 31/12/2008 MODIFYING AND COMPLEMENTING LAW N° 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LAW Nº28/2012 OF 27/07/2012 MODIFYING AND COMPLEMENTING LAW N° 16/2005 OF 18/08/2005 ON DIRECT TAXES ON INCOME AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N°22/2014 OF 30/06/2014 MODIFYING AND COMPLEMENTING LAW N° 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW Nº 26/2004 OF 03/12/2004 MODIFYING AND COMPLETING THE LAW Nº 06/2001 OF 20/01/2001 ON THE CODE OF VALUE ADDED TAX AS MODIFIED AND COMPLETED TO DATE",
"LAW N°57/2011 OF 31/12/2011 MODIFYING AND COMPLEMENTING LAW N° 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N°38/2009 OF 30/12/2009 MODIFYING AND COMPLETING LAW N° 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LAW N°24/2011 OF 29/06/2011 MODIFYING AND COMPLETING LAW N° 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LAW Nº 17/2014 OF 28/05/2014 MODIFYING AND COMPLEMENTING LAW N°25/2005 0F 4/12/2005 ON TAX PROCEDURES AS MODIFIED AND COMPLEMENTED TO DATE",
"COMMISSIONER GENERAL RULES N° 005/2009 OF 15/05/2009 MODIFYING AND COMPLETING COMMISSIONER GENERAL RULES N° 002/2007 OF 15/06/2007 IMPLEMENTING THE LAW N° 25/2005 OF 04/12/2005 ON TAX PROCEDURES",
"LOI NO 04/1983 DU 28 FEVRIER 1983 MODIFIANT L’ORDONNANCE-LOI DU 23 OCTOBRE 1964 DETERMINANT LE REGIME DES IMMUNITES DIPLOMATIQUES EN MATIERE FISCALE ET DOUANIERE ET LES REGIMES ASSIMILES",
"LAW Nº 24/2006 OF 16/05/2006 MODIFYING AND COMPLEMENTING THE LAW Nº 06/2001 OF 20/01/2001 ON THE CODE OF VALUE ADDED TAX",
"LAW Nº 38/2012 OF 20/12/2012 MODIFYING AND COMPLEMENTING LAW N° 25/2005 OF 04/12/2005 ON TAX PROCEDURES AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N°29/2010 OF 30/06/2010 MODIFYING AND COMPLEMENTING LAW N° 06/2001 OF 20/01/2001 ON THE CODE OF VALUE ADDED TAX AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW Nº 16/2005 OF 18/08/2005 2005 ON DIRECT TAXES ON INCOME",
"COMMISSIONER GENERAL RULES N° 002/2007 OF 15/06/2007 IMPLEMENTING THE LAW N° 25/2005 OF 04/12/2005 ON TAX PROCEDURES",
"LAW N°37/2015 OF 30/06/2015 MODIFYING AND COMPLEMENTING LAW N°26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS AS MODIFIED AND COMPLEMENTED TO DATE",
"MINISTERIAL ORDER No 009/10 OF 20/08/2010 IMPLEMENTING LAW Nº26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LOI NO 06/90 DU 31 JANVIER 1990 COMPLETANT LA LOI DU 17 JUILLET RELATIVE AU REGIME DOUANIER",
"LAW Nº 24/2010 OF 28/05/2010 MODIFYING AND COMPLEMENTING LAW N° 16/2005 OF 18/08/2005 ON DIRECT TAXES ON INCOME",
"LAW N°73/2008 OF 31/12/2008 MODIFYING AND COMPLEMENTING LAW Nº 16/2005 OF 18/08/2005 ON DIRECT TAXES ON INCOME",
"LAW N° 25/2005 OF 04/12/2005 ON TAX PROCEDURES",
"LAW Nº 02/2015 OF 25/02/2015 MODIFYING AND COMPLEMENTING LAW N° 37/2012 OF 09/11/2012 ESTABLISHING THE VALUE ADDED TAX",
"LAW N° 20/2007 OF 07/06/2007 MODIFYING AND COMPLEMENTING THE LAW Nº 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LAW N° 025 /2019 OF 13/09/2019 ESTABLISHING THE EXCISE DUTY",
"LAW N° 25/2010 OF 28/05/2010 MODIFYING AND COMPLEMENTING LAW N°06/2001 OF 20/01/2001 ON THE CODE OF VALUE ADDED TAX",
"LAW Nº40/2016 OF 15/10/2016 MODIFYING AND COMPLEMENTING LAW Nº37/2012 OF 9/11/2012 ESTABLISHING THE VALUE ADDED TAX AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N° 59/2011 OF 31/12/2011 ESTABLISHING THE SOURCES OF REVENUE AND PROPERTY OF DECENTRALIZED ENTITIES AND GOVERNING THEIR MANAGEMENT",
"MINISTERIAL ORDER No 001/20/10/TC OF 10/01/2020 SETTING STANDARD RATES AND OTHER CRITERIA TO DETERMINE THE TAX RATE APPLICABLE TO PLOTS OF LAND",
"LAW Nº 016/2018 OF 13/04/2018 ESTABLISHING TAXES ON INCOME",
"LOI NO 08/90 DU 31 JANVIER 1990 PORTANT CREATION DE L’IMPOT SUR LE CHIFFRE D’AFFARES",
"LAW Nº 01/2012 OF 03/02/2012 MODIFYING AND COMPLEMENTING LAW N° 25/2005 OF 04/12/2005 ON TAX PROCEDURES AS MODIFIED AND COMPLEMENTED TO DATE",
"LAW N° 026/2019 OF 18/09/2019  ON TAX PROCEDURES",
"PRESIDENTIAL ORDER N°25/01 OF 09/07/2012 ESTABLISHING THE LIST OF FEES AND OTHER CHARGES LEVIED BY DECENTRALIZED ENTITIES AND DETERMINING THEIR THRESHOLDS",
"LAW N°37/2012 OF 09/11/2012 ESTABLISHING THE VALUE ADDED TAX",
"LAW N°75/2018 OF 07/09/2018 DETERMINING THE SOURCES OF REVENUE AND PROPERTY OF DECENTRALIZED ENTITIES",
"MINISTERIAL ORDER Nº005/12/10/TC OF 22/06/2012 DETERMINING THE MODALITIES FOR THE IMPLEMENTATION OF LAW Nº 59/2011 OF 31/12/2011 ESTABLISHING THE SOURCE OF REVENUE AND PROPERTY OF DECENTRALIZED ENTITIES AND GOVERNING THEIR MANAGEMENT",
"Nº 21/2006 OF 28/04/2006 LAW ESTABLISHING THE CUSTOMS SYSTEM",
"DECRET-LOI DU 19/7/1974 PORTANT CODE_DE_LA_NATIONALITE_RWANDAISE-J.O._NO_15-1.8.1975",
"DECRET-LOI_NO_14-75-1975_MODIFICATION_DE_LA_LOI_PORTANT_CODE_MINIER-J.O._NO_8-15.4.1975",
"DECRET-LOI DU 19 DECEMBRE 1973 SUR LA PRESERVATION MORALE DE LA JEUNESSE",
"DECRET-LOI NO 19/77 DU 12/8/1977 MODIFIANT LA LOI DE 1967 PORTANT CODE DU TRAVAIL J.O.  NO 17-1/9/1977",
"LOI DU 11 NOVEMBRE 1964 RELATIVE AUX COLLECTES",
"ARRETE_P._NO_218-09-1975_MESURE_D_EXECUTION-DECRET-LOI_DE_1974_-PERSONNEL_SOUS_CONTRAT-J.O._NO__1_",
"DECRET-LOI NO 34/76 DU13/10/1976__RELATIF_A_L_EXPLOITATION_DE_CARRIERES-J.O._NO_21-1.11.1976",
"DECRET-LOI NO 20/76 DU 20 AVRIL 1976 OCTROYANT UNE PRIME A TOUTE PERSONNE PHSIQUE OU MORALE QUI AURA DECOUVERT UN GISEMENT IMPORANT DE MINERAIS AU RWANDA",
"LOI DU 19/3/1964 RELATIVE_AU_RECENSEMENT-CARTE_D_IDENTITE-CHANGEMENT_DE_RESIDENCE-J.O._N0_5-1.3.1964",
"LOI DU 28/9/1963 PORTANT CODE DE LA NATIONALITE RWANDAISE",
"LOI J.O. NO 5-1/3/1967 DU 28/2/1967 PORTANT CODE DU TRAVAIL",
"LAW Nº 14/2008 OF 04/6/2008 GOVERNING REGISTRATION OF THE POPULATION AND ISSUANCE OF THE NATIONAL IDENTITY CARD",
"LAW N° 29/2006 OF 20/07/2006 MODIFYING AND COMPLEMENTING LAW N° 34/2001 OF 05/07/2001 RELATING TO REFUGEES",
"LOI DU 27/4/1971 MODIFIANT LA LOI DU/1/1967 PORTANT CODE MINIER J.O.NO 10 15/5/1971",
"DECRET LOI NO 21/79 DU 23 JUILLET 1979 RELATIF A L EXPROPRIATION",
"DECRET-LOI NO 01/81 DU 06 JANVIER 1981  RELATIF AU  RECENSEMENT A LA CARTE D'IDENTITE, AU DOMICILE ET  A LA RESIDENCE DES RWANDAIS",
"LOI DU 30/1/1967 PORTANT CODE MINIER J.O. N0 4 15/2/1967",
"LAW Nº 11/2009  OF 14/5/2009 ON SECURITY INTERESTS IN MOVABLE PROPERTY",
"LAW N° 28/2004 OF 03/12/2004 RELATING TO MANAGEMENT OF ABANDONED PROPERTY",
"LAW N° 33/2012 OF 30/08/2012 MODIFYING AND COMPLEMENTING LAW N° 11/2009 OF 14/05/2009 ON SECURITY INTERESTS IN MOVABLE PROPERTY",
"LAW N° 17/2008 OF 20/06/2008 ESTABLISHING THE NATIONAL FORESTRY AUTHORITY (NAFA) A N D D E T E R M I N I N G I T S ORGANISATION, FUNCTIONING AND RESPONSIBILITIES",
"LAW N° 25/2007 OF 27/06/2007 ESTABLISHING RWANDA GEOLOGY AND MINES AUTHORITY (OGMR) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW Nº 30/2001 OF 12/1/2001 ON THE ORGANISATION, FUNCTIONNING AND SCOPE OF ACTIVITIES OF THE MEDICAL COUNCIL",
"LAW Nº 022/2009 OF 12/08/2009 REGULATING MEDIA IN RWANDA",
"LAW No44/2018 OF 13/08/2018 AMENDING LAW N°14/2008 OF 04/6/2008 GOVERNING REGISTRATION OF THE POPULATION AND ISSUANCE OF THE NATIONAL IDENTITY CARD",
"MINISTERIAL ORDER N° 005/19.20 OF 17/03/2020 DETERMINING MODALITIES FOR THE IMPLEMENTATION OF WORKING HOURS A WEEK IN THE PRIVATE SECTOR",
"PRESIDENTIAL ORDER N° 54/01 OF 12/10/2006 DETERMINING THE STRUCTURE, THE RESPONSIBILITIES, THE FUNCTIONING AND THE COMPOSITION OF LAND COMMISSIONS",
"PRESIDENTIAL ORDER N° 29/01 OF 05/07/2005 DESIGNATING GOVERNMENT OFFICERS TO SERVE AS NOTARIES, HEAD OFFICE AND JURISDICTION OF NOTARIAL AREAS",
"ORGANIC LAW N° 29/2004 OF 03/12/2004 ON RWANDAN NATIONALITY CODE",
"LAW Nº 22/99 OF 12/11/1999 TO SUPPLEMENT BOOK ONE OF THE CIVIL CODE AND TO INSTITUTE PART FIVE REGARDING MATRIMONIAL REGIMES, LIBERALITIES AND SUCCESSIONS",
"DECRET LOI NO 40/79 DU 14/12/1979 PORTANT MODIFICATION DE LA LOI  DU 27/4/79 MODIFIANT LA LOI  DU 30/01/1967 PORTANT CODE MINIER",
"MINISTERIAL ORDER Nº005/2008 OF 15/08/2008 ESTABLISHING MODALITIES OF INSPECTING COMPANIES OR ACTIVITIES THAT POLLUTE THE ENVIRONMENT",
"MINISTERIAL ORDER N°001/Minifom/2010 OF 09/06/2010 RESERVING A PART OF GISHWATI FOREST WHICH WAS INHABITED AS CLASSIFIED",
"MINISTERIAL ORDER N°007/16.01 OF 24/05/2013 DETERMINING THE MAIN MANAGEMENT VISIONS OF WATER RESOURCES IN THE MAIN HYDROGRAPHIC BASINS IN RWANDA",
"ORGANIC LAW N°30/2008 OF 25/07/2008 RELATING TO RWANDAN NATIONALITY",
"LAW N° 51/2001 OF 30/12/2001 ESTABLISHING THE LABOUR CODE",
"ORGANIC LAW N° 08/2005 OF 14/07/2005DETERMINING THE USE AND MANAGEMENT OF LAND IN RWANDA",
"MINISTERIAL ORDER No002/MINIRENA/2017 OF 30/01/2017 DETERMINING CONDITIONS AND MODALITIES FOR ASSIGNMENT OF REQUISITIONED LAND",
"MINISTERIAL ORDER Nº013/MOJ/AG/2017 OF 24/02/2017 DETERMINING MODALITIES FOR ACCESS TO AND PRACTICE OF THE OFFICE OF NOTARY BY PRIVATE PERSONS, SUPERVISION OF A PRIVATE NOTARY AND CONSERVATION OF AUTHENTIC DEEDS",
"LAW N° 57/2008 OF 10/09/2008 RELATING TO THE PROHIBITION OF MANUFACTURING, IMPORTATION, USE AND SALE OF POLYTHENE BAGS IN RWANDA",
"PRIME MINISTER’S ORDER N° 26/03 OF 23/10/2008 DETERMINING THE LIST OF CHEMICALS AND OTHER PROHIBITED POLLUTANTS",
"ORGANIC LAW N° 55/2008 OF 10/09/2008 GOVERNING NON- GOVERNMENTAL ORGANISATIONS",
"LAW Nº16/2012 OF 22/05/2012 DETERMINING THE ORGANIZATION, FUNCTIONING AND MISSION OF THE NATIONAL FUND FOR ENVIRONMENT (FONERWA)",
"MINISTERIAL ORDER N°02/10/MININFOR OF 17/2/2010 ON SHARE CAPITAL FOR MEDIA ORGANS OPERATING IN RWANDA",
"MINISTERIAL ORDER N° 006/16.01 OF 24/05/2013 DETERMINING THE ORGANIZATION OF WATER RESOURCES DATA COLLECTION, TREATMENT, MANAGEMENT, EXPLOITATION AND COMMUNICATION",
"MINISTERIAL ORDER Nº06 OF 13/07/2010 DETERMINING THE LIST OF WORST FORMS OF CHILD LABOUR, THEIR NATURE, CATEGORIES OF INSTITUTIONS THAT ARE NOT ALLOWED TO EMPLOY THEM AND THEIR PREVENTION MECHANISMS",
"MINISTERIAL ORDER N°006/Minifom OF 14/09/2010 DETERMINING TAXES APPLICABLE TO MINES AND QUARRIES",
"MINISTERIAL ORDER N° 01/MININTER/13 OF 14/11/2013 ESTABLISHING PROGRAMS AND STRATEGIES FOR THE EDUCATION AND CARE OF CHILDREN UNDER THREE (3) YEARS WHO LIVE WITH THEIR MOTHERS IN PRISON",
"MINISTERIAL ORDER N° 001/2018 OF 25/04/2018 DETERMINING THE LIST OF WORKS, ACTIVITIES AND PROJECTS SUBJECT TO AN ENVIRONMENTAL IMPACT ASSESSMEN",
"LAW N°24/2012 OF 15/06/2012 RELATING TO THE PLANNING OF LAND USE AND DEVELOPMENT IN RWANDA",
"LAW N° 20/2009 OF 29/07/2009 ESTABLISHING THE NATIONAL LAND CENTRE (NLC) AND DETERMINING ITS RESPONSIBLITIES, FUNCTIONING ORGANIZATION AND COMPETENCE",
"LAW N°63/2013 OF 27/08/2013 DETERMINING THE MISSION, ORGANIZATION AND FUNCTIONING OF RWANDA ENVIRONMENT MANAGEMENT AUTHORITY (REMA)",
"LAW N°54bis/2011 OF 14/12/2011 ESTABLISHING RWANDA METEOROLOGY AGENCY (METEO RWANDA) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"PRESIDENTIAL ORDER N°008/01 OF 10/05/2016 DETERMINING THE FUNCTIONING AND POWERS OF REGISTRAR OF LAND TITLES",
"MINISTERIAL ORDER N°004/16.01 OF 24/05/2013 DETERMINING THE LIST OF WATER POLLUTANTS",
"MINISTERIAL ORDER N°004/Minifom/2010 OF 14/09/2010 DETERMINING THE MODALITIES OF ENVIRONMENT CONSERVATION IN MINING AND QUARRY EXTRACTION",
"LAW N°43/2011 OF 31/10/2011 ESTABLISHING THE NATIONAL IDENTIFICATION AGENCY AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LOI N° 11/82 DU 30 MARS 1982 RELATIVE A LA PROTEC TION, A LA CONSERVATION ET A L’UTILISATION DES SOLS.",
"PRESIDENTIAL ORDER No002/01 OF 27/04/2016 DETERMINING THE MANAGEMENT AND USE OF LAND IN SPECIAL ECONOMIC ZONES (SEZ)",
"LAW Nº06/2017 OF 03/02/2017 ESTABLISHING RWANDA WATER AND FORESTRY AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°62/2008 OF 10/09/2008 PUTTING IN PLACE THE USE, CONSERVATION, PROTECTION AND MANAGEMENT OF WATER RESOURCES REGULATIONS",
"LAW N° 30/2009 OF 16/9/2009 DETERMINING THE MISSION, ORGANISATION AND FUNCTIONING OF THE MEDIA HIGH COUNCIL (MHC)",
"MINISTERIAL ORDER N°005/16.01 OF 15/07/2010 DETERMINING THE LIST OF PROHIBITED PLAINS TO CONSTRUCTIONS",
"LAW N° 70/2013 OF 02/09/2013 GOVERNING BIODIVERSITY IN RWANDA",
"LAW Nº05/2017 OF 03/02/2017 ESTABLISHING RWANDA LAND MANAGEMENT AND USE AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N°06/2012 OF 17/02/2012 DETERMINING ORGANISATION AND FUNCTIONING OF RELIGIOUS-BASED ORGANISATIONS",
"LAW N°54/2011 OF 14/12/2011 RELATING TO THE RIGHTS AND THE PROTECTION OF THE CHILD",
"PRIME MINISTERIAL ORDER Nº 126/03 OF 25/10/2010 DETERMINING THE RESPONSIBILITIES, ORGANIZATION AND FUNCTIONING OF COMMITTEES IN CHARGE OF THE ENVIRONMENT CONSERVATION AND PROTECTION",
"LAW N°33/2010 OF 24/09/2010 ESTABLISHING AKAGERA NATIONAL PARK",
"LAW N° 37/2008 OF 11/08/2008 ON MINING AND QUARRY EXPLOITATION",
"PRIME MINISTER’S ORDER No 006/03 OF 30/01/2017 DRAWING UP A LIST OF SWAMP LANDS, THEIR CHARACTERISTICS AND BOUNDARIES AND DETERMINING MODALITIES OF THEIR USE, DEVELOPMENT AND MANAGEMENT",
"LAW Nº47bis/2013 OF 28/06/2013 DETERMINING THE MANAGEMENT AND UTILISATION OF FORESTS IN RWANDA",
"LAW N° 16/2006 OF 03/04/2006 DETERMINING THE ORGANISATION, FUNCTIONING AND RESPONSIBILITIES OF RWANDA ENVIRONMENT MANAGEMENT AUTHORITY",
"MINISTERIAL ORDER N°001/16.01 OF 30/01/2013 MODIFYING AND COMPLEMENTING THE MINISTERIAL ORDER N°001/16.01 OF 26/04/2010 DETERMINING MODALITIES OF LAND SHARING",
"LAW N° 13/2009 OF 27/05/2009 REGULATING LABOUR IN RWANDA",
"ORDONNANCE-LOI_RELATIVE_AU_CONTROL_DES_PRIX-J.O._N0_4-15.2.1966",
"ORDONNANCE_RECONDUISANT_L_ORDONNANCE_DE_1964",
"ARRETE PRESIDENTIEL NO 118/05 DU 21 JUIN 1965 RELATIF AU CONTROLE DES PRIX",
"ORDONNANCE-LOI DU 25 AOUT 1970 PORTANT REGLEMENTATION D EL AVIATION CIVILE",
"DECRET-LOI NO 14/75 DU  9 AVRIL 1975 PORTANT MODIFICATION DE LA LOI  DU 27 AVRIL 1975  MODIFIANT LA LOI DU  30 JANVIER 1967 PORTANT CODE MINIER",
"DECRET-LOI NO 10/76 DU 4 MARS 1976 RELATIF AU TRANSFERT  D'ACTIVITES COMMERCIALES",
"ORDONNANCE-LOI DU 15 FEVRIER 1970 PORTANT REGLEMENTATION DE L'AVIATION CIVILE",
"LOI_RELATIVE_AUX_MARQUES_DE_FABRIQUE_ET_DE_COMMERCE__-J.O._N0_6-15.3.1963",
"ORDONNANCE-LOI DU 18/11/1964 RELATIVE_AU_CONTROL_DES_PRIX-CREATION_DE_LA_COMMISSION_DS_PRIX-J.O._N0_23-1.12.1964",
"ARRETE PRESIDENTIEL NO 308/11 DU  19 SEPTEMBRE 1978 PORTANT ORGANISATION ET ATTRIBUTIONS DES SERVICES DE L’OFFICE DU THE (OCIR-THE)",
"LOI_RELATIVE_AUX_BREVETS-J.O._N0_6-15.3.1963",
"ORDONNANCE -LOI DU 18 NOVEMBRE 1964 , RELATIVE  AU CONTROLE DE SPRIX ET  A LA CREATION DE LA COMMISSION DES PRIX",
"ORDONNANCE-LOI  DU 18 NOVEMBRE 1964 , RELATIVE AU CONTROLE DES PRIX  ET A LA CREATION DE LA COMMISSION DES PRIX",
"DIRECTIVES N02 OF 2017 REFINANCING FACILITY",
"DECRET-LOI NO 21/76 DU 21 AVRIL 1976 MODIFIANT LA LOI DU 23 JANVIER 1971  PORTANT REGLEMENTATION DE L'AVIATION CIVILE",
"DIRECTIVES N° 01 OF 2012 RESERVES REQUIREMENTS",
"LOI_DU_14.7.1964__RELATIVE_AU_CONTROL_DES_CHANGES_ET_DU_COMMERCE_EXTERIEURE-J.O._N0_14-15.7.1964",
"LOI NO 14/1986 DU 6 JUIN 1986 RELATIVE DANS ETABLISSEMENTS DE SANTE PUBLICS ET AGREES",
"LOI SUR LES DESSINS ET MODELES INDUSTRIELLES J.O.N 6-15.3.1963",
"DECRET-LOI DU 14 MARS 1974 RELATIF AUX SOINS MEDICAX",
"LOI_DU_19_FEVRIER_1964_RELATIVE_AU_SOINS_MEDICAUX-J.O._N0_5-1.3.1964",
"DECRET-LOI_N0_34-76-1976__RELATIF_A_L_EXPLOITATION_DE_CARRIERES-J.O._NO_21-1.11.1976",
"LOI_DU_24/4/1964_PORTANT_CREATION_DE_LA_BANQUE_NATIONALE_DU_RWANDA-J.O._N0_SP-9_MAI_1964",
"MINISTERIAL DECREE NO 20/14 OF 03/05/2005 DETERMINING A LIST OF DRUGS  AND OTHERS PHARMACEUTICALS  PRODUCTS WHICH MUST APPEAR IN A PHARMACEUTICAL POINT  OF SALE",
"LOI NO 14/2003 DU 23/05/2003 PORTANT SUR LA PRODUCTION, CONTROLE DE QUALITE ET COMMERCIALISATION",
"LOI NO 32/91 DU 05 AOUT 1991 MODIFIANT LA LOI NO 43/90 DU  1ER OCTOBRE 1990  PORTANT PROMOTION DES EXPORTATIONS",
"ARRETE MINISTERIEL NO 07.021/1003 DU 19 MAI 1971 RELATIF AU AERONEFS",
"LAW Nº 30/2014 OF 14/08/2014 MODIFYING AND COMPLEMENTING LAW N° 53/2011 OF 14/12/2011 ESTABLISHING RWANDA CIVIL AVIATION AUTHORITY (RCAA), AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LOI DU 23 JANVIER 1971 PORTANT  REGLEMENTATION DE L AVIATION CIVILE",
"ORDONNANCE-LOI DU 30 MAI 1969 PORTANT REGLEMENTATION DE L'AVIATION CIVILE",
"LOI N0 35/91 DU 05/8/1991 PORTANT ORGANISATION DU COMMERCE INTERIEUR-J.O._N0_17-1.9.1991",
"DECRET-LOI N0 43/76 DU 1ER  DECEMBRE 1976 PORTANT ORGANISATION DU REGIME POSTAL",
"LOI DU 15 NOVEMBRE 1962 SUR LA SECURITE SOCIALE",
"LOI DU 22 NOVEMBRE 1966 PORTANT STATUT DES SOCIETES COOPERATIVES",
"LAW Nº 01/2002 OF 17/11/2002 ASSURANCE EN GENERAL LAW NO 01 OF 2002 AMENDMENT",
"LOI DU 30/1/1967 PORTANT CODE MINIER J.O.N°4.15.2.1967",
"LOI DU 27/4/1971 MODIFIANT LA LOI DU 30/1/1967 PORTANT CODE MINIER J.O. N°10.15.5.1971",
"DIRECTIVE NO 3160/2021-00026(613) OF25/10/2021 ON CLARIFICATION_OF_DEFINITION_OF_MICRO_INSURANCE",
"MINISTERIAL ORDER N°01/09/MINICOM OF 08/05/2009 DETERMINING SMALL PRIVATE LIMITED COMPANY",
"LOI N° 06/1988 DU 12/2/1988 PORTANT ORGANISATION DES SOCIETE COMMERIALES-J.O.N°7.1.4.1988",
"LAW N°39/2001 OF 13/09/2001 ESTABLISHING AN AGENCY FOR THE REGULATION OF CERTAIN PUBLIC UTILITIES",
"LAW N° 06/2005 OF 03/06/2005 ESTABLISHING REGULATIONS AND CONDITIONS GOVERNING LEASE OPERATION",
"LAW N°41/2006 OF 39/9/2006 ESTABLISHING THE RESPONSIBILITIES, STRUCTURE AND FUNCTIONING OF RWANDA ANIMAL RESOURCES DEVELOPMENT AUTHORITY (RARDA)",
"LAW N°43/2006 OF 05/10/2006 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF THE RWANDA BUREAU OF STANDARDS (RBS)",
"LAW N°39/2006 OF 30/9/2006 DETERMINING THE RESPONSIBILITIES, ORGANISATION, AND FUNCTIONING OF RWANDA OFFICE OF TOURISM AND NATIONAL PARKS (ORTPN)",
"DÉCRET-LOI N° 40/79 DU 14 DÉCEMBRE 1979 PORTANT MODIFICATION DE LA LOI DU 27 AVRIL 1971 MODIFIANT LA LOI DU 30 JANVIER 1967 PORTANT CODE MINIER.",
"LAW N o40/2006 OF 30/9/2006 ESTABLISHING AND DETERMINING THE ORGANISATION, RESPONSIBILITIES AND FUNCTIONING OF RWANDA AGRICULTURAL DEVELOPMENT AUTHORITY (RADA)",
"REGULATION No 20 OF 05/07/2016 MODIFYING AND COMPLEMENTING REGULATION No14 OF 05/08/2013 ON THE REAL ESTATE INVESTMENT TRUSTS",
"LAW N° 44/2001 OF 30/11/2001 GOVERNING TELECOMMUNICATIONS",
"LAW N° 03/2007 OF 22/01/2007 DETERMINING THE RESPONSIBILITIES, ORGANISATION AND THE FUNCTIONING OF HUMAN RESOURCE AND INSTITUTIONAL CAPACITY DEVELOPMENT AGENCY (HIDA).",
"MINISTERIAL ORDER Nº10/2011 OF 20/5/2011 DETERMINING FEES FOR REGISTRATION OF COMPANIES’ BUSINESS ACTIVITIES",
"REGULATION NO 14/2011 ON THE PUBLICATION OF TARIFF OF INTEREST RATES AND FEES APPLIED BY BANKS",
"LAW N° 26/2005 OF 17/12/2005 RELATING TO INVESTMENT AND EXPORT PROMOTION AND FACILITATION",
"LAW N°14/2010 OF 07/05/2010 MODIFYING AND COMPLEMENTING LAW N° 07/2009 OF 27/04/2009 RELATING TO COMPANIES",
"LAW Nº 23/2005 OF 12/12/2005 ESTABLISHING MILITARY MEDICAL INSURANCE AND DETERMINING ITS ORGANISATION AND FUNCTIONING",
"MINISTERIAL ORDER No02/09/MINICOM OF 08/05/2009 RELATING TO BUSINESS OF LOW INCOME",
"LAW N° 01/2015 OF 25/02/2015 MODIFYING AND COMPLEMENTING LAW N°40/2008 OF 26/08/2008 ESTABLISHING THE ORGANISATION OF MICRO FINANCE ACTIVITIES",
"REGULATION 03/2015 OF 11/02/2015 ON ADMINISTRATIVE SANCTIONS APPLICABLE TO THE PAYMENT SYSTEMS OPERATORS AND PAYMENT SERVICE PROVIDERS",
"REGULATION N° 07/2012 OF 14/08/2012 RELATING TO SPECIAL PROCEDURES APPLICABLE TO WINDING UP OF INSURANCE COMPANIES",
"LAW N° 47/2018 OF 13/08/2018 MODIFYING LAW N° 03/2010 OF 26/02/2010 CONCERNING PAYMENT SYSTEM AS MODIFIED TO DATE",
"MINISTERIAL ORDER N° 028 OF 15/04/2019 RELATING TO INSOLVENCY PRACTITIONERS",
"REGULATION N°001/2010 OF 28/01/2010 RELATING TO MARKET CAPACITY FACILITATION FOR FOREIGN INSURERS",
"REGULATION N°06/2010 OF 27/12/2010 OF THE NATIONAL BANK OF RWANDA RELATING TO THE OVERSIGHT OF PAYMENT SYSTEMS AND THE ACTIVITIES OF PAYMENT SERVICE PROVIDERS",
"REGULATION N° 05/2008 ON CREDIT CONCENTRATION AND LARGE EXPOSURE",
"LAW N° 23/2017 OF 31/05/2017 ESTABLISHING THE CAPITAL MARKET AUTHORITY OF RWANDA (CMA) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 04/2015 OF 11/03/2015 MODIFYING AND COMPLEMENTING LAW N° 45/2010 OF14/12/2010 ESTABLISHING RWANDA SOCIAL SECURITY BOARD (RSSB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"ORGANIC LAW Nº 01/2009/OL OF 17/04/2009 MODIFYING AND COMPLEMENTING ORGANIC LAW N° 53/2008 OF 02/09/2008 ESTABLISHING RWANDA DEVELOPMENT BOARD (RDB) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONIN",
"REGULATION NO 07/2018 OF 27/03/2018 ON PAYMENT INITIATION AND AGGREGATION SERVICES",
"LAW Nº 53/2011 OF 14/12/2011 ESTABLISHING RWANDA CIVIL AVIATION AUTHORITY (RCAA), AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONNING",
"LAW N°50/2013 OF 28/06/2013 ESTABLISHING RWANDA STANDARDS BOARD (RSB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW N° 61/2013 OF 23/08/2013 ESTABLISHING NATIONAL STANDARDS INSPECTORATE, COMPETITION AND CONSUMER PROTECTION AUTHORITY (NICA) AND DETERMINING ITS MISSION, ORGANIZATION AND FUNCTIONING",
"LAW N° 007/2008 OF 08/04/2008 CONCERNING ORGANISATION OF BANKING",
"REGULATION N°04/2009 ON ACCREDITATION AND OTHER REQUIREMENTS FOR EXTERNAL AUDITORS OF BANKS, INSURERS AND INSURANCE BROKERS",
"LAW N°45/2010 OF14/12/2010 ESTABLISHING RWANDA SOCIAL SECURITY BOARD (RSSB) AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LOI NO 18/1982 DU 25 MAI 1982 RELATIVE AUX CONDITIONS D’EXPLOITER LES ENTREPRISES D’ASSURANCE",
"LAW N°38/2010 OF 25/11/2010 ESTABLISHING RWANDA AGRICULTURE BOARD (RAB) AND DETERMINING ITS RESPONSIBILITIES , ORGANISATION AND FUNCTIONING",
"REGULATION N° 08/2015 OF 13/11/2015 OF THE NATIONAL BANK OF RWANDA RELATING TO THE LICENSING CRITERIA OF OPERATING PAYMENT AND SECURITIES SETTLEMENT SYSTEMS",
"LAW N° 74/2013 OF 11/09/2013 ESTABLISHING RWANDA FOOD AND MEDICINES AUTHORITY AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"REGULATION Nº 10/2017 OF 19/05/2017 DETERMINING KEY FACTS STATEMENT AND INFORMATION DISCLOSURE FOR INSURANCE PRODUCTS",
"REGULATION N°13/2011 ON DISCOUNT HOUSE ACTIVITIES",
"LAW N°03/2010 OF 26/02/2010 CONCERNING PAYMENT SYSTEM",
"ORGANIC LAW N ° 30/2008 OF 25/07/2008 RELATING TO RWANDAN NATIONALITY",
"REGULATION N° 32/2020 OF 08/06/2020 DETERMINING ADMINISTRATIVE SANCTIONS APPLICABLE TO FINANCIAL INSTITUTION FOR NON COMPLIANCE WITH THE PREVENTION OF MONEY LAUNDERING, FINANCING TERRORISM AND FINANCING OF PROLIFERATION OF WEAPONS OF MASS DESTRUCTION REQUIREMENTS",
"LAW No20/2013 OF 25/03/2013 REGULATING THE CREATION OF TRUSTS AND TRUSTEES",
"INSTRUCTIONS OF THE REGISTRAR GENERAL NO 01/2010/ORG OF 12/04/ 2010 RELATING TO THE FORM AND CONTENT OF A PROSPECTUS",
"REGULATION N°13/2017 OF 23/11/2017 ON TRANSACTIONS WITH BANK RELATED PARTIES AND MANAGEMENT OF CREDIT CONCENTRATION RISK",
"LAW Nº 75/2013 OF 11/9/2013 ESTABLISHING REGULATIONS GOVERNING CIVIL AVIATION",
"LAW N° 37/2008 OF 11/08/2008 ON MINING AND QUARRY EXPLOITATION",
"LAW N° 40/2011 OF 20/09/2011 REGULATING COLLECTIVE INVESTMENT SCHEMES IN RWANDA",
"LOI NO  28/90 DU 8  MAI 1990 PORTANT CONTROLE DES CHANGES",
"LAW N°52/2010 OF 20/01/2011 GOVERNING CIVIL AVIATION",
"REGULATION No 2100 /2018 - 00011[614] OF 12/12/2018 OF THE NATIONAL BANK OF RWANDA GOVERNING NON DEPOSIT TAKING LENDING FINANCIAL INSTITUTIONS",
"GUIDELINES No 21 OF 05/07/2016 GOVERNING THE DEVELOPMENT OF REAL ESTATE INVESTMENT TRUST",
"LAW Nº 42/2011 OF 31/10/2011 RELATING TO CIVIL AVIATION SECURITY",
"REGULATION N° 2310/2018 - 00021[614] OF 27/12/2018 OF THE NATIONAL BANK OF RWANDA GOVERNING AGENTS",
"LAW N° 13/2014 OF 20/05/2014 ON MINING AND QUARRY OPERATIONS",
"LAW N° 06/2015 OF 28/03/2015 RELATING TO INVESTMENT PROMOTION AND FACILITATION",
"LAW N° 55/2007 OF 30/11/2007 GOVERNING THE CENTRAL BANK OF RWANDA",
"LOI DU 14 JUILLET SUR LE CONTROLE DES BANQUES",
"REGULATION N o 2100 /2018 – 00012 [614] OF 12/12/2018 OF THE NATIONAL BANK OF RWANDA GOVERNING THE ORGANISATION OF MICROINSURANCE BUSINESS",
"DECRET-LOI NO 20/75 DU 20 JUIN 1975 RELATIF AUX ASSURANCES",
"LAW N°21/2018 OF 29/04/2018 MODIFYING LAW N° 42/2011 OF 31/10/2011 RELATING TO CIVIL AVIATION SECURITY",
"LOI NO 36/90 DU 25 JUILLET 1990 PORTANT ORGANISATION DES CIRCUITS DE COMMERCIALISATION, DE FORMATION ET DE CONTROLE DES PRIX",
"LAW N° 40/2008 OF 26/08/2008 ESTABLISHING THE ORGANISATION OF MICRO FINANCE ACTIVITIES",
"REGULATION Nº 4230 /2019 - 00026[ 614 ] OF 26/06/2019 ON LICENSING REQUIREMENTS AND OTHER CONDITIONS FOR INSURANCE INTERMEDIARIES",
"REGULATION N° 30 /2019 OF 16/12/2019 ON PUBLICATION OF FINANCIAL STATEMENTS AND OTHER DISCLOSURES BY INSURERS",
"DECRET-LOI NO 07/81 DU 28 AVRIL 1981 PORTANT REGLEMENTATION DES INSTITUTIONS FINANCIERES",
"REGULATION Nº14 ON REAL ESTATE INVESTMENT TRUSTS",
"LAW N°27/2017 OF 31/05/2017 GOVERNING COMPANIES",
"LAW N°33/2010 OF 24/09/2010 ESTABLISHING AKAGERA NATIONAL PARK",
"DÉCRET - LOI N° 06/81 DU 16 FÉVRIER 1981 POR TANT RÉORGANISATION DE LA BANQUE NATIONALE DU RWANDA.",
"LAW N°17/2018 OF 13/04/2018  GOVERNING COMPANIES",
"LAW N°07/2009 OF 27/04/2009  RELATING TO COMPANIES",
"LAW Nº52/2008 OF 10/09/2008 GOVERNING TO THE ORGANIZATION OF INSURANCE BUSINESS",
"LOI NO 43/90 DU 1 OCTOBRE 1990 PORTANT PROMOTION DES EXPORTATIONS",
"MINISTERIAL ORDER N° 003/16.01 OF 24/05/2013 DETERMINING THE STRUCTURE AND CONTENTS OF THE AQUACULTURE AND FISHING CONCESSION CONTRACT",
"CONVENTION 150-CONVENTION CONCERNING LABOUR ADMINISTRATION: ROLE, FUNCTIONS AND ORGANIZATION",
"MINISTERIAL ORDER Nº 004/19.20 OF 17/03/2020 DETERMINING ESSENTIAL SERVICES THAT SHOULD NOT BE INTERRUPTED DURING STRIKE OR LOCK-OUT",
"LAW N° 012/2023 OF 13/03/2023 REGULATING THE USE OF THE HUMAN BODY, ORGANS, TISSUES, CELLS AND PRODUCTS OF THE HUMAN BODY",
"MINISTERIAL ORDER  Nº 001/MINEDUC/2023 OF 04/01/2023 DETERMINING BENEFITS FOR LEARNERS",
"PRIME MINISTER’S ORDER N° 017/03 OF 04/10/2023 ESTABLISHING SPECIAL STATUTE GOVERNING DIPLOMATIC OFFICERS",
"PRESIDENTIAL ORDER N° 083/01 OF 28/08/2020 ESTABLISHING THE NATIONAL CHILD DEVELOPMENT AGENCY",
"REGULATION No 57/2023 OF 27/03/2023 ESTABLISHING LICENSING  REQUIREMENTS AND OTHER  CONDITIONS FOR DEPOSIT-TAKING  MICROFINANCE INSTITUTIONS",
"LAW Nº 017/2023 OF 30/03/2023 AMENDING LAW No 13bis/2014 OF 21/05/2014 GOVERNING THE OFFICE OF NOTARY",
"PRESIDENTIAL ORDER N° 028/01 OF 18/05/2023 GOVERNING RWANDA MINES, PETROLEUM AND GAS BOARD",
"PRIME MINISTER’S INSTRUCTIONS N° 002/03 OF 21/10/2022 RELATING TO THE GOVERNMENT SUPPORT FOR AFFORDABLE HOUSING PROJECTS",
"PRESIDENTIAL ORDER Nº 045/01 OF 08/03/2024 GOVERNING NATIONAL REHABILITATION SERVICE",
"LAW Nº 001/2023 OF 13/01/2023 GOVERNING NATIONAL PARKS AND  NATURE RESERVES",
"LOI N° 02 DE 1996 PORTANT PRIVATISATION ET INVESTISSEMENT  PUBLIC",
"AMENDMENT OF DECEMBER 11TH, 2000 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"HOST COUNTRY AGREEMENT BETWEEN THE GOVERNMENT OF THE REPUBLIC OF RWANDA AND FIFA DEVELOPMENT ZURICH AG",
"GENERAL AGREEMENT FOR DEVELOPMENT CO-OPERATION BETWEEN THE GOVERNMENT OF CANADA AND THE GOVERNMENT OF THE REPUBLIC OF RWANDA",
"CONVENTION INTERNATIONAL ON THE SUPPRESSION OF UNLAWFUL ACTS RELATING TO CIVIL AVIATION",
"PRESIDENTIAL ORDER N° 051/01 OF 19/04/2024 GOVERNING THE APPEAL TRIBUNAL FOR REFUGEES AND APPLICANTS FOR REFUGEE STATUS",
"LAW N° 041/2024 OF 19/04/2024 AMENDING LAW N° 30/2018 OF 02/06/2018 DETERMINING THE JURISDICTION OF COURTS",
"LAW N° 042/2024 OF 19/04/2024 GOVERNING REFUGEES AND APPLICANTS FOR REFUGEE STATUS IN RWANDA",
"PRIME MINISTER’S ORDER N° 015/03 OF 16/04/2024 RELATING TO MEDICAL INSURANCE PROVIDED BY THE ORGAN OF MILITARY MEDICAL INSURANCE",
"PRIME MINISTER’S ORDER N° 014/03 OF 16/04/2024 ESTABLISHING SPECIAL STATUTE GOVERNING EMPLOYEES OF THE ORGAN OF MILITARY MEDICAL INSURANCE",
"PRESIDENTIAL ORDER Nº 049/01 OF 12/04/2024 AMENDING PRESIDENTIAL ORDER Nº 044/01 OF 14/02/2020 ESTABLISHING SPECIAL STATUTE GOVERNING RWANDA DEFENCE FORCE",
"LAW N° 039/2024 OF 22/03/2024 ESTABLISHING THE DEPOSIT GUARANTEE FUND",
"MINISTERIAL ORDER NO 001/MOE/24 OF 02/04/2024 RELATING TO WATER RESOURCES USE PERMIT",
"PRIME MINISTER’S ORDER N° 008/03 OF 03/07/2022 DETERMINING  MODALITIES FOR LAND  ALLOCATION AND ACQUISITION,  EMPHYTEUTIC LEASE, AND STATE  LAND CONCESSION AND LEASE",
"LAW N° 75/2008 OF 31/12/2008 MODIFYING AND COMPLEMENTING LAW N° 26/2006 OF 27/05/2006 DETERMINING AND ESTABLISHING CONSUMPTION TAX ON SOME IMPORTED AND LOCALLY MANUFACTURED PRODUCTS",
"LAW N°60/2013 OF 22/08/2013 REGULATING THE INTERCEPTION OF COMMUNICATIONS",
"LAW N° 12/2007 OF 27/03/2007 ON PUBLIC PROCUREMENT",
"AMENDMENT OF DECEMBER 11TH, 2000 OF THE FUNDAMENTAL LAW OF THE REPUBLIC OF RWANDA",
"PRESIDENTIAL ORDER N° 57/01 OF 15/10/2006 DETERMINING THE STRUCTURE AND FUNCTIONING OF VILLAGE, CELL AND SECTOR",
"LAW N° 28/2007 OF 27/06/2007 ESTABLISHING A CENTRE FOR TREATMENT AND RESEARCH ON AIDS, MALARIA, TUBERCULOSIS AND OTHER EPIDEMICS (TRAC Plus), AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"LAW N° 37/2007 OF 03/09/2007 DETERMINING THE ORGANISATION, FUNCTIONING AND RESPONSIBILITIES OF THE UNIVERSITY HOSPITAL CENTRE (CHU)",
"LAW N° 38/2007 OF 04/09/2007 ESTABLISHING AND DETERMINING THE RESPONSIBILITIES, ORGANISATION AND FUNCTIONING OF THE NATIONAL MEDICAL REFERRAL LABORATORY (LNR)",
"ORGANIC LAW  Nº 53/2008 OF 02/09/2008 ESTABLISHING RWANDA DEVELOPMENT BOARD (RDB) AND DETERMINING ITS RESPONSIBILITIES, ORGANISATION AND FUNCTIONING",
"AGREEMENT ON COMMONWEALTH AGRICULTURE BUREAU (CAB INTERNATIONAL)",
"PROTOCOL AMENDING THE MARRAKESH AGREEMENT ESTABLISHING THE WORLD TRADE ORGANIZATION",
"UNITED NATIONS CONVENTION AGAINST TRANSNATIONAL ORGANIZED CRIME",
"LAW N° 20/2010 OF 09/06/2010 MODIFYING AND COMPLEMENTING LAW N°31/2005 OF 24/12/2005 RELATING TO THE ORGANISATION AND FUNCTIONING OF THE NATIONAL ELECTORAL COMMISSION",
"LAW N°38/2013 OF 16/06/2013 MODIFYING AND COMPLEMENTING LAW No 31/2005 OF 24/12/2005 RELATING TO THE ORGANIZATION AND FUNCTIONING OF NATIONAL ELECTORAL COMMISSION AS MODIFIED AND COMPLEMENTED TO DATE",
"THE CONSTITUTION OF THE REPUBLIC OF RWANDA",
"MINISTERIAL ORDER NO 001/01 OF 10/05/2024 DETERMINING ELEMENTS OF ADVANCE PASSENGER INFORMATION AND PASSENGER NAME RECORD DATA, AND TIME OF THEIR TRANSMISSION",
"PRIME MINISTER’S ORDER N° 023/03 OF 17/05/2024 GOVERNING SECTORAL DECENTRALISATION",
"INTERNATIONAL TREATY ON PLANT GENETIC RESOURCES FOR FOOD AND AGRICULTURE",
"INTERNATIONAL PLANT PROTECTION CONVENTION",
"PHYTO-SANITARY CONVENTION FOR AFRICA",
"AGREEMENT BETWEEN THE ECONOMIC COMMUNITY OF CENTRAL AFRICAN STATES (ECCAS) AND THE REPUBLIC OF RWANDA, ON THE READMISSION OF THE REPUBLIC OF RWANDA TO THE ECONOMIC COMMUNITY OF CENTRAL AFRICAN STATES (ECCAS)",
"LAW Nº 006/2024 OF 19/01/2024 GOVERNING ADVANCE PASSENGER INFORMATION AND PASSENGER NAME RECORD DATA",
"PRESIDENTIAL ORDER N° 059/01 OF 16/06/2024 DETERMINING THE POLLING DATE AND ELECTORAL CAMPAIGN PERIOD FOR ELECTIONS OF SENATORS",
"LAW Nº 053/2024 OF 07/06/2024 GOVERNING THE UNIVERSITY OF RWANDA",
"LAW N° 054/2024 OF 07/06/2024 GOVERNING RWANDA POLYTECHNIC",
"LAW N° 052/2024 OF 07/06/2024 AMENDING LAW N° 017/2020 OF 07/10/2020 ESTABLISHING THE GENERAL STATUTE GOVERNING PUBLIC SERVANTS",
"LAW N° 051/2024 OF 07/06/2024 ESTABLISHING RWANDA NATIONAL DEFENCE AND SECURITY ORGANS SHOP",
"LAW N°34/2012 OF 03/09/2012 ESTABLISHING RWANDA DEFENCE FORCES AND RWANDA NATIONAL POLICE SHOP AND DETERMINING ITS MISSION, ORGANISATION AND FUNCTIONING",
"LAW Nº 046/2024 OF 04/06/2024 GOVERNING FORESTS AND TREES",
"LAW N° 049/2024 OF 04/06/2024 AMENDING LAW N° 003/2016 OF 30/03/2016 ESTABLISHING AND GOVERNING MATERNITY LEAVE BENEFITS SCHEME",
"LAW N°003/2016 OF 30/03/2016 ESTABLISHING AND GOVERNING MATERNITY LEAVE BENEFITS SCHEME",
"LAW N° 045/2024 OF 31/05/2024 GOVERNING PRIVATISATION",
"MINISTERIAL ORDER NO 007/03/10/MIN/ OF 07/08/2003 DETERMINING PROCEDURES FOR THE PRIVATISATION OF PUBLIC SERVICES AND ENTREPRISES  AND FOR THE SELLING OF GOVERNMENT SHARES AND PARTNERSHIP SHARES IN SEMI-PUBLIC COMPANIES",
"PRESIDENTIAL DECREE N° 08/14 OF 3rd MAY 1996 ON THE ESTABLISHMENT OF A NATIONAL COMMISSION FOR PRIVATISATION AND PUBLIC INVESTMENT.",
"DIRECTIVES OF THE COMMISSIONER GENERAL Nº 001/2024 OF 31/05/2024 DETERMINING MODALITIES AND CONDITIONS FOR PAYMENT OF TAX ARREARS IN INSTALMENTS",
"LAW N° 044/2024 OF 30/05/2024 GOVERNING BANKS",
"VIOLENCE AND HARASSMENT CONVENTION N° 190 OF 2019",
"INSTRUMENT FOR THE AMENDMENT OF THE CONSTITUTION OF THE INTERNATIONAL LABOUR ORGANIZATION",
"NORTHERN CORRIDOR TRANSPORT AND TRANSIT AGREEMENT",
"CONVENTION ON THE NATIONALITY OF MARRIED WOMEN",
"PRESIDENTIAL ORDER N o 092/01 OF 21/09/2020 DETERMINING RESPONSIBILITIES OF THE EXECUTIVE SECRETARY OF CELL",
"PRESIDENTIAL ORDER N° 170/01 OF 23/12/2014 DETERMINING THE RESPONSIBILITIES OF THE EXECUTIVE SECRETARY OF CELL",
"LAW N° 64/2024 OF 20/06/2024 DETERMINING MISSIONS, ORGANISATION AND POWERS OF THE RWANDA DEFENCE FORCES",
"LAW Nº 65/2024 OF 20/06/2024 GOVERNING THE CHANCELLERY FOR HEROES, NATIONAL ORDERS AND DECORATIONS OF HONOUR",
"LAW N° 062/2024 OF 20/06/2024 GOVERNING EVIDENCE",
"LAW N° 23/2018 OF 29/04/2018 RELATING TO INSOLVENCY AND BANKRUPTCY",
"ORGANIC LAW N° 04/2005 OF 08/04/2005 DETERMINING THE MODALITIES OF PROTECTION, CONSERVATION AND PROMOTION OF ENVIRONMENT IN RWANDA",
"LAW N°21/2012 OF 14/06/2012 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE PROCEDURE",
"LAW N° 09/2006 OF 02/03/2006 MODIFYING AND COMPLEMENTING LAW N°18/2004 OF  20/06/2004 RELATING TO THE CIVIL, COMMERCIAL, LABOUR AND ADMINISTRATIVE  PROCEDURE",
"LAW Nº 30/2013 OF 24/5/2013 RELATING TO THE CODE OF CRIMINAL PROCEDURE",
"LAW N° 057/2024 OF 20/06/2024 GOVERNING COOPERATIVES IN RWANDA",
"PRIME MINISTER’S ORDER N° 028/03 OF 28/06/2024 DETERMINING THE REGULATORY AUTHORITY FOR GAMING ACTIVITIES",
"LAW Nº 063/2024 OF 20/06/2024 AMENDING LAW Nº 072/2021 OF 05/11/2021 GOVERNING DEPOSIT-TAKING MICROFINANCE INSTITUTIONS",
"MINISTERIAL ORDER N° 002/MoE/24 OF 10/07/2024 RELATING TO TEMPORARY REQUISITION OF LAND AND TERMINATION OF LAND OWNERSHIP CONTRACT",
"LAW Nº 0566/2024 OF 26/06/2024 ESTABLISHING TAX ON MINERALS",
"PRIME MINISTER’S ORDER N° 028/03 OF 28/06/2024 DETERMINING THE REGULATORY AUTHORITY FOR GAMING ACTIVITIES",
"LAW N° 08/2006 OF 24 FEBRUARY 2006 DETERMINING THE ORGANISATION AND  FUNCTIONING OF THE DISTRICT",
"LAW N° 058/2024 OF 20/06/2024 GOVERNING NON-GOVERNMENTAL ORGANISATIONS",
"AP N° 252/11 DU 13 /11/1975 SUR LE CONTROLE PHYTOSANITAIRE DES VEGETAUX ET DES PRODUITS VEGETAUX DESTINES A L’IMPORTATION ET A L’EXPORTATION ET LES CONSTATS DE QUALITE ET D’AVARIE",
"LOI  N°43/90 DU 1er/10/1990 PORTANT PROMOTION DES EXPORTATIONS",
"LOI  N°32/91 DU 5/08/1991 MODIFIANT LA LOI N°43/90 DU 1er/10/1990 PORTANT PROMOTION DES EXPORTATIONS",
"LAW N° 30/2007 OF 06/07/2007  DETERMINING THE ORGANIZATION  AND FUNCTIONING OF THE NATIONAL  COMMISSION FOR HUMAN RIGHTS",
"LOI DU 23 JANVIER 1971 MODIFIANT LA LOI DU 15 AVRIL 1963 SUR L’ORGANISATION TERRITORIALE DE LA REPUBLIQUE",
"ARRETE DU PREMIER MINISTRE N°04/02 DU 7/3/1996 PORTANT COMMISSINNEMENT ET AFFECTATION D’AGENTS DES CADRES DE L’ADMINISTRATION CENTRALE",
"CIRCULAIRE PRESIDENTIELLE N°1297/01.13 DU 13/12/1974 SUR LA FORCE OBLIGATOIRE DES ACTES LEGISLATIFS ET REGLEMENTAIRES",
"ITEGEKO RIGENGA IMIKORERE Y’INTEKO ISHINGA AMATEGEKO Y’INZIBACYUHO",
"LOI ORGANIQUE N°08/95 DU 6/12/95 PORTANT MODIFICATION DU DECRE-LOI N°07/80 DU 7 JUILLET PORTANT CODE D’ORGANISATION ET DE COMPETENCE JUDICIAIRE ET INSTITUANT L’AUDITORAT MILITAIRE",
"DECRET-LOI N°002/94 PORTANT MODIFICATION DU DECRE-LOI N°09/80 DU 7 JUILLET 1980 PORTANT CODE D’ORGANISATION ET DE COMPETENCE JUDICIAIRE ET INSTITUANT L’AUDITORAT MILITAIRE",
"LOI ORGANIQUE N°08/95 DU 3/96/ DU 29/3/1996 PORTANT ORGANISATION FONCTIONNEMENT ET COMPETENCES DU CONSEIL SUPERIEUR DE LA MAGISTRATURE",
"LOI ORGANIQUE N°08/95 DU 06/6/1996 PORTANT ORGANISATION FONCTIONNEMENT ET COMPETENCES DE LA COUR SUPREME",
"Organic Law N° 16/2003 of 27/06/2003 governing political organizations and politicians",
"LOI N°02/92 DU 11/03/1992 PORTANT CREATION DE L’OFFICE NATIONALE DES POSTES",
"ARRETE N°32/01 DU 14/12/1995 PRESIDENTIEL PORTANT EMISSION DE TIMBRES POSTE",
"ARRETE PRESIDENTIEL N°553/04  DU 31/5/1991 PORTANT CREATION ET ORGANISATION DU FONDS D’ASSISTANCE AUX VICTIMES DE GUERRE",
"LOI DU 9 MAI 1964 FIXANT LE MONTAT DE LA CONTRIBUTION PERSONELLE MINIMUM DUE PAR LES CONTRIBUABLES POUR L’EXERCICE FISCAL 1964",
"LOI N° 10/95 DU 6/10/1995 PORTANT MODIFICATION DE LA LOI DU 5 MARS 1968 TEL QUE MODIFIEE A CE JOUR RELATIVE ALA TAXE DE CONSOMMATION A PERCEVOIR SUR LES BIERES DE FABRICATION LOCALE",
"ARRETE MINISTERIEL N°01/71/Agri DU 30/3/1971 RELATIF A LA FIXATION DES TAXES REMUNERATOIRES, DE PROPAGANDE, DE DIVERSIFICATION ET D’EGALISATION A PERCEVOIR SUR LES CAFES EXPORTES DE LA REPUBLIQUE RWANDAISE",
"LOI N° 06/95 DU 4/8/1995 PORTANT CONFIRMATION DU DECRET-LOI N°01/301 DU 15 FEVRIER 1995 PORTANT FIXATION DU TARIF DE DROIT D’ENTRÉE SUR LES PRODUITS IMPORTES",
"ARRETE MINISTERIEL N°01/79 DU 24/4/1979 FIXANT LE TAUX DE DIVERSES REDEVENCES DOMANIALES ET LE TARIF DES PRIX DE VENTE ET DE LOCATION DES TERRES DOMANIALES",
"LAW N° 059/2024 OF 20/06/2024 AMENDING LAW N° 20/2018 OF 29/04/2018 ESTABLISHING REGULATIONS GOVERNING CIVIL AVIATION",
"PRESIDENTIAL ORDER N° 066/01 OF 19/07/2024 AMENDING PRESIDENTIAL DECREE N° 85/01 OF 02/09/2002 REGULATING GENERAL TRAFFIC POLICE AND ROAD TRAFFIC",
"MINISTERIAL ORDER N° 01/MIN/024 OF 19/07/2024 DETERMINING THE MODEL OF NATIONAL DRIVING LICENSE",
"AMABWIRIZA YA KOMISIYO Y’IGIHUGU Y’AMATORA N° 003/24 YO KU WA 26/07/2024 AGENGA ITORA RY’ABASENATERI RYO MU MWAKA WA 2024",
"AMABWIRIZA YA KOMISIYO Y’IGIHUGU Y’AMATORA N° 002/24 YO KU WA 26/07/2024 AGENGA AMATORA Y’ABAJYANAMA B’UMUJYI WA KIGALI YO MU MWAKA WA 2024",
"ORGANIC LAW N° 002/2024.OL OF 12/07/2024 DETERMINING THE FUNCTIONING OF THE CHAMBER OF DEPUTIES",
"MINISTERIAL ORDER N° 001/MoH/2024 OF 11/07/2024 ON MODALITIES FOR THE USE OF THE HUMAN BODY, ORGANS, TISSUES, CELLS AND PRODUCTS OF THE HUMAN BODY",
"LAW N° 072/2024 OF 26/06/2024 ON MINING AND QUARRY OPERATIONS"
    ]
}
